{
  "title": "Binary search tree",
  "summary": "In computer science, a binary search tree (BST), also called an ordered or sorted binary tree, is a rooted binary tree data structure with the key of each internal node being greater than all the keys in the respective node's left subtree and less than the ones in its right subtree. The time complexity of operations on the binary search tree is linear with respect to the height of the tree.\nBinary search trees allow binary search for fast lookup, addition, and removal of data items. Since the no",
  "content": "---\ntitle: Binary search tree\nurl: https://en.wikipedia.org/wiki/Binary_search_tree\nlanguage: en\ncategories: [\"Category:Articles with example C++ code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with short description\", \"Category:Binary trees\", \"Category:CS1: long volume value\", \"Category:CS1 Russian-language sources (ru)\", \"Category:Commons category link is on Wikidata\", \"Category:Good articles\", \"Category:Search trees\", \"Category:Short description is different from Wikidata\"]\nreferences: 0\nlast_modified: 2024-12-19T13:42:02Z\n---\n\n# Binary search tree\n\n## Summary\n\nIn computer science, a binary search tree (BST), also called an ordered or sorted binary tree, is a rooted binary tree data structure with the key of each internal node being greater than all the keys in the respective node's left subtree and less than the ones in its right subtree. The time complexity of operations on the binary search tree is linear with respect to the height of the tree.\nBinary search trees allow binary search for fast lookup, addition, and removal of data items. Since the no\n\n## Full Content\n\nIn computer science, a binary search tree (BST), also called an ordered or sorted binary tree, is a rooted binary tree data structure with the key of each internal node being greater than all the keys in the respective node's left subtree and less than the ones in its right subtree. The time complexity of operations on the binary search tree is linear with respect to the height of the tree.\nBinary search trees allow binary search for fast lookup, addition, and removal of data items. Since the nodes in a BST are laid out so that each comparison skips about half of the remaining tree, the lookup performance is proportional to that of binary logarithm. BSTs were devised in the 1960s for the problem of efficient storage of labeled data and are attributed to Conway Berners-Lee and David Wheeler.\nThe performance of a binary search tree is dependent on the order of insertion of the nodes into the tree since arbitrary insertions may lead to degeneracy; several variations of the binary search tree can be built with guaranteed worst-case performance. The basic operations include: search, traversal, insert and delete. BSTs with guaranteed worst-case complexities perform better than an unsorted array, which would require linear search time.\nThe complexity analysis of BST shows that, on average, the insert, delete and search takes \n  \n    \n      \n        O\n        (\n        log\n        ⁡\n        n\n        )\n      \n    \n    {\\displaystyle O(\\log n)}\n  \n for \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n nodes. In the worst case, they degrade to that of a singly linked list: \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n  \n. To address the boundless increase of the tree height with arbitrary insertions and deletions, self-balancing variants of BSTs are introduced to bound the worst lookup complexity to that of the binary logarithm. AVL trees were the first self-balancing binary search trees, invented in 1962 by Georgy Adelson-Velsky and Evgenii Landis.\nBinary search trees can be used to implement abstract data types such as dynamic sets, lookup tables and priority queues, and used in sorting algorithms such as tree sort.\n\nHistory\nThe binary search tree algorithm was discovered independently by several researchers, including P.F. Windley, Andrew Donald Booth, Andrew Colin, Thomas N. Hibbard. The algorithm is attributed to Conway Berners-Lee and David Wheeler, who used it for storing labeled data in magnetic tapes in 1960. One of the earliest and popular binary search tree algorithm is that of Hibbard.\nThe time complexities of a binary search tree increases boundlessly with the tree height if the nodes are inserted in an arbitrary order, therefore self-balancing binary search trees were introduced to bound the height of the tree to \n  \n    \n      \n        O\n        (\n        log\n        ⁡\n        n\n        )\n      \n    \n    {\\displaystyle O(\\log n)}\n  \n. Various height-balanced binary search trees were introduced to confine the tree height, such as AVL trees, Treaps, and red–black trees. \nThe AVL tree was invented by Georgy Adelson-Velsky and Evgenii Landis in 1962 for the efficient organization of information. It was the first self-balancing binary search tree to be invented.\n\nOverview\nA binary search tree is a rooted binary tree in which nodes are arranged in strict total order in which the nodes with keys greater than any particular node A is stored on the right sub-trees to that node A and the nodes with keys equal to or less than A are stored on the left sub-trees to A, satisfying the binary search property.: 298 : 287 \nBinary search trees are also efficacious in sortings and search algorithms. However, the search complexity of a BST depends upon the order in which the nodes are inserted and deleted; since in worst case, successive operations in the binary search tree may lead to degeneracy and form a singly linked list (or \"unbalanced tree\") like structure, thus has the same worst-case complexity as a linked list.: 299-302  \nBinary search trees are also a fundamental data structure used in construction of abstract data structures such as sets, multisets, and associative arrays.\n\nOperations\nSearching\nSearching in a binary search tree for a specific key can be programmed recursively or iteratively.\nSearching begins by examining the root node. If the tree is nil, the key being searched for does not exist in the tree. Otherwise, if the key equals that of the root, the search is successful and the node is returned. If the key is less than that of the root, the search proceeds by examining the left subtree. Similarly, if the key is greater than that of the root, the search proceeds by examining the right subtree. This process is repeated until the key is found or the remaining subtree is \n  \n    \n      \n        \n          nil\n        \n      \n    \n    {\\displaystyle {\\text{nil}}}\n  \n. If the searched key is not found after a \n  \n    \n      \n        \n          nil\n        \n      \n    \n    {\\displaystyle {\\text{nil}}}\n  \n subtree is reached, then the key is not present in the tree.: 290–291\n\nRecursive search\nThe following pseudocode implements the BST search procedure through recursion.: 290 \n\nThe recursive procedure continues until a \n  \n    \n      \n        \n          nil\n        \n      \n    \n    {\\displaystyle {\\text{nil}}}\n  \n or the \n  \n    \n      \n        \n          key\n        \n      \n    \n    {\\displaystyle {\\text{key}}}\n  \n being searched for are encountered.\n\nIterative search\nThe recursive version of the search can be \"unrolled\" into a while loop. On most machines, the iterative version is found to be more efficient.: 291 \n\nSince the search may proceed till some leaf node, the running time complexity of BST search is \n  \n    \n      \n        O\n        (\n        h\n        )\n      \n    \n    {\\displaystyle O(h)}\n  \n where \n  \n    \n      \n        h\n      \n    \n    {\\displaystyle h}\n  \n is the height of the tree. However, the worst case for BST search is \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n  \n where \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n is the total number of nodes in the BST, because an unbalanced BST may degenerate to a linked list. However, if the BST is height-balanced the height is \n  \n    \n      \n        O\n        (\n        log\n        ⁡\n        n\n        )\n      \n    \n    {\\displaystyle O(\\log n)}\n  \n.: 290\n\nSuccessor and predecessor\nFor certain operations, given a node \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n, finding the successor or predecessor of \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n is crucial. Assuming all the keys of a BST are distinct, the successor of a node \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n in a BST is the node with the smallest key greater than \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n's key. On the other hand, the predecessor of a node \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n in a BST is the node with the largest key smaller than \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n's key. The following pseudocode finds the successor and predecessor of a node \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n in a BST.: 292–293 \n\nOperations such as finding a node in a BST whose key is the maximum or minimum are critical in certain operations, such as determining the successor and predecessor of nodes. Following is the pseudocode for the operations.: 291–292\n\nInsertion\nOperations such as insertion and deletion cause the BST representation to change dynamically. The data structure must be modified in such a way that the properties of BST continue to hold. New nodes are inserted as leaf nodes in the BST.: 294–295  Following is an iterative implementation of the insertion operation.: 294 \n\nThe procedure maintains a \"trailing pointer\" \n  \n    \n      \n        \n          y\n        \n      \n    \n    {\\displaystyle {\\text{y}}}\n  \n as a parent of \n  \n    \n      \n        \n          x\n        \n      \n    \n    {\\displaystyle {\\text{x}}}\n  \n. After initialization on line 2, the while loop along lines 4-11 causes the pointers to be updated. If \n  \n    \n      \n        \n          y\n        \n      \n    \n    {\\displaystyle {\\text{y}}}\n  \n is \n  \n    \n      \n        \n          nil\n        \n      \n    \n    {\\displaystyle {\\text{nil}}}\n  \n, the BST is empty, thus \n  \n    \n      \n        \n          z\n        \n      \n    \n    {\\displaystyle {\\text{z}}}\n  \n is inserted as the root node of the binary search tree \n  \n    \n      \n        \n          T\n        \n      \n    \n    {\\displaystyle {\\text{T}}}\n  \n, if it is not \n  \n    \n      \n        \n          nil\n        \n      \n    \n    {\\displaystyle {\\text{nil}}}\n  \n, insertion proceeds by comparing the keys to that of \n  \n    \n      \n        \n          y\n        \n      \n    \n    {\\displaystyle {\\text{y}}}\n  \n on the lines 15-19 and the node is inserted accordingly.: 295\n\nDeletion\nThe deletion of a node, say \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n, from the binary search tree \n  \n    \n      \n        \n          BST\n        \n      \n    \n    {\\displaystyle {\\text{BST}}}\n  \n has three cases:: 295-297 \n\nIf \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n is a leaf node, the parent node of \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n gets replaced by \n  \n    \n      \n        \n          NIL\n        \n      \n    \n    {\\displaystyle {\\text{NIL}}}\n  \n and consequently \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n is removed from the \n  \n    \n      \n        \n          BST\n        \n      \n    \n    {\\displaystyle {\\text{BST}}}\n  \n, as shown in (a).\nIf \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n has only one child, the child node of \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n gets elevated by modifying the parent node of \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n to point to the child node, consequently taking \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n's position in the tree, as shown in (b) and (c).\nIf \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n has both left and right children, the successor of \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n, say \n  \n    \n      \n        \n          Y\n        \n      \n    \n    {\\displaystyle {\\text{Y}}}\n  \n, displaces \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n by following the two cases:\nIf \n  \n    \n      \n        \n          Y\n        \n      \n    \n    {\\displaystyle {\\text{Y}}}\n  \n is \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n's right child, as shown in (d), \n  \n    \n      \n        \n          Y\n        \n      \n    \n    {\\displaystyle {\\text{Y}}}\n  \n displaces \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n and \n  \n    \n      \n        \n          Y\n        \n      \n    \n    {\\displaystyle {\\text{Y}}}\n  \n's right child remain unchanged.\nIf \n  \n    \n      \n        \n          Y\n        \n      \n    \n    {\\displaystyle {\\text{Y}}}\n  \n lies within \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n's right subtree but is not \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n's right child, as shown in (e), \n  \n    \n      \n        \n          Y\n        \n      \n    \n    {\\displaystyle {\\text{Y}}}\n  \n first gets replaced by its own right child, and then it displaces \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle {\\text{Z}}}\n  \n's position in the tree.\nThe following pseudocode implements the deletion operation in a binary search tree.: 296-298 \n\nThe \n  \n    \n      \n        \n          BST-Delete\n        \n      \n    \n    {\\displaystyle {\\text{BST-Delete}}}\n  \n procedure deals with the 3 special cases mentioned above. Lines 2-3 deal with case 1; lines 4-5 deal with case 2 and lines 6-16 for case 3. The helper function \n  \n    \n      \n        \n          Shift-Nodes\n        \n      \n    \n    {\\displaystyle {\\text{Shift-Nodes}}}\n  \n is used within the deletion algorithm for the purpose of replacing the node \n  \n    \n      \n        \n          u\n        \n      \n    \n    {\\displaystyle {\\text{u}}}\n  \n with \n  \n    \n      \n        \n          v\n        \n      \n    \n    {\\displaystyle {\\text{v}}}\n  \n in the binary search tree \n  \n    \n      \n        \n          BST\n        \n      \n    \n    {\\displaystyle {\\text{BST}}}\n  \n.: 298  This procedure handles the deletion (and substitution) of \n  \n    \n      \n        \n          u\n        \n      \n    \n    {\\displaystyle {\\text{u}}}\n  \n from \n  \n    \n      \n        \n          BST\n        \n      \n    \n    {\\displaystyle {\\text{BST}}}\n  \n.\n\nTraversal\nA BST can be traversed through three basic algorithms: inorder, preorder, and postorder tree walks.: 287 \n\nInorder tree walk: Nodes from the left subtree get visited first, followed by the root node and right subtree. Such a traversal visits all the nodes in the order of non-decreasing key sequence.\nPreorder tree walk: The root node gets visited first, followed by left and right subtrees.\nPostorder tree walk: Nodes from the left subtree get visited first, followed by the right subtree, and finally, the root.\nFollowing is a recursive implementation of the tree walks.: 287–289\n\nBalanced binary search trees\nWithout rebalancing, insertions or deletions in a binary search tree may lead to degeneration, resulting in a height \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n of the tree (where \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n is number of items in a tree), so that the lookup performance is deteriorated to that of a linear search. Keeping the search tree balanced and height bounded by \n  \n    \n      \n        O\n        (\n        log\n        ⁡\n        n\n        )\n      \n    \n    {\\displaystyle O(\\log n)}\n  \n is a key to the usefulness of the binary search tree. This can be achieved by \"self-balancing\" mechanisms during the updation operations to the tree designed to maintain the tree height to the binary logarithmic complexity.: 50\n\nHeight-balanced trees\nA tree is height-balanced if the heights of the left sub-tree and right sub-tree are guaranteed to be related by a constant factor. This property was introduced by the AVL tree and continued by the red–black tree.: 50–51  The heights of all the nodes on the path from the root to the modified leaf node have to be observed and possibly corrected on every insert and delete operation to the tree.: 52\n\nWeight-balanced trees\nIn a weight-balanced tree, the criterion of a balanced tree is the number of leaves of the subtrees. The weights of the left and right subtrees differ at most by \n  \n    \n      \n        1\n      \n    \n    {\\displaystyle 1}\n  \n.: 61  However, the difference is bound by a ratio \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n of the weights, since a strong balance condition of \n  \n    \n      \n        1\n      \n    \n    {\\displaystyle 1}\n  \n cannot be maintained with \n  \n    \n      \n        O\n        (\n        log\n        ⁡\n        n\n        )\n      \n    \n    {\\displaystyle O(\\log n)}\n  \n rebalancing work during insert and delete operations. The \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n-weight-balanced trees gives an entire family of balance conditions, where each left and right subtrees have each at least a fraction of \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n of the total weight of the subtree.: 62\n\nTypes\nThere are several self-balanced binary search trees, including T-tree, treap, red-black tree, B-tree, 2–3 tree, and Splay tree.\n\nExamples of applications\nSort\nBinary search trees are used in sorting algorithms such as tree sort, where all the elements are inserted at once and the tree is traversed at an in-order fashion. BSTs are also used in quicksort.\n\nPriority queue operations\nBinary search trees are used in implementing priority queues, using the node's key as priorities. Adding new elements to the queue follows the regular BST insertion operation but the removal operation depends on the type of priority queue:\n\nIf it is an ascending order priority queue, removal of an element with the lowest priority is done through leftward traversal of the BST.\nIf it is a descending order priority queue, removal of an element with the highest priority is done through rightward traversal of the BST.\n\nSee also\nReferences\nFurther reading\nThis article incorporates public domain material from Paul E. Black. \"Binary Search Tree\". Dictionary of Algorithms and Data Structures. NIST.\nCormen, Thomas H.; Leiserson, Charles E.; Rivest, Ronald L.; Stein, Clifford (2001). \"12: Binary search trees, 15.5: Optimal binary search trees\". Introduction to Algorithms (2nd ed.). MIT Press. pp. 253–272, 356–363. ISBN 0-262-03293-7.\nJarc, Duane J. (3 December 2005). \"Binary Tree Traversals\". Interactive Data Structure Visualizations. University of Maryland. Archived from the original on 27 February 2014. Retrieved 30 April 2006.\nKnuth, Donald (1997). \"6.2.2: Binary Tree Searching\". The Art of Computer Programming. Vol. 3: \"Sorting and Searching\" (3rd ed.). Addison-Wesley. pp. 426–458. ISBN 0-201-89685-0.\nLong, Sean. \"Binary Search Tree\" (PPT). Data Structures and Algorithms Visualization-A PowerPoint Slides Based Approach. SUNY Oneonta.\nParlante, Nick (2001). \"Binary Trees\". CS Education Library. Stanford University. Archived from the original on 2022-01-30.\n\nExternal links\n\n Ben Pfaff: An Introduction to Binary Search Trees and Balanced Trees. (PDF; 1675 kB) 2004.\nBinary Tree Visualizer (JavaScript animation of various BT-based data structures)\n",
  "categories": [
    "Category:Articles with example C++ code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with short description",
    "Category:Binary trees",
    "Category:CS1: long volume value",
    "Category:CS1 Russian-language sources (ru)",
    "Category:Commons category link is on Wikidata",
    "Category:Good articles",
    "Category:Search trees",
    "Category:Short description is different from Wikidata"
  ],
  "archived_date": "20241220_214755",
  "source_url": "https://en.wikipedia.org/wiki/Binary_search_tree"
}