{
  "title": "CherryPy",
  "summary": "CherryPy is an object-oriented web application framework using the Python programming language. It is designed for rapid development of web applications by wrapping the HTTP protocol but stays at a low level and does not offer much more than what is defined in RFC 7231.\nCherryPy can be a web server itself or one can launch it via any WSGI compatible environment. It does not deal with tasks such as templating for output rendering or backend access. The framework is extensible with filters, which ",
  "content": "---\ntitle: CherryPy\nurl: https://en.wikipedia.org/wiki/CherryPy\nlanguage: en\ncategories: [\"Category:All articles with self-published sources\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with self-published sources from April 2024\", \"Category:Articles with short description\", \"Category:Free computer libraries\", \"Category:Free software programmed in Python\", \"Category:Python (programming language) web frameworks\", \"Category:Short description matches Wikidata\", \"Category:Software using the BSD license\", \"Category:Webarchive template wayback links\"]\nreferences: 0\nlast_modified: 2024-12-19T13:50:06Z\n---\n\n# CherryPy\n\n## Summary\n\nCherryPy is an object-oriented web application framework using the Python programming language. It is designed for rapid development of web applications by wrapping the HTTP protocol but stays at a low level and does not offer much more than what is defined in RFC 7231.\nCherryPy can be a web server itself or one can launch it via any WSGI compatible environment. It does not deal with tasks such as templating for output rendering or backend access. The framework is extensible with filters, which \n\n## Full Content\n\nCherryPy is an object-oriented web application framework using the Python programming language. It is designed for rapid development of web applications by wrapping the HTTP protocol but stays at a low level and does not offer much more than what is defined in RFC 7231.\nCherryPy can be a web server itself or one can launch it via any WSGI compatible environment. It does not deal with tasks such as templating for output rendering or backend access. The framework is extensible with filters, which are called at defined points in the request/response processing.\n\nPythonic interface\nOne of the goals of the project founder, Remi Delon, was to make CherryPy as pythonic as possible. This allows the developer to use the framework as any regular Python module and to forget (from a technical point of view) that the application is for the web.\nFor instance, the common Hello World program with CherryPy 3 would look like:\n\nFeatures\nCherryPy implements:\n\nA HTTP/1.1-compliant, WSGI thread-pooled webserver. Typically, CherryPy itself takes only 1–2 ms per page.\nSupport for any other WSGI-enabled web server or adapter, including Apache, IIS, lighttpd, mod_python, FastCGI, SCGI, and mod_wsgi.\nA native mod_python adapter.\nMultiple HTTP servers (e.g. ability to listen on multiple ports).\nA plugin system CherryPy plugins hook into events within the server process — into server startup, server shutdown, server exiting, etc. — to run code that needs to be run when the server starts up or shuts down.\nBuilt-in tools for caching, encoding, sessions, authorization, static content, and others. CherryPy tools hook into events within the request process. Whenever the CherryPy server receives a request, there is a specific set of steps it goes through to handle that request. Page handlers are only one step in the process.  Tools also provide a syntax and configuration API for turning them on and off for a specific set of handlers.\nA configuration system for developers and deployers . CherryPy deployments are configurable on site, on application and on controller level, through Python dictionaries, configuration files, and open file objects.\nA complete test suite for core functionality and associated framework which can be used to test CherryPy applications.\nBuilt-in profiling since v2.1, coverage and testing support.\nCherryPy doesn't force you to use a specific object-relational mapper (ORM), template language or JavaScript library.\n\nCan be used with CherryPy\nRoutes — a Python re-implementation of the Ruby on Rails's routes system for mapping URLs to controllers/actions and generating URLs.\n\nObject-relational mappers\nSQLAlchemy — a database backend and ORM for Python applications. TurboGears 2.x uses CherryPy as server and SQLAlchemy as its default ORM.\nSQLObject — a popular ORM for providing an object interface to a database. Supports a number of common database backends: included in the distribution are MySQL, PostgreSQL, SQLite, Sybase SQL Server, MaxDB, Microsoft SQL Server and Firebird. TurboGears 1.x uses CherryPy as server and SQLObject as ORM.\nStorm — the ORM from Canonical Ltd. (makers of Ubuntu)\nDejavu — a public domain software, thread-safe ORM for Python applications\nMongoEngine — An ODM for connecting to MongoDB.\n\nTemplating languages\nMako — a template library written in Python, usable with a simple CherryPy tool.\nCheetah — an open source template engine and code generation tool, written in Python.\nCherryTemplate — a templating language for CherryPy.\nGenshi — a powerful XML templating language.\nJinja — a general purpose templating language. CherryPy has a tool for using Jinja templates.\nKid — a simple template language for XML based vocabularies written in Python. TurboGears 1.x uses CherryPy as server and Kid as frontend.\nCherryPy wiki helps choosing a templating language.\n\nProducts using CherryPy\nTurboGears — CherryPy 2.x is a main component of TurboGears 1.x.\nSplunk Enterprise - CherryPy 3.1.2\n\nSee also\nComparison of web frameworks\n\nReferences\nExternal links\nOfficial website\n",
  "categories": [
    "Category:All articles with self-published sources",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with self-published sources from April 2024",
    "Category:Articles with short description",
    "Category:Free computer libraries",
    "Category:Free software programmed in Python",
    "Category:Python (programming language) web frameworks",
    "Category:Short description matches Wikidata",
    "Category:Software using the BSD license",
    "Category:Webarchive template wayback links"
  ],
  "archived_date": "20241221_183003",
  "source_url": "https://en.wikipedia.org/wiki/CherryPy"
}