{
  "title": "Comparison of programming languages (string functions)",
  "summary": "String functions are used in computer programming languages to manipulate a string or query information about a string (some do both).\nMost programming languages that have a string datatype will have some string functions although there may be other low-level ways within each language to handle strings directly. In object-oriented languages, string functions are often implemented as properties and methods of string objects. In functional and list-based languages a string is represented as a list",
  "content": "---\ntitle: Comparison of programming languages (string functions)\nurl: https://en.wikipedia.org/wiki/Comparison_of_programming_languages_(string_functions)\nlanguage: en\ncategories: [\"Category:All articles needing additional references\", \"Category:Articles needing additional references from July 2013\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with short description\", \"Category:Programming language comparisons\", \"Category:Short description is different from Wikidata\", \"Category:String (computer science)\", \"Category:Webarchive template wayback links\"]\nreferences: 0\nlast_modified: 2024-12-19T13:53:16Z\n---\n\n# Comparison of programming languages (string functions)\n\n## Summary\n\nString functions are used in computer programming languages to manipulate a string or query information about a string (some do both).\nMost programming languages that have a string datatype will have some string functions although there may be other low-level ways within each language to handle strings directly. In object-oriented languages, string functions are often implemented as properties and methods of string objects. In functional and list-based languages a string is represented as a list\n\n## Full Content\n\nString functions are used in computer programming languages to manipulate a string or query information about a string (some do both).\nMost programming languages that have a string datatype will have some string functions although there may be other low-level ways within each language to handle strings directly. In object-oriented languages, string functions are often implemented as properties and methods of string objects. In functional and list-based languages a string is represented as a list (of character codes), therefore all list-manipulation procedures could be considered string functions. However such languages may implement a subset of explicit string-specific functions as well.\nFor function that manipulate strings, modern object-oriented languages, like C# and Java have immutable strings and return a copy (in newly allocated dynamic memory), while others, like C manipulate the original string unless the programmer copies data to a new string. See for example Concatenation below.\nThe most basic example of a string function is the length(string) function. This function returns the length of a string literal.\n\ne.g. length(\"hello world\") would return 11.\nOther languages may have string functions with similar or exactly the same syntax or parameters or outcomes. For example, in many languages the length function is usually represented as len(string).  The below list of common functions aims to help limit this confusion.\n\nCommon string functions (multi language reference)\nString functions common to many languages are listed below, including the different names used.  The below list of common functions aims to help programmers find the equivalent function in a language. Note, string concatenation and regular expressions are handled in separate pages. Statements in guillemets (« … ») are optional.\n\nCharAt\n# Example in ALGOL 68 #\n\"Hello, World\"[2];             // 'e'\n\nCompare (integer result)\nCompare (relational operator-based, Boolean result)\nConcatenation\nContains\n¢ Example in ALGOL 68 ¢\nstring in string(\"e\", loc int, \"Hello mate\");      ¢ returns true ¢\nstring in string(\"z\", loc int, \"word\");            ¢ returns false ¢\n\nEquality\nTests if two strings are equal. See also #Compare and #Compare. Note that doing equality checks via a generic Compare with integer result is not only confusing for the programmer but is often a significantly more expensive operation; this is especially true when using \"C-strings\".\n\nFind\nExamples\n\nCommon Lisp\n\nC#\n\nRaku\n\nScheme\n\nVisual Basic\n\nSmalltalk\n\nFind character\n^a  Given a set of characters, SCAN returns the position of the first character found, while VERIFY returns the position of the first character that does not belong to the set.\n\nFormat\nInequality\nTests if two strings are not equal. See also #Equality.\n\nindex\nsee #Find\n\nindexof\nsee #Find\n\ninstr\nsee #Find\n\ninstrrev\nsee #rfind\n\njoin\nlastindexof\nsee #rfind\n\nleft\nlen\nsee #length\n\nlength\nlocate\nsee #Find\n\nLowercase\nmid\nsee #substring\n\npartition\nreplace\nreverse\nrfind\nright\nrpartition\nslice\nsee #substring\n\nsplit\nsprintf\nsee #Format\n\nstrip\nsee #trim\n\nstrcmp\nsee #Compare (integer result)\n\nsubstring\nUppercase\ntrim\ntrim or strip is used to remove whitespace from the beginning, end, or both beginning and end, of a string.\n\nOther languages\nIn languages without a built-in trim function, it is usually simple to create a custom function which accomplishes the same task.\n\nAPL\nAPL can use regular expressions directly:\n\nAlternatively, a functional approach combining Boolean masks that filter away leading and trailing spaces:\n\nOr reverse and remove leading spaces, twice:\n\nAWK\nIn AWK, one can use regular expressions to trim:\n\nor:\n\nC/C++\nThere is no standard trim function in C or C++. Most of the available string libraries for C contain code which implements trimming, or functions that significantly ease an efficient implementation. The function has also often been called EatWhitespace in some non-standard C libraries.\nIn C, programmers often combine a ltrim and rtrim to implement trim:\n\nThe open source C++ library Boost has several trim variants, including a standard one:\n\nWith boost's function named simply trim the input sequence is modified in-place, and returns no result.\nAnother open source C++ library Qt, has several trim variants, including a standard one:\n\nThe Linux kernel also includes a strip function, strstrip(), since 2.6.18-rc1, which trims the string \"in place\". Since 2.6.33-rc1, the kernel uses strim() instead of strstrip() to avoid false warnings.\n\nHaskell\nA trim algorithm in Haskell:\n\nmay be interpreted as follows: f drops the preceding whitespace, and reverses the string. f is then again applied to its own output. Note that the type signature (the second line) is optional.\n\nJ\nThe trim algorithm in J is a functional description:\n\nThat is: filter (#~) for non-space characters (' '&~:) between leading (+./\\) and (*.) trailing (+./\\.) spaces.\n\nJavaScript\nThere is a built-in trim function in JavaScript 1.8.1 (Firefox 3.5 and later), and the ECMAScript 5 standard. In earlier versions it can be added to the String object's prototype as follows:\n\nPerl\nPerl 5 has no built-in trim function. However, the functionality is commonly achieved using regular expressions.\nExample:\n\n \nor:\n\n \nThese examples modify the value of the original variable $string.\nAlso available for Perl is StripLTSpace in String::Strip from CPAN.\nThere are, however, two functions that are commonly used to strip whitespace from the end of strings, chomp and chop:\n\nchop removes the last character from a string and returns it.\nchomp removes the trailing newline character(s) from a string if present. (What constitutes a newline is $INPUT_RECORD_SEPARATOR dependent).\nIn Raku, the upcoming sister language of Perl, strings have a trim method.\nExample:\n\nTcl\nThe Tcl string command has three relevant subcommands:  trim, trimright and trimleft.  For each of those commands, an additional argument may be specified:  a string that represents a set of characters to remove—the default is whitespace (space, tab, newline, carriage return).\nExample of trimming vowels:\n\nXSLT\nXSLT includes the function normalize-space(string) which strips leading and trailing whitespace, in addition to replacing any whitespace sequence (including line breaks) with a single space.\nExample:\n\nXSLT 2.0 includes regular expressions, providing another mechanism to perform string trimming.\nAnother XSLT technique for trimming is to utilize the XPath 2.0 substring() function.\n\n\n== References ==\n",
  "categories": [
    "Category:All articles needing additional references",
    "Category:Articles needing additional references from July 2013",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with short description",
    "Category:Programming language comparisons",
    "Category:Short description is different from Wikidata",
    "Category:String (computer science)",
    "Category:Webarchive template wayback links"
  ],
  "archived_date": "20241221_183016",
  "source_url": "https://en.wikipedia.org/wiki/Comparison_of_programming_languages_(string_functions)"
}