{
  "title": "Construct (Python library)",
  "summary": "Construct is a Python library for the construction and deconstruction of data structures in a declarative fashion. In this context, construction, or building, refers to the process of converting (serializing) a programmatic object into a binary representation. \nDeconstruction, or parsing, refers to the opposite process of converting (deserializing) binary data into a programmatic object. Being declarative means that user code defines the data structure, instead of the convention of writing proce",
  "content": "---\ntitle: Construct (Python library)\nurl: https://en.wikipedia.org/wiki/Construct_(Python_library)\nlanguage: en\ncategories: [\"Category:All articles with unsourced statements\", \"Category:Articles with unsourced statements from August 2023\", \"Category:Parser generators\", \"Category:Python (programming language) libraries\"]\nreferences: 0\nlast_modified: 2024-11-22T02:59:11Z\n---\n\n# Construct (Python library)\n\n## Summary\n\nConstruct is a Python library for the construction and deconstruction of data structures in a declarative fashion. In this context, construction, or building, refers to the process of converting (serializing) a programmatic object into a binary representation. \nDeconstruction, or parsing, refers to the opposite process of converting (deserializing) binary data into a programmatic object. Being declarative means that user code defines the data structure, instead of the convention of writing proce\n\n## Full Content\n\nConstruct is a Python library for the construction and deconstruction of data structures in a declarative fashion. In this context, construction, or building, refers to the process of converting (serializing) a programmatic object into a binary representation. \nDeconstruction, or parsing, refers to the opposite process of converting (deserializing) binary data into a programmatic object. Being declarative means that user code defines the data structure, instead of the convention of writing procedural code to accomplish the goal. Construct can work seamlessly with bit- and byte-level data granularity and various byte-ordering.\n\nBenefits\nUsing declarative code has many benefits. For example, the same code that can parse can also build (symmetrical), debugging and testing are much simpler (provable to some extent), creating new constructs is easy (wrapping components), and many more. If one is familiar with the C (programming language), one can think of constructs as casting from char * to struct foo * and vice versa, rather than writing code that unpacks the data.\n\nExample\nThe following example show how a TCP/IP protocol stack might be defined using Construct. Some code is omitted for brevity and simplicity. Also note that the following code is just Python code that creates objects.\nFirst, the Ethernet header (layer 2):\n\nNext, the IP header (layer 3):\n\nAnd finally, the TCP header (layer 4):\n\nNow define the hierarchy of the protocol stack. The following code \"binds\" each pair of adjacent protocols into a separate unit. Each such unit will \"select\" the proper next layer based on its contained protocol.\n\nAt this point, the code can parse captured TCP/IP frames into \"packet\" objects and build these packet objects back into binary representation.\n\nPorts and spin-offs\nPerl\nData::ParseBinary is a CPAN module that originated as a port of Construct to the Perl programming language. (see its main POD document for its inspiration). Since the initial version, some parts of the original API have been deprecated.\n\nJava\nA port to Java is available on GitHub. Examples in Java, the Ethernet header (layer 2):\n\nSee also\nNatural Language Toolkit\n\nReferences\nExternal links\nConstruct's Documentation\nConstruct's Repository\nPython Training\n",
  "categories": [
    "Category:All articles with unsourced statements",
    "Category:Articles with unsourced statements from August 2023",
    "Category:Parser generators",
    "Category:Python (programming language) libraries"
  ],
  "archived_date": "20241220_214821",
  "source_url": "https://en.wikipedia.org/wiki/Construct_(Python_library)"
}