{
  "title": "Corecursion",
  "summary": "In computer science, corecursion is a type of operation that is dual to recursion. Whereas recursion works analytically, starting on data further from a base case and breaking it down into smaller data and repeating until one reaches a base case, corecursion works synthetically, starting from a base case and building it up, iteratively producing data further removed from a base case. Put simply, corecursive algorithms use the data that they themselves produce, bit by bit, as they become availabl",
  "content": "---\ntitle: Corecursion\nurl: https://en.wikipedia.org/wiki/Corecursion\nlanguage: en\ncategories: [\"Category:All articles that are too technical\", \"Category:All articles with style issues\", \"Category:All pages needing cleanup\", \"Category:Articles needing cleanup from July 2012\", \"Category:Articles with example Haskell code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with short description\", \"Category:Category theory\", \"Category:Cleanup tagged articles with a reason field from July 2012\", \"Category:Functional programming\", \"Category:Recursion\", \"Category:Self-reference\", \"Category:Short description matches Wikidata\", \"Category:Theoretical computer science\", \"Category:Wikipedia articles that are too technical from November 2010\", \"Category:Wikipedia articles with style issues from February 2020\", \"Category:Wikipedia pages needing cleanup from July 2012\"]\nreferences: 0\nlast_modified: 2024-12-19T13:47:10Z\n---\n\n# Corecursion\n\n## Summary\n\nIn computer science, corecursion is a type of operation that is dual to recursion. Whereas recursion works analytically, starting on data further from a base case and breaking it down into smaller data and repeating until one reaches a base case, corecursion works synthetically, starting from a base case and building it up, iteratively producing data further removed from a base case. Put simply, corecursive algorithms use the data that they themselves produce, bit by bit, as they become availabl\n\n## Full Content\n\nIn computer science, corecursion is a type of operation that is dual to recursion. Whereas recursion works analytically, starting on data further from a base case and breaking it down into smaller data and repeating until one reaches a base case, corecursion works synthetically, starting from a base case and building it up, iteratively producing data further removed from a base case. Put simply, corecursive algorithms use the data that they themselves produce, bit by bit, as they become available, and needed, to produce further bits of data. A similar but distinct concept is generative recursion, which may lack a definite \"direction\" inherent in corecursion and recursion.\nWhere recursion allows programs to operate on arbitrarily complex data, so long as they can be reduced to simple data (base cases), corecursion allows programs to produce arbitrarily complex and potentially infinite data structures, such as streams, so long as it can be produced from simple data (base cases) in a sequence of finite steps. Where recursion may not terminate, never reaching a base state, corecursion starts from a base state, and thus produces subsequent steps deterministically, though it may proceed indefinitely (and thus not terminate under strict evaluation), or it may consume more than it produces and thus become non-productive. Many functions that are traditionally analyzed as recursive can alternatively, and arguably more naturally, be interpreted as corecursive functions that are terminated at a given stage, for example recurrence relations such as the factorial.\nCorecursion can produce both finite and infinite data structures as results, and may employ self-referential data structures. Corecursion is often used in conjunction with lazy evaluation, to produce only a finite subset of a potentially infinite structure (rather than trying to produce an entire infinite structure at once). Corecursion is a particularly important concept in functional programming, where corecursion and codata allow total languages to work with infinite data structures.\n\nExamples\nCorecursion can be understood by contrast with recursion, which is more familiar. While corecursion is primarily of interest in functional programming, it can be illustrated using imperative programming, which is done below using the generator facility in Python. In these examples local variables are used, and assigned values imperatively (destructively), though these are not necessary in corecursion in pure functional programming. In pure functional programming, rather than assigning to local variables, these computed values form an invariable sequence, and prior values are accessed by self-reference (later values in the sequence reference earlier values in the sequence to be computed). The assignments simply express this in the imperative paradigm and explicitly specify where the computations happen, which serves to clarify the exposition.\n\nFactorial\nA classic example of recursion is computing the factorial, which is defined recursively by 0! := 1 and n! := n × (n - 1)!.\nTo recursively compute its result on a given input, a recursive function calls (a copy of) itself with a different (\"smaller\" in some way) input and uses the result of this call to construct its result. The recursive call does the same, unless the base case has been reached. Thus a call stack develops in the process. For example, to compute fac(3), this recursively calls in turn fac(2), fac(1), fac(0) (\"winding up\" the stack), at which point recursion terminates with fac(0) = 1, and then the stack unwinds in reverse order and the results are calculated on the way back along the call stack to the initial call frame fac(3) that uses the result of fac(2) = 2 to calculate the final result as 3 × 2 = 3 × fac(2) =: fac(3) and finally return fac(3) = 6. In this example a function returns a single value.\nThis stack unwinding can be explicated, defining the factorial corecursively, as an iterator, where one starts with the case of \n  \n    \n      \n        1\n        =:\n        0\n        !\n      \n    \n    {\\displaystyle 1=:0!}\n  \n, then from this starting value constructs factorial values for increasing numbers 1, 2, 3... as in the above recursive definition with \"time arrow\" reversed, as it were, by reading it backwards as \n  \n    \n      \n        n\n        !\n        ×\n        (\n        n\n        +\n        1\n        )\n        =:\n        (\n        n\n        +\n        1\n        )\n        !\n      \n    \n    {\\displaystyle n!\\times (n+1)=:(n+1)!}\n  \n. The corecursive algorithm thus defined produces a stream of all factorials. This may be concretely implemented as a generator. Symbolically, noting that computing next factorial value requires keeping track of both n and f (a previous factorial value), this can be represented as:\n\n  \n    \n      \n        n\n        ,\n        f\n        =\n        (\n        0\n        ,\n        1\n        )\n        :\n        (\n        n\n        +\n        1\n        ,\n        f\n        ×\n        (\n        n\n        +\n        1\n        )\n        )\n      \n    \n    {\\displaystyle n,f=(0,1):(n+1,f\\times (n+1))}\n  \n\nor in Haskell, \n\nmeaning, \"starting from \n  \n    \n      \n        n\n        ,\n        f\n        =\n        0\n        ,\n        1\n      \n    \n    {\\displaystyle n,f=0,1}\n  \n, on each step the next values are calculated as \n  \n    \n      \n        n\n        +\n        1\n        ,\n        f\n        ×\n        (\n        n\n        +\n        1\n        )\n      \n    \n    {\\displaystyle n+1,f\\times (n+1)}\n  \n\". This is mathematically equivalent and almost identical to the recursive definition, but the \n  \n    \n      \n        +\n        1\n      \n    \n    {\\displaystyle +1}\n  \n emphasizes that the factorial values are being built up, going forwards from the starting case, rather than being computed after first going backwards, down to the base case, with a \n  \n    \n      \n        −\n        1\n      \n    \n    {\\displaystyle -1}\n  \n decrement. The direct output of the corecursive function does not simply contain the factorial \n  \n    \n      \n        n\n        !\n      \n    \n    {\\displaystyle n!}\n  \n values, but also includes for each value the auxiliary data of its index n in the sequence, so that any one specific result can be selected among them all, as and when needed.\nThere is a connection with denotational semantics, where the denotations of recursive programs is built up corecursively in this way.\nIn Python, a recursive factorial function can be defined as:\n\nThis could then be called for example as factorial(5) to compute 5!.\nA corresponding corecursive generator can be defined as:\n\nThis generates an infinite stream of factorials in order; a finite portion of it can be produced by:\n\nThis could then be called to produce the factorials up to 5! via:\n\nIf we're only interested in a certain factorial, just the last value can be taken, or we can fuse the production and the access into one function,\n\nAs can be readily seen here, this is practically equivalent (just by substituting return for the only yield there) to the accumulator argument technique for tail recursion, unwound into an explicit loop. Thus it can be said that the concept of corecursion is an explication of the embodiment of iterative computation processes by recursive definitions, where applicable.\n\nFibonacci sequence\nIn the same way, the Fibonacci sequence can be represented as:\n\n  \n    \n      \n        a\n        ,\n        b\n        =\n        (\n        0\n        ,\n        1\n        )\n        :\n        (\n        b\n        ,\n        a\n        +\n        b\n        )\n      \n    \n    {\\displaystyle a,b=(0,1):(b,a+b)}\n  \n\nBecause the Fibonacci sequence is a recurrence relation of order 2, the corecursive relation must track two successive terms, with the \n  \n    \n      \n        (\n        b\n        ,\n        −\n        )\n      \n    \n    {\\displaystyle (b,-)}\n  \n corresponding to shift forward by one step, and the \n  \n    \n      \n        (\n        −\n        ,\n        a\n        +\n        b\n        )\n      \n    \n    {\\displaystyle (-,a+b)}\n  \n corresponding to computing the next term. This can then be implemented as follows (using parallel assignment):\n\nIn Haskell,\n\nTree traversal\nTree traversal via a depth-first approach is a classic example of recursion. Dually, breadth-first traversal can very naturally be implemented via corecursion.\nIteratively, one may traverse a tree by placing its root node in a data structure, then iterating with that data structure while it is non-empty, on each step removing the first node from it and placing the removed node's child nodes back into that data structure. If the data structure is a stack (LIFO), this yields depth-first traversal, and if the data structure is a queue (FIFO), this yields breadth-first traversal:\n\n  \n    \n      \n        \n          \n            trav\n          \n          \n            nn\n          \n        \n        (\n        t\n        )\n        =\n        \n          \n            aux\n          \n          \n            nn\n          \n        \n        (\n        [\n        t\n        ]\n        )\n      \n    \n    {\\displaystyle {\\text{trav}}_{\\text{nn}}(t)={\\text{aux}}_{\\text{nn}}([t])}\n  \n\n  \n    \n      \n        \n          \n            aux\n          \n          \n            df\n          \n        \n        (\n        [\n        t\n        ,\n         \n        .\n        .\n        .\n        t\n        s\n        ]\n        )\n        =\n        \n          val\n        \n        (\n        t\n        )\n        ;\n         \n        \n          \n            aux\n          \n          \n            df\n          \n        \n        (\n        [\n         \n        .\n        .\n        .\n        \n          children\n        \n        (\n        t\n        )\n        ,\n         \n        .\n        .\n        .\n        t\n        s\n         \n        ]\n        )\n      \n    \n    {\\displaystyle {\\text{aux}}_{\\text{df}}([t,\\ ...ts])={\\text{val}}(t);\\ {\\text{aux}}_{\\text{df}}([\\ ...{\\text{children}}(t),\\ ...ts\\ ])}\n  \n\n  \n    \n      \n        \n          \n            aux\n          \n          \n            bf\n          \n        \n        (\n        [\n        t\n        ,\n         \n        .\n        .\n        .\n        t\n        s\n        ]\n        )\n        =\n        \n          val\n        \n        (\n        t\n        )\n        ;\n         \n        \n          \n            aux\n          \n          \n            bf\n          \n        \n        (\n        [\n         \n        .\n        .\n        .\n        t\n        s\n        ,\n         \n        .\n        .\n        .\n        \n          children\n        \n        (\n        t\n        )\n         \n        ]\n        )\n      \n    \n    {\\displaystyle {\\text{aux}}_{\\text{bf}}([t,\\ ...ts])={\\text{val}}(t);\\ {\\text{aux}}_{\\text{bf}}([\\ ...ts,\\ ...{\\text{children}}(t)\\ ])}\n  \n\nUsing recursion, a depth-first traversal of a tree is implemented simply as recursively traversing each of the root node's child nodes in turn. Thus the second child subtree is not processed until the first child subtree is finished. The root node's value is handled separately, whether before the first child is traversed (resulting in pre-order traversal), after the first is finished and before the second (in-order), or after the second child node is finished (post-order) — assuming the tree is binary, for simplicity of exposition. The call stack (of the recursive traversal function invocations) corresponds to the stack that would be iterated over with the explicit LIFO structure manipulation mentioned above. Symbolically,\n\n  \n    \n      \n        \n          \n            df\n          \n          \n            in\n          \n        \n        (\n        t\n        )\n        =\n        [\n         \n        .\n        .\n        .\n        \n          \n            df\n          \n          \n            in\n          \n        \n        (\n        \n          left\n        \n        (\n        t\n        )\n        )\n        ,\n         \n        \n          val\n        \n        (\n        t\n        )\n        ,\n         \n        .\n        .\n        .\n        \n          \n            df\n          \n          \n            in\n          \n        \n        (\n        \n          right\n        \n        (\n        t\n        )\n        )\n         \n        ]\n      \n    \n    {\\displaystyle {\\text{df}}_{\\text{in}}(t)=[\\ ...{\\text{df}}_{\\text{in}}({\\text{left}}(t)),\\ {\\text{val}}(t),\\ ...{\\text{df}}_{\\text{in}}({\\text{right}}(t))\\ ]}\n  \n\n  \n    \n      \n        \n          \n            df\n          \n          \n            pre\n          \n        \n        (\n        t\n        )\n        =\n        [\n         \n        \n          val\n        \n        (\n        t\n        )\n        ,\n         \n        .\n        .\n        .\n        \n          \n            df\n          \n          \n            pre\n          \n        \n        (\n        \n          left\n        \n        (\n        t\n        )\n        )\n        ,\n         \n        .\n        .\n        .\n        \n          \n            df\n          \n          \n            pre\n          \n        \n        (\n        \n          right\n        \n        (\n        t\n        )\n        )\n         \n        ]\n      \n    \n    {\\displaystyle {\\text{df}}_{\\text{pre}}(t)=[\\ {\\text{val}}(t),\\ ...{\\text{df}}_{\\text{pre}}({\\text{left}}(t)),\\ ...{\\text{df}}_{\\text{pre}}({\\text{right}}(t))\\ ]}\n  \n\n  \n    \n      \n        \n          \n            df\n          \n          \n            post\n          \n        \n        (\n        t\n        )\n        =\n        [\n         \n        .\n        .\n        .\n        \n          \n            df\n          \n          \n            post\n          \n        \n        (\n        \n          left\n        \n        (\n        t\n        )\n        )\n        ,\n         \n        .\n        .\n        .\n        \n          \n            df\n          \n          \n            post\n          \n        \n        (\n        \n          right\n        \n        (\n        t\n        )\n        )\n        ,\n         \n        \n          val\n        \n        (\n        t\n        )\n         \n        ]\n      \n    \n    {\\displaystyle {\\text{df}}_{\\text{post}}(t)=[\\ ...{\\text{df}}_{\\text{post}}({\\text{left}}(t)),\\ ...{\\text{df}}_{\\text{post}}({\\text{right}}(t)),\\ {\\text{val}}(t)\\ ]}\n  \n\n\"Recursion\" has two meanings here. First, the recursive invocations of the tree traversal functions \n  \n    \n      \n        \n          \n            df\n          \n          \n            x\n            y\n            z\n          \n        \n      \n    \n    {\\displaystyle {\\text{df}}_{xyz}}\n  \n. More pertinently, we need to contend with how the resulting list of values is built here. Recursive, bottom-up output creation will result in the right-to-left tree traversal. To have it actually performed in the intended left-to-right order the sequencing would need to be enforced by some extraneous means, or it would be automatically achieved if the output were to be built in the top-down fashion, i.e. corecursively.\nA breadth-first traversal creating its output in the top-down order, corecursively, can be also implemented by starting at the root node, outputting its value, then breadth-first traversing the subtrees – i.e., passing on the whole list of subtrees to the next step (not a single subtree, as in the recursive approach) – at the next step outputting the values of all of their root nodes, then passing on their child subtrees, etc. In this case the generator function, indeed the output sequence itself, acts as the queue. As in the factorial example above, where the auxiliary information of the index (which step one was at, n) was pushed forward, in addition to the actual output of n!, in this case the auxiliary information of the remaining subtrees is pushed forward, in addition to the actual output. Symbolically,\n\n  \n    \n      \n        v\n        ,\n        t\n        s\n        =\n        (\n        [\n        ]\n        ,\n        [\n        \n          FullTree\n        \n        ]\n        )\n        :\n        (\n        \n          RootValues\n        \n        (\n        t\n        s\n        )\n        ,\n        \n          ChildTrees\n        \n        (\n        t\n        s\n        )\n        )\n      \n    \n    {\\displaystyle v,ts=([],[{\\text{FullTree}}]):({\\text{RootValues}}(ts),{\\text{ChildTrees}}(ts))}\n  \n\nmeaning that at each step, one outputs the list of values in this level's nodes, then proceeds to the next level's nodes. Generating just the node values from this sequence simply requires discarding the auxiliary child tree data, then flattening the list of lists (values are initially grouped by level (depth); flattening (ungrouping) yields a flat linear list). This is extensionally equivalent to the \n  \n    \n      \n        \n          \n            aux\n          \n          \n            bf\n          \n        \n      \n    \n    {\\displaystyle {\\text{aux}}_{\\text{bf}}}\n  \n specification above. In Haskell, \n\nNotably, given an infinite tree, the corecursive breadth-first traversal will traverse all nodes, just as for a finite tree, while the recursive depth-first traversal will go down one branch and not traverse all nodes, and indeed if traversing post-order, as in this example (or in-order), it will visit no nodes at all, because it never reaches a leaf. This shows the usefulness of corecursion rather than recursion for dealing with infinite data structures. One caveat still remains for trees with the infinite branching factor, which need a more attentive interlacing to explore the space better. See dovetailing.\nIn Python, this can be implemented as follows.\nThe usual post-order depth-first traversal can be defined as:\n\nThis can then be called by df(t) to print the values of the nodes of the tree in post-order depth-first order.\nThe breadth-first corecursive generator can be defined as:\n\nThis can then be called to print the values of the nodes of the tree in breadth-first order:\n\nDefinition\nInitial data types can be defined as being the least fixpoint (up to isomorphism) of some type equation; the isomorphism is then given by an initial algebra. Dually, final (or terminal) data types can be defined as being the greatest fixpoint of a type equation; the isomorphism is then given by a final coalgebra.\nIf the domain of discourse is the category of sets and total functions, then final data types may contain infinite, non-wellfounded values, whereas initial types do not. On the other hand, if the domain of discourse is the category of complete partial orders and continuous functions, which corresponds roughly to the Haskell programming language, then final types coincide with initial types, and the corresponding final coalgebra and initial algebra form an isomorphism.\nCorecursion is then a technique for recursively defining functions whose range (codomain) is a final data type, dual to the way that ordinary recursion recursively defines functions whose domain is an initial data type.\nThe discussion below provides several examples in Haskell that distinguish corecursion. Roughly speaking, if one were to port these definitions to the category of sets, they would still be corecursive. This informal usage is consistent with existing textbooks about Haskell. The examples used in this article predate the attempts to define corecursion and explain what it is.\n\nDiscussion\nThe rule for primitive corecursion on codata is the dual to that for primitive recursion on data. Instead of descending on the argument by pattern-matching on its constructors (that were called up before, somewhere, so we receive a ready-made datum and get at its constituent sub-parts, i.e. \"fields\"), we ascend on the result by filling-in its \"destructors\" (or \"observers\", that will be called afterwards, somewhere - so we're actually calling a constructor, creating another bit of the result to be observed later on). Thus corecursion creates (potentially infinite) codata, whereas ordinary recursion analyses (necessarily finite) data.  Ordinary recursion might not be applicable to the codata because it might not terminate.  Conversely, corecursion is not strictly necessary if the result type is data, because data must be finite.\nIn \"Programming with streams in Coq: a case study: the Sieve of Eratosthenes\" we find\n\nwhere primes \"are obtained by applying the primes operation to the stream (Enu 2)\". Following the above notation, the sequence of primes (with a throwaway 0 prefixed to it) and numbers streams being progressively sieved, can be represented as \n\n  \n    \n      \n        p\n        ,\n        s\n        =\n        (\n        0\n        ,\n        [\n        2..\n        ]\n        )\n        :\n        (\n        h\n        d\n        (\n        s\n        )\n        ,\n        s\n        i\n        e\n        v\n        e\n        (\n        h\n        d\n        (\n        s\n        )\n        ,\n        t\n        l\n        (\n        s\n        )\n        )\n        )\n      \n    \n    {\\displaystyle p,s=(0,[2..]):(hd(s),sieve(hd(s),tl(s)))}\n  \n\nor in Haskell, \n\nThe authors discuss how the definition of sieve is not guaranteed always to be productive, and could become stuck e.g. if called with [5,10..] as the initial stream.\nHere is another example in Haskell. The following definition produces the list of Fibonacci numbers in linear time:\n\nThis infinite list depends on lazy evaluation;  elements are computed on an as-needed basis, and only finite prefixes are ever explicitly represented in memory. This feature allows algorithms on parts of codata to terminate; such techniques are an important part of Haskell programming.\nThis can be done in Python as well:\n\nThe definition of zipWith can be inlined, leading to this:\n\nThis example employs a self-referential data structure. Ordinary recursion makes use of self-referential functions,   but does not accommodate self-referential data. However,  this is not essential to the Fibonacci example. It can be rewritten as follows:\n\nThis employs only self-referential function to construct the result. If it were used with strict list constructor it would be an example of runaway recursion, but with non-strict list constructor this guarded recursion gradually produces an indefinitely defined list.\nCorecursion need not produce an infinite object; a corecursive queue is a particularly good example of this phenomenon. The following definition produces a breadth-first traversal of a binary tree in the top-down manner, in linear time (already incorporating the flattening mentioned above):\n\nThis definition takes a tree and produces a list of its sub-trees (nodes and leaves). This list serves dual purpose as both the input queue and the result (gen len p produces its output len notches ahead of its input back-pointer, p, along the list).  It is finite if and only if the initial tree is finite.  The length of the queue must be explicitly tracked in order to ensure termination;  this can safely be elided if this definition is applied only to infinite trees.   \nThis Haskell code uses self-referential data structure, but does not essentially depend on lazy evaluation. It can be straightforwardly translated into e.g. Prolog which is not a lazy language. What is essential is the ability to build a list (used as the queue) in the top-down manner. For that, Prolog has tail recursion modulo cons (i.e. open ended lists). Which is also emulatable in Scheme, C, etc. using linked lists with mutable tail sentinel pointer:\n\nAnother particular example gives a solution to the problem of breadth-first labeling. The function label visits every node in a binary tree in the breadth first fashion,  replacing each label with an integer,  each subsequent integer bigger than the last by 1. This solution employs a self-referential data structure,  and the binary tree can be finite or infinite.\n\nOr in Prolog, for comparison,\n\nAn apomorphism (such as an anamorphism, such as unfold) is a form of corecursion in the same way that a paramorphism (such as a catamorphism, such as fold) is a form of recursion.\nThe Coq proof assistant supports corecursion and coinduction using the CoFixpoint command.\n\nHistory\nCorecursion, referred to as circular programming, dates at least to (Bird 1984), who credits John Hughes and Philip Wadler; more general forms were developed in (Allison 1989). The original motivations included producing more efficient algorithms (allowing a single pass over data in some cases, instead of requiring multiple passes) and implementing classical data structures, such as doubly linked lists and queues, in functional languages.\n\nSee also\nBisimulation\nCoinduction\nRecursion\nAnamorphism\n\nNotes\n\n\n== References ==\n",
  "categories": [
    "Category:All articles that are too technical",
    "Category:All articles with style issues",
    "Category:All pages needing cleanup",
    "Category:Articles needing cleanup from July 2012",
    "Category:Articles with example Haskell code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with short description",
    "Category:Category theory",
    "Category:Cleanup tagged articles with a reason field from July 2012",
    "Category:Functional programming",
    "Category:Recursion",
    "Category:Self-reference",
    "Category:Short description matches Wikidata",
    "Category:Theoretical computer science",
    "Category:Wikipedia articles that are too technical from November 2010",
    "Category:Wikipedia articles with style issues from February 2020",
    "Category:Wikipedia pages needing cleanup from July 2012"
  ],
  "archived_date": "20241220_214815",
  "source_url": "https://en.wikipedia.org/wiki/Corecursion"
}