{
  "title": "Cubes (OLAP server)",
  "summary": "Cubes is a light-weight open source multidimensional modelling and OLAP toolkit for development reporting applications and browsing of aggregated data written in Python programming language released under the MIT License.\nCubes provides to an analyst or any application end-user \"understandable and natural way of reporting using concept of data Cubes – multidimensional data objects\".\nCubes was first publicly released in March 2011. The project was originally developed for Public Procurements of S",
  "content": "---\ntitle: Cubes (OLAP server)\nurl: https://en.wikipedia.org/wiki/Cubes_(OLAP_server)\nlanguage: en\ncategories: [\"Category:Articles with example Python (programming language) code\", \"Category:Data analysis software\", \"Category:Data warehousing\", \"Category:Official website different in Wikidata and Wikipedia\", \"Category:Python (programming language) scientific libraries\", \"Category:Python (programming language) software\", \"Category:SQL\"]\nreferences: 0\nlast_modified: 2024-11-24T06:40:53Z\n---\n\n# Cubes (OLAP server)\n\n## Summary\n\nCubes is a light-weight open source multidimensional modelling and OLAP toolkit for development reporting applications and browsing of aggregated data written in Python programming language released under the MIT License.\nCubes provides to an analyst or any application end-user \"understandable and natural way of reporting using concept of data Cubes – multidimensional data objects\".\nCubes was first publicly released in March 2011. The project was originally developed for Public Procurements of S\n\n## Full Content\n\nCubes is a light-weight open source multidimensional modelling and OLAP toolkit for development reporting applications and browsing of aggregated data written in Python programming language released under the MIT License.\nCubes provides to an analyst or any application end-user \"understandable and natural way of reporting using concept of data Cubes – multidimensional data objects\".\nCubes was first publicly released in March 2011. The project was originally developed for Public Procurements of Slovakia. Cubes 1.0 was released in September 2014 and presented on the PyData Conference in New York\n\nFeatures\nOLAP and aggregated browsing (default is ROLAP)\nlogical model of OLAP cubes in JSON or provided from external sources\nhierarchical dimensions (attributes that have hierarchical dependencies, such as category-subcategory or country-region)\nmultiple hierarchies in a dimension\narithmetic expressions for computing derived measures and aggregates\nlocalizable metadata and data\nCubes is capable of handling large amounts of data and complex queries. According to a review by TechTarget, Cubes can handle \"data volumes in the hundreds of millions of rows\" and \"complex queries and calculations that require multi-level aggregations and dynamic subsetting.\" Additionally, the review notes that Cubes is well-suited for smaller organizations or teams that don't require the complexity and scalability of enterprise-level OLAP solutions.\n\nModel\nThe logical conceptual model in Cubes is described using JSON and can be provided either in a form of a file, directory bundle or from an external model provider (for example a database). The basic model objects are: cubes and their measures and aggregates, dimensions and their attributes, hierarchies. Logical model also contains mapping from logical attributes to their physical location in a database (or other data source).\nExample model:\n\nOperations\nCubes provides basic set of operations such as Data drilling and filtering (slicing and dicing). The operations can be accessed either through Python interface or through a light web server called Slicer.\nExample of the python interface:\n\nServer\nThe Cubes provides a non-traditional OLAP server with HTTP queries and JSON response API. Example query to get \"total amount of all contracts between January 2012 and June 2016 by month\":\nhttp://localhost:5000/cube/contracts/aggregate?drilldown=date&drilldown=criteria&cut=date:2012,1-2012,6&order=date.month:desc\nThe response looks like:\n\nThe simple HTTP/JSON interface makes it very easy to integrate OLAP reports in web applications written in pure HTML and JavaScript.\nThe Slicer server contains endpoints describing the cube metadata which helps to create generic reporting applications that don't have to know the database model structure and conceptual hierarchies up-in-front.\nThe Slicer server is written using the Flask (web framework).\n\nROLAP and SQL\nThe built-in SQL backend of the framework provides ROLAP functionality on top a relational database. Cubes contains a SQL query generator that translates the reporting queries into SQL statements. The query generator takes into account topology of the star or snowflake schema and executes only joins that are necessary to retrieve attributes required by the data analyst.\nThe SQL backend uses SQLAlchemy Python toolkit to construct the queries.\n\nSee also\nSQLAlchemy\n\nReferences\nExternal links\nOfficial website\n",
  "categories": [
    "Category:Articles with example Python (programming language) code",
    "Category:Data analysis software",
    "Category:Data warehousing",
    "Category:Official website different in Wikidata and Wikipedia",
    "Category:Python (programming language) scientific libraries",
    "Category:Python (programming language) software",
    "Category:SQL"
  ],
  "archived_date": "20241221_182955",
  "source_url": "https://en.wikipedia.org/wiki/Cubes_(OLAP_server)"
}