{
  "title": "Duck typing",
  "summary": "In computer programming, duck typing is an application of the duck test—\"If it walks like a duck and it quacks like a duck, then it must be a duck\"—to determine whether an object can be used for a particular purpose. With nominative typing, an object is of a given type if it is declared as such (or if a type's association with the object is inferred through mechanisms such as object inheritance). With duck typing, an object is of a given type if it has all methods and properties required by that",
  "content": "---\ntitle: Duck typing\nurl: https://en.wikipedia.org/wiki/Duck_typing\nlanguage: en\ncategories: [\"Category:Articles with example Python (programming language) code\", \"Category:Articles with example pseudocode\", \"Category:Articles with short description\", \"Category:Ducks in popular culture\", \"Category:Object-oriented programming\", \"Category:Short description is different from Wikidata\", \"Category:Type theory\", \"Category:Webarchive template wayback links\"]\nreferences: 0\nlast_modified: 2024-12-19T13:44:21Z\n---\n\n# Duck typing\n\n## Summary\n\nIn computer programming, duck typing is an application of the duck test—\"If it walks like a duck and it quacks like a duck, then it must be a duck\"—to determine whether an object can be used for a particular purpose. With nominative typing, an object is of a given type if it is declared as such (or if a type's association with the object is inferred through mechanisms such as object inheritance). With duck typing, an object is of a given type if it has all methods and properties required by that\n\n## Full Content\n\nIn computer programming, duck typing is an application of the duck test—\"If it walks like a duck and it quacks like a duck, then it must be a duck\"—to determine whether an object can be used for a particular purpose. With nominative typing, an object is of a given type if it is declared as such (or if a type's association with the object is inferred through mechanisms such as object inheritance). With duck typing, an object is of a given type if it has all methods and properties required by that type. Duck typing may be viewed as a usage-based structural equivalence between a given object and the requirements of a type.\n\nExample\nThis simple example in Python 3 demonstrates how any object may be used in any context until it is used in a way that it does not support.\n\nOutput:\n\nIf it can be assumed that anything that can swim is a duck because ducks can swim, a whale could be considered a duck; however, if it is also assumed that a duck must be capable of flying, the whale will not be considered a duck.\n\nIn statically typed languages\nIn some statically typed languages such as Boo and D, class type checking can be specified to occur at runtime rather than at compile time.\n\nComparison with other type systems\nStructural type systems\nDuck typing is similar to, but distinct from, structural typing. Structural typing is a static typing system that determines type compatibility and equivalence by a type's structure, whereas duck typing is dynamic and determines type compatibility by only that part of a type's structure that is accessed during runtime.\nThe TypeScript, Elm and Python languages support structural typing to varying degrees.\n\nProtocols and interfaces\nProtocols and interfaces provide a way to explicitly declare that some methods, operators or behaviors must be defined. If a third-party library implements a class that cannot be modified, a client cannot use an instance of it with an interface unknown to that library even if the class satisfies the interface requirements. A common solution to this problem is the adapter pattern. In contrast, with duck typing, the object would be accepted directly without the need for an adapter.\n\nTemplates or generic types\nTemplate (also called generic) functions or methods apply the duck test in a static typing context; this brings all of the advantages and disadvantages of static versus dynamic type checking. Duck typing can also be more flexible in that only the methods actually called at runtime must be implemented, while templates require implementations of all methods that cannot be proven unreachable at compile time.\nIn languages such as Java, Scala and Objective-C, reflection may be employed to inspect whether objects implement methods or add necessary methods at runtime. For example, Java's MethodHandle API can be used in this manner.\n\nSee also\nAd hoc polymorphism\nDynamic dispatch\nDynamic programming language\nExtension method\nLoose coupling\nMonkey patch\nOperator overloading\n\n\n== References ==\n",
  "categories": [
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with example pseudocode",
    "Category:Articles with short description",
    "Category:Ducks in popular culture",
    "Category:Object-oriented programming",
    "Category:Short description is different from Wikidata",
    "Category:Type theory",
    "Category:Webarchive template wayback links"
  ],
  "archived_date": "20241220_214756",
  "source_url": "https://en.wikipedia.org/wiki/Duck_typing"
}