{
  "title": "Five-number summary",
  "summary": "The five-number summary is a set of descriptive statistics that provides information about a dataset. It consists of the five most important sample percentiles:\n\nthe sample minimum (smallest observation)\nthe lower quartile or first quartile\nthe median (the middle value)\nthe upper quartile or third quartile\nthe sample maximum (largest observation)\nIn addition to the median of a single set of data there are two related statistics called the upper and lower quartiles. If data are placed in order, t",
  "content": "---\ntitle: Five-number summary\nurl: https://en.wikipedia.org/wiki/Five-number_summary\nlanguage: en\ncategories: [\"Category:All articles needing additional references\", \"Category:Articles needing additional references from January 2013\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with example R code\", \"Category:Articles with short description\", \"Category:Short description is different from Wikidata\", \"Category:Summary statistics\"]\nreferences: 0\nlast_modified: 2024-12-19T13:43:12Z\n---\n\n# Five-number summary\n\n## Summary\n\nThe five-number summary is a set of descriptive statistics that provides information about a dataset. It consists of the five most important sample percentiles:\n\nthe sample minimum (smallest observation)\nthe lower quartile or first quartile\nthe median (the middle value)\nthe upper quartile or third quartile\nthe sample maximum (largest observation)\nIn addition to the median of a single set of data there are two related statistics called the upper and lower quartiles. If data are placed in order, t\n\n## Full Content\n\nThe five-number summary is a set of descriptive statistics that provides information about a dataset. It consists of the five most important sample percentiles:\n\nthe sample minimum (smallest observation)\nthe lower quartile or first quartile\nthe median (the middle value)\nthe upper quartile or third quartile\nthe sample maximum (largest observation)\nIn addition to the median of a single set of data there are two related statistics called the upper and lower quartiles. If data are placed in order, then the lower quartile is central to the lower half of the data and the upper quartile is central to the upper half of the data. These quartiles are used to calculate the interquartile range, which helps to describe the spread of the data, and determine whether or not any data points are outliers.\nIn order for these statistics to exist, the observations must be from a univariate variable that can be measured on an ordinal, interval or ratio scale.\n\nUse and representation\nThe five-number summary provides a concise summary of the distribution of the observations. Reporting five numbers avoids the need to decide on the most appropriate summary statistic. The five-number summary gives information about the location (from the median), spread (from the quartiles) and range (from the sample minimum and maximum) of the observations. Since it reports order statistics (rather than, say, the mean) the five-number summary is appropriate for ordinal measurements, as well as interval and ratio measurements.\nIt is possible to quickly compare several sets of observations by comparing their five-number summaries, which can be represented graphically using a boxplot.\nIn addition to the points themselves, many L-estimators can be computed from the five-number summary, including interquartile range, midhinge, range, mid-range, and trimean.\nThe five-number summary is sometimes represented as in the following table:\n\nExample\nThis example calculates the five-number summary for the following set of observations: 0, 0, 1, 2, 63, 61, 27, 13.\nThese are the number of moons of each planet in the Solar System.\nIt helps to put the observations in ascending order: 0, 0, 1, 2, 13, 27, 61, 63. There are eight observations, so the median is the mean of the two middle numbers, (2 + 13)/2 = 7.5. Splitting the observations either side of the median gives two groups of four observations. The median of the first group is the lower or first quartile, and is equal to (0 + 1)/2 = 0.5. The median of the second group is the upper or third quartile, and is equal to (27 + 61)/2 = 44.\nThe smallest and largest observations are 0 and 63.\nSo the five-number summary would be 0, 0.5, 7.5, 44, 63.\n\nExample in R\nIt is possible to calculate the five-number summary in the R programming language using the fivenum function. The summary function, when applied to a vector, displays the five-number summary together with the mean (which is not itself a part of the five-number summary). The fivenum uses a different method to calculate percentiles than the summary function.\n\nExample in Python\nThis python example uses the percentile function from the numerical library numpy and works in Python 2 and 3.\n\nExample in SAS\nYou can use PROC UNIVARIATE in SAS to get the five number summary:\n\nExample in Stata\nSee also\nSeven-number summary\nThree-point estimation\nBox plot\n\n\n== References ==\n",
  "categories": [
    "Category:All articles needing additional references",
    "Category:Articles needing additional references from January 2013",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with example R code",
    "Category:Articles with short description",
    "Category:Short description is different from Wikidata",
    "Category:Summary statistics"
  ],
  "archived_date": "20241220_214811",
  "source_url": "https://en.wikipedia.org/wiki/Five-number_summary"
}