{
  "title": "Flask (web framework)",
  "summary": "Flask is a micro web framework written in Python. It is classified as a microframework because it does not require particular tools or libraries. It has no database abstraction layer, form validation, or any other components where pre-existing third-party libraries provide common functions. However, Flask supports extensions that can add application features as if they were implemented in Flask itself. Extensions exist for object-relational mappers, form validation, upload handling, various open",
  "content": "---\ntitle: Flask (web framework)\nurl: https://en.wikipedia.org/wiki/Flask_(web_framework)\nlanguage: en\ncategories: [\"Category:All articles containing potentially dated statements\", \"Category:All articles lacking reliable references\", \"Category:Articles containing potentially dated statements from October 2020\", \"Category:Articles lacking reliable references from April 2024\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with short description\", \"Category:Free software programmed in Python\", \"Category:Python (programming language) web frameworks\", \"Category:Short description matches Wikidata\", \"Category:Software using the BSD license\"]\nreferences: 0\nlast_modified: 2024-12-19T14:23:54Z\n---\n\n# Flask (web framework)\n\n## Summary\n\nFlask is a micro web framework written in Python. It is classified as a microframework because it does not require particular tools or libraries. It has no database abstraction layer, form validation, or any other components where pre-existing third-party libraries provide common functions. However, Flask supports extensions that can add application features as if they were implemented in Flask itself. Extensions exist for object-relational mappers, form validation, upload handling, various open\n\n## Full Content\n\nFlask is a micro web framework written in Python. It is classified as a microframework because it does not require particular tools or libraries. It has no database abstraction layer, form validation, or any other components where pre-existing third-party libraries provide common functions. However, Flask supports extensions that can add application features as if they were implemented in Flask itself. Extensions exist for object-relational mappers, form validation, upload handling, various open authentication technologies and several common framework related tools.\nApplications that use the Flask framework include Pinterest and LinkedIn.\n\nHistory\nFlask was created by Armin Ronacher of Pocoo, an international group of Python enthusiasts formed in 2004. According to Ronacher, the idea was originally an April Fool's joke that was popular enough to make into a serious application. The name is a play on the earlier Bottle framework.\nWhen Ronacher and Georg Brandl created a bulletin board system written in Python in 2004, the Pocoo projects Werkzeug and Jinja were developed.\nIn April 2016, the Pocoo team was disbanded and development of Flask and related libraries passed to the newly formed Pallets project. Since 2018, Flask-related data and objects can be rendered with Bootstrap.\nFlask has become popular among Python enthusiasts. As of October 2020, it has the second-most number of stars on GitHub among Python web-development frameworks, only slightly behind Django, and was voted the most popular web framework in the Python Developers Survey for years between and including 2018 and 2022.\n\nComponents\nThe microframework Flask is part of the Pallets Projects (formerly Pocoo), and based on several others of them, all under a BSD license.\n\nWerkzeug\nWerkzeug (German for \"tool\") is a utility library for the Python programming language for Web Server Gateway Interface (WSGI) applications. Werkzeug can instantiate objects for request, response, and utility functions. It can be used as the basis for a custom software framework and supports Python 2.7 and 3.5 and later.\n\nJinja\nJinja, also by Ronacher, is a template engine for the Python programming language. Similar to the Django web framework, it handles templates in a sandbox.\n\nMarkupSafe\nMarkupSafe is a string handling library for the Python programming language. The eponymous MarkupSafe type extends the Python string type and marks its contents as \"safe\"; combining MarkupSafe with regular strings automatically escapes the unmarked strings, while avoiding double escaping of already marked strings.\n\nItsDangerous\nItsDangerous is a safe data serialization library for the Python programming language. It is used to store the session of a Flask application in a cookie without allowing users to tamper with the session contents.\n\nFeatures\nDevelopment server and debugger\nIntegrated support for unit testing\nRESTful request dispatching\nUses Jinja templating\nSupport for secure cookies (client side sessions)\n100% WSGI 1.0 compliant\nUnicode-based\nComplete documentation\nGoogle App Engine compatibility\nExtensions available to extend functionality\n\nExample\nThe following code shows a simple web application that displays \"Hello World!\" when visited:\n\nSee also\nDjango (web framework)\nFastAPI\nJam.py\nPylons project\nTornado\nWeb2py\nComparison of web frameworks\n\nReferences\nExternal links\nOfficial website\n",
  "categories": [
    "Category:All articles containing potentially dated statements",
    "Category:All articles lacking reliable references",
    "Category:Articles containing potentially dated statements from October 2020",
    "Category:Articles lacking reliable references from April 2024",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with short description",
    "Category:Free software programmed in Python",
    "Category:Python (programming language) web frameworks",
    "Category:Short description matches Wikidata",
    "Category:Software using the BSD license"
  ],
  "archived_date": "20241220_214814",
  "source_url": "https://en.wikipedia.org/wiki/Flask_(web_framework)"
}