{
  "title": "For loop",
  "summary": "In computer science, a for-loop or for loop is a control flow statement for specifying iteration. Specifically, a for-loop functions by running a section of code repeatedly until a certain condition has been satisfied.\nFor-loops have two parts: a header and a body. The header defines the iteration and the body is the code executed once per iteration. The header often declares an explicit loop counter or loop variable. This allows the body to know which iteration is being executed. For-loops are ",
  "content": "---\ntitle: For loop\nurl: https://en.wikipedia.org/wiki/For_loop\nlanguage: en\ncategories: [\"Category:All articles with unsourced statements\", \"Category:Articles with example ALGOL 68 code\", \"Category:Articles with example Ada code\", \"Category:Articles with example BASIC code\", \"Category:Articles with example C++ code\", \"Category:Articles with example C code\", \"Category:Articles with example Fortran code\", \"Category:Articles with example Haskell code\", \"Category:Articles with example JavaScript code\", \"Category:Articles with example Java code\", \"Category:Articles with example Julia code\", \"Category:Articles with example MATLAB/Octave code\", \"Category:Articles with example OCaml code\", \"Category:Articles with example PHP code\", \"Category:Articles with example Pascal code\", \"Category:Articles with example Perl code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with example Ruby code\", \"Category:Articles with example Rust code\", \"Category:Articles with example Smalltalk code\", \"Category:Articles with short description\", \"Category:Articles with unsourced statements from August 2009\", \"Category:Control flow\", \"Category:Iteration in programming\", \"Category:Programming language comparisons\", \"Category:Short description is different from Wikidata\"]\nreferences: 0\nlast_modified: 2024-12-19T13:44:28Z\n---\n\n# For loop\n\n## Summary\n\nIn computer science, a for-loop or for loop is a control flow statement for specifying iteration. Specifically, a for-loop functions by running a section of code repeatedly until a certain condition has been satisfied.\nFor-loops have two parts: a header and a body. The header defines the iteration and the body is the code executed once per iteration. The header often declares an explicit loop counter or loop variable. This allows the body to know which iteration is being executed. For-loops are \n\n## Full Content\n\nIn computer science, a for-loop or for loop is a control flow statement for specifying iteration. Specifically, a for-loop functions by running a section of code repeatedly until a certain condition has been satisfied.\nFor-loops have two parts: a header and a body. The header defines the iteration and the body is the code executed once per iteration. The header often declares an explicit loop counter or loop variable. This allows the body to know which iteration is being executed. For-loops are typically used when the number of iterations is known before entering the loop. For-loops can be thought of as shorthands for while-loops which increment and test a loop variable.\nVarious keywords are used to indicate the usage of a for loop: descendants of ALGOL use \"for\", while descendants of Fortran use \"do\". There are other possibilities, for example COBOL which uses PERFORM VARYING.\nThe name for-loop comes from the word for. For is used as the reserved word (or keyword) in many programming languages to introduce a for-loop. The term in English dates to ALGOL 58 and was popularized in ALGOL 60. It is the direct translation of the earlier German für and was used in Superplan (1949–1951) by Heinz Rutishauser. Rutishauser was involved in defining ALGOL 58 and ALGOL 60. The loop body is executed \"for\" the given values of the loop variable. This is more explicit in ALGOL versions of the for statement where a list of possible values and increments can be specified.\nIn Fortran and PL/I, the keyword DO is used for the same thing and it is named a do-loop; this is different from a do while loop.\n\nFOR\nA for-loop statement is available in most imperative programming languages. Even ignoring minor differences in syntax, there are many differences in how these statements work and the level of expressiveness they support. Generally, for-loops fall into one of four categories:\n\nTraditional for-loops\nThe for-loop of languages like ALGOL, Simula, BASIC, Pascal, Modula, Oberon, Ada, MATLAB, OCaml, F#, and so on, requires a control variable with start- and end-values, which looks something like this:\n\nDepending on the language, an explicit assignment sign may be used in place of the equal sign (and some languages require the word int even in the numerical case). An optional step-value (an increment or decrement ≠ 1) may also be included, although the exact syntaxes used for this differ a bit more between the languages. Some languages require a separate declaration of the control variable, some do not.\nAnother form was popularized by the C language. It requires 3 parts: the initialization (loop variant), the condition, and the advancement to the next iteration. All these three parts are optional. This type of \"semicolon loops\" came from B programming language and it was originally invented by Stephen Johnson.\nIn the initialization part, any variables needed are declared (and usually assigned values). If multiple variables are declared, they should all be the same type. The condition part checks a certain condition and exits the loop if false, even if the loop is never executed. If the condition is true, then the lines of code inside the loop are executed. The advancement to the next iteration part is performed exactly once every time the loop ends. The loop is then repeated if the condition evaluates to true.\nHere is an example of the C-style traditional for-loop in Java.\n\nThese loops are also sometimes named numeric for-loops when contrasted with foreach loops (see below).\n\nIterator-based for-loops\nThis type of for-loop is a generalization of the numeric range type of for-loop, as it allows for the enumeration of sets of items other than number sequences. It is usually characterized by the use of an implicit or explicit iterator, in which the loop variable takes on each of the values in a sequence or other data collection. A representative example in Python is:\n\nWhere some_iterable_object is either a data collection that supports implicit iteration (like a list of employee's names), or may be an iterator itself. Some languages have this in addition to another for-loop syntax; notably, PHP has this type of loop under the name for each, as well as a three-expression for-loop (see below) under the name for.\n\nVectorised for-loops\nSome languages offer a for-loop that acts as if processing all iterations in parallel, such as the for all keyword in Fortran 95 which has the interpretation that all right-hand-side expressions are evaluated before any assignments are made, as distinct from the explicit iteration form. For example, in the for statement in the following pseudocode fragment, when calculating the new value for A(i), except for the first (with i = 2) the reference to A(i - 1) will obtain the new value that had been placed there in the previous step. In the for all version, however, each calculation refers only to the original, unaltered A.\n\nfor     i := 2 : N - 1 do A(i) := [A(i - 1) + A(i) + A(i + 1)] / 3; next i;\nfor all i := 2 : N - 1 do A(i) := [A(i - 1) + A(i) + A(i + 1)] / 3;\n\nThe difference may be significant.\nSome languages (such as PL/I, Fortran 95) also offer array assignment statements, that enable many for-loops to be omitted. Thus pseudocode such as A:= 0; would set all elements of array A to zero, no matter its size or dimensionality. The example loop could be rendered as\n\nBut whether that would be rendered in the style of the for-loop or the for-all-loop or something else may not be clearly described in the compiler manual.\n\nCompound for-loops\nIntroduced with ALGOL 68 and followed by PL/I, this allows the iteration of a loop to be compounded with a test, as in\n\nfor i := 1 : N while A(i) > 0 do etc.\n\nThat is, a value is assigned to the loop variable i and only if the while expression is true will the loop body be executed. If the result were false the for-loop's execution stops short. Granted that the loop variable's value is defined after the termination of the loop, then the above statement will find the first non-positive element in array A (and if no such, its value will be N + 1), or, with suitable variations, the first non-blank character in a string, and so on.\n\nLoop counters\nIn computer programming, a  loop counter is a control variable that controls the iterations of a loop (a computer programming language construct). It is so named because most uses of this construct result in the variable taking on a range of integer values in some orderly sequences (for example., starting at 0 and ending at 10 in increments of 1)\nLoop counters change with each iteration of a loop, providing a unique value for each iteration. The loop counter is used to decide when the loop should terminate and for the program flow to continue to the next instruction after the loop.\nA common identifier naming convention is for the loop counter to use the variable names i, j, and k (and so on if needed), where i would be the most outer loop, j the next inner loop, etc. The reverse order is also used by some programmers. This style is generally agreed to have originated from the early programming of Fortran, where these variable names beginning with these letters were implicitly declared as having an integer type, and so were obvious choices for loop counters that were only temporarily required. The practice dates back further to mathematical notation where indices for sums and multiplications are often i, j, etc. A variant convention is the use of duplicated letters for the index, ii, jj, and  kk, as this allows easier searching and search-replacing than using a single letter.\n\nExample\nAn example of C code involving nested for loops, where the loop counter variables are i and j:\n\nLoops in C can also be used to print the reverse of a word. As:\n\nHere, if the input is apple, the output will be elppa.\n\nAdditional semantics and constructs\nUse as infinite loops\nThis C-style for-loop is commonly the source of an infinite loop since the fundamental steps of iteration are completely in the control of the programmer. When infinite loops are intended, this type of for-loop can be used (with empty expressions), such as:\n\nThis style is used instead of infinite while (1) loops to avoid a type conversion warning in some C/C++ compilers. Some programmers prefer the more succinct for (;;) form over the semantically equivalent but more verbose while (true) form.\n\nEarly exit and continuation\nSome languages may also provide other supporting statements, which when present can alter how the for-loop iteration proceeds. Common among these are the break and continue statements found in C and its derivatives. The break statement causes the innermost loop to be terminated immediately when executed. The continue statement will move at once to the next iteration without further progress through the loop body for the current iteration. A for statement also terminates when a break, goto, or return statement within the statement body is executed.[Wells] Other languages may have similar statements or otherwise provide means to alter the for-loop progress; for example in Fortran 95:\n\nSome languages offer further facilities such as naming the various loop statements so that with multiple nested loops there is no doubt as to which loop is involved. Fortran 95, for example:\n\nThus, when \"trouble\" is detected in the inner loop, the CYCLE X1 (not X2) means that the skip will be to the next iteration for I, not J. The compiler will also be checking that each END DO has the appropriate label for its position: this is not just a documentation aid. The programmer must still code the problem correctly, but some possible blunders will be blocked.\n\nLoop variable scope and semantics\nDifferent languages specify different rules for what value the loop variable will hold on termination of its loop, and indeed some hold that it \"becomes undefined\". This permits a compiler to generate code that leaves any value in the loop variable, or perhaps even leaves it unchanged because the loop value was held in a register and never stored in memory. Actual behavior may even vary according to the compiler's optimization settings, as with the Honeywell Fortran66 compiler.\nIn some languages (not C or C++) the loop variable is immutable within the scope of the loop body, with any attempt to modify its value being regarded as a semantic error. Such modifications are sometimes a consequence of a programmer error, which can be very difficult to identify once made. However, only overt changes are likely to be detected by the compiler. Situations, where the address of the loop variable is passed as an argument to a subroutine, make it very difficult to check because the routine's behavior is in general unknowable to the compiler. Some examples in the style of Fortran:\n\nA common approach is to calculate the iteration count at the start of a loop (with careful attention to overflow as in for i:= 0: 65535 do ... ; in sixteen-bit integer arithmetic) and with each iteration decrement this count while also adjusting the value of I: double counting results. However, adjustments to the value of I within the loop will not change the number of iterations executed.\nStill, another possibility is that the code generated may employ an auxiliary variable as the loop variable, possibly held in a machine register, whose value may or may not be copied to I on each iteration. Again, modifications of I would not affect the control of the loop, but now a disjunction is possible: within the loop, references to the value of I might be to the (possibly altered) current value of I or to the auxiliary variable (held safe from improper modification) and confusing results are guaranteed. For instance, within the loop a reference to element I of an array would likely employ the auxiliary variable (especially if it were held in a machine register), but if I is a parameter to some routine (for instance, a print-statement to reveal its value), it would likely be a reference to the proper variable I instead. It is best to avoid such possibilities.\n\nAdjustment of bounds\nJust as the index variable might be modified within a for-loop, so also may its bounds and direction. But to uncertain effect. A compiler may prevent such attempts, they may have no effect, or they might even work properly - though many would declare that to do so would be wrong. Consider a statement such as\n\nfor i := first : last : step do\n  A(i) := A(i) / A(last);\n\nIf the approach to compiling such a loop was to be the evaluation of first, last and step and the calculation of an iteration count via something like (last - first)/step once only at the start, then if those items were simple variables and their values were somehow adjusted during the iterations, this would have no effect on the iteration count even if the element selected for division by A(last) changed.\n\nList of value ranges\nPL/I and ALGOL 68, allow loops in which the loop variable is iterated over a list of ranges of values instead of a single range. The following PL/I example will execute the loop with six values of i: 1, 7, 12, 13, 14, 15:\n\nEquivalence with while-loops\nA for-loop is generally equivalent to a while-loop:\n\nfactorial := 1\n for counter from 2 to 5\n     factorial := factorial * counter\ncounter:= counter - 1\nprint counter + \"! equals \" + factorial\n\nIs equivalent to:\n\nfactorial := 1\ncounter := 1\n while counter < 5\n    counter := counter + 1\n    factorial := factorial * counter\nprint counter + \"! equals \" + factorial\n\nAs demonstrated by the output of the variables.\n\nTimeline of the for-loop syntax in various programming languages\nGiven an action that must be repeated, for instance, five times, different languages' for-loops will be written differently. The syntax for a three-expression for-loop is nearly identical in all languages that have it, after accounting for different styles of block termination and so on.\n\n1957: FORTRAN\nFortran's equivalent of the for loop is the DO loop,\nusing the keyword do instead of for,\nThe syntax of Fortran's DO loop is:\n\nThe following two examples behave equivalently to the three argument for-loop in other languages,\ninitializing the counter variable to 1, incrementing by 1 each iteration of the loop, and stopping at five (inclusive).\n\nIn Fortran 77 (or later), this may also be written as:\n\nThe step part may be omitted if the step is one. Example:\n\nSpaces are irrelevant in fixed-form Fortran statements, thus SUM SQ is the same as SUMSQ. In the modern free-form Fortran style, blanks are significant.\nIn Fortran 90, the GO TO may be avoided by using an EXIT statement.\n\n1958: ALGOL\nALGOL 58 introduced the for statement, using the form as Superplan:\n\n FOR Identifier = Base (Difference) Limit\n\nFor example to print 0 to 10 incremented by 1:\n\nFOR x = 0 (1) 10 BEGIN\nPRINT (FL) = x END\n\n1960: COBOL\nCOBOL was formalized in late 1959 and has had many elaborations. It uses the PERFORM verb which has many options. Originally all loops had to be out-of-line with the iterated code occupying a separate paragraph. Ignoring the need for declaring and initializing variables, the COBOL equivalent of a for-loop would be.\n\nIn the 1980s, the addition of in-line loops and structured programming statements such as END-PERFORM resulted in a for-loop with a more familiar structure.\n\nIf the PERFORM verb has the optional clause TEST AFTER, the resulting loop is slightly different: the loop body is executed at least once, before any test.\n\n1964: BASIC\nIn BASIC, a loop is sometimes named a for-next loop.\n\nThe end-loop marker specifies the name of the index variable, which must correspond to the name of the index variable at the start of the for-loop. Some languages (PL/I, Fortran 95, and later) allow a statement label at the start of a for-loop that can be matched by the compiler against the same text on the corresponding end-loop statement. Fortran also allows the EXIT and CYCLE statements to name this text; in a nest of loops, this makes clear which loop is intended. However, in these languages, the labels must be unique, so successive loops involving the same index variable cannot use the same text nor can a label be the same as the name of a variable, such as the index variable for the loop.\n\n1964: PL/I\nThe LEAVE statement may be used to exit the loop. Loops can be labeled, and leave may leave a specific labeled loop in a group of nested loops. Some PL/I dialects include the ITERATE statement to terminate the current loop iteration and begin the next.\n\n1968: ALGOL 68\nALGOL 68 has what was considered the universal loop, the full syntax is:\n\nFOR i FROM 1 BY 2 TO 3 WHILE i≠4 DO ~ OD\n\nFurther, the single iteration range could be replaced by a list of such ranges. There are several unusual aspects of the construct\n\nonly the do ~ od portion was compulsory, in which case the loop will iterate indefinitely.\nthus the clause to 100 do ~ od, will iterate exactly 100 times.\nThe while syntactic element allowed a programmer to break from a for loop early, as in:\nINT sum sq := 0;\nFOR i\n WHILE\n  print((\"So far:\", i, new line)); # Interposed for tracing purposes. #\n  sum sq ≠ 70↑2                    # This is the test for the WHILE   #\nDO\n  sum sq +:= i↑2\nOD\n\nSubsequent extensions to the standard ALGOL 68 allowed the to syntactic element to be replaced with upto and downto to achieve a small optimization. The same compilers also incorporated:\n\nuntil\nfor late loop termination.\nforeach\nfor working on arrays in parallel.\n\n1970: Pascal\nDecrementing (counting backwards) is using downto keyword instead of to, as in:\n\nThe numeric range for-loop varies somewhat more.\n\n1972: C, C++\nThe statement is often a block statement; an example of this would be:\n\nThe ISO/IEC 9899:1999 publication (commonly known as C99) also allows initial declarations in for loops. All three sections in the for loop are optional, with an empty condition equivalent to true.\n\n1972: Smalltalk\nContrary to other languages, in Smalltalk a for-loop is not a language construct but is defined in the class Number as a method with two parameters, the end value and a closure, using self as start value.\n\n1980: Ada\nThe exit statement may be used to exit the loop. Loops can be labeled, and exit may leave a specifically labeled loop in a group of nested loops:\n\n1980: Maple\nMaple has two forms of for-loop, one for iterating over a range of values, and the other for iterating over the contents of a container. The value range form is as follows:\n\nfor i from f by b to t while w do\n    # loop body\nod;\n\nAll parts except do and od are optional. The  for I part, if present, must come first. The remaining parts (from f, by b, to t, while w) can appear in any order.\nIterating over a container is done using this form of loop:\n\nfor e in c while w do\n    # loop body\nod;\n\nThe  in c clause specifies the container, which may be a list, set, sum, product, unevaluated function, array, or object implementing an iterator.\nA for-loop may be terminated by od, end, or end do.\n\n1982: Maxima CAS\nIn Maxima CAS, one can use also integer values:\n\n1982: PostScript\nThe for-loop, written as [initial] [increment] [limit] { ... } for initializes an internal variable, and executes the body as long as the internal variable is not more than the limit (or not less, if the increment is negative) and, at the end of each iteration, increments the internal variable. Before each iteration, the value of the internal variable is pushed onto the stack.\n\nThere is also a simple repeat loop.\nThe repeat-loop, written as X { ... } repeat, repeats the body exactly X times.\n\n1983: Ada 83 and above\n1984: MATLAB\nAfter the loop, n would be 5 in this example.\nAs i is used for the Imaginary unit, its use as a loop variable is discouraged.\n\n1987: Perl\n\"There's more than one way to do it\" is a Perl programming motto.\n\n1988: Mathematica\nThe construct corresponding to most other languages' for-loop is named Do in Mathematica.\n\nMathematica also has a For construct that mimics the for-loop of C-like languages.\n\n1989: Bash\nAn empty loop (i.e., one with no commands between do and done) is a syntax error. If the above loops contained only comments, execution would result in the message \"syntax error near unexpected token 'done'\".\n\n1990: Haskell\nThe built-in imperative forM_ maps a monadic expression into a list, as\n\nor get each iteration result as a list in\n\nBut, to save the space of the [1..5] list,\na more authentic monadic forLoop_ construction can be defined as\n\nand used as:\n\n1991: Oberon-2, Oberon-07, Component Pascal\nIn the original Oberon language, the for-loop was omitted in favor of the more general Oberon loop construct. The for-loop was reintroduced in Oberon-2.\n\n1991: Python\nPython does not contain the classical for loop, rather a foreach loop is used to iterate over the output of the built-in range() function which returns an iterable sequence of integers.Using range(6) would run the loop from 0 to 5.\n\n1993: AppleScript\nIt can also iterate through a list of items, similar to what can be done with arrays in other languages:\n\nA exit repeat may also be used to exit a loop at any time. Unlike other languages, AppleScript currently has no command to continue to the next iteration of a loop.\n\n1993: Crystal\nSo, this code  will print:\n\nFor-loops can also loop through a table using  to iterate numerically through arrays and  to iterate randomly through dictionaries.\nGeneric for-loop making use of closures:\n\n1995: ColdFusion Markup Language (CFML)\nScript syntax\nSimple index loop:\n\nUsing an array:\n\nUsing a list of string values:\n\nThe above list example is only available in the dialect of CFML used by Lucee and Railo.\n\nTag syntax\nSimple index loop:\n\nUsing an array:\n\nUsing a \"list\" of string values:\n\n1995: Java\nFor the extended for-loop, see Foreach loop § Java.\n\n1995: JavaScript\nJavaScript supports C-style \"three-expression\" loops. The break and continue statements are supported inside loops.\n\nAlternatively, it is possible to iterate over all keys of an array.\n\n1995: PHP\nThis prints out a triangle of *\n\n1995: Ruby\nRuby has several possible syntaxes, including the above samples.\n\n1996: OCaml\nSee expression syntax.\n\n1998: ActionScript 3\n2008: Small Basic\n2008: Nim\nNim has a foreach-type loop and various operations for creating iterators.\n\n2009: Go\n2010: Rust\n2012: Julia\nSee also\nDo while loop\nForeach\nWhile loop\nPrimitive recursive function\nGeneral recursive function\n\n\n== References ==\n",
  "categories": [
    "Category:All articles with unsourced statements",
    "Category:Articles with example ALGOL 68 code",
    "Category:Articles with example Ada code",
    "Category:Articles with example BASIC code",
    "Category:Articles with example C++ code",
    "Category:Articles with example C code",
    "Category:Articles with example Fortran code",
    "Category:Articles with example Haskell code",
    "Category:Articles with example JavaScript code",
    "Category:Articles with example Java code",
    "Category:Articles with example Julia code",
    "Category:Articles with example MATLAB/Octave code",
    "Category:Articles with example OCaml code",
    "Category:Articles with example PHP code",
    "Category:Articles with example Pascal code",
    "Category:Articles with example Perl code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with example Ruby code",
    "Category:Articles with example Rust code",
    "Category:Articles with example Smalltalk code",
    "Category:Articles with short description",
    "Category:Articles with unsourced statements from August 2009",
    "Category:Control flow",
    "Category:Iteration in programming",
    "Category:Programming language comparisons",
    "Category:Short description is different from Wikidata"
  ],
  "archived_date": "20241221_183047",
  "source_url": "https://en.wikipedia.org/wiki/For_loop"
}