{
  "title": "GNU Bazaar",
  "summary": "GNU Bazaar (formerly Bazaar-NG, command line tool bzr) is a distributed and client–server revision control system sponsored by Canonical.\nBazaar can be used by a single developer working on multiple branches of local content, or by teams collaborating across a network.\nBazaar is written in the Python programming language, with packages for major Linux distributions, Mac OS X and Microsoft Windows. Bazaar is free software and part of the GNU Project.",
  "content": "---\ntitle: GNU Bazaar\nurl: https://en.wikipedia.org/wiki/GNU_Bazaar\nlanguage: en\ncategories: [\"Category:All articles containing potentially dated statements\", \"Category:Articles containing potentially dated statements from 2008\", \"Category:Articles with short description\", \"Category:Canonical (company)\", \"Category:Distributed version control systems\", \"Category:Free software programmed in Python\", \"Category:Free version control software\", \"Category:GNU Project software\", \"Category:Official website different in Wikidata and Wikipedia\", \"Category:Python (programming language) software\", \"Category:Short description is different from Wikidata\", \"Category:Use dmy dates from January 2021\", \"Category:Version control systems\", \"Category:Wikipedia articles needing clarification from June 2017\"]\nreferences: 0\nlast_modified: 2024-12-19T13:57:18Z\n---\n\n# GNU Bazaar\n\n## Summary\n\nGNU Bazaar (formerly Bazaar-NG, command line tool bzr) is a distributed and client–server revision control system sponsored by Canonical.\nBazaar can be used by a single developer working on multiple branches of local content, or by teams collaborating across a network.\nBazaar is written in the Python programming language, with packages for major Linux distributions, Mac OS X and Microsoft Windows. Bazaar is free software and part of the GNU Project.\n\n## Full Content\n\nGNU Bazaar (formerly Bazaar-NG, command line tool bzr) is a distributed and client–server revision control system sponsored by Canonical.\nBazaar can be used by a single developer working on multiple branches of local content, or by teams collaborating across a network.\nBazaar is written in the Python programming language, with packages for major Linux distributions, Mac OS X and Microsoft Windows. Bazaar is free software and part of the GNU Project.\n\nFeatures\nBazaar commands are similar to those found in CVS or Subversion.  A new project can be started and maintained without a remote repository server by invoking bzr init in a directory which a person wishes to version.\nIn contrast to purely distributed version control systems which do not use a central server, Bazaar supports working with or without a central server.  It is possible to use both methods at the same time with the same project.  The websites Launchpad and SourceForge provide free hosting service for projects managed with Bazaar.\nBazaar has support for working with some other revision control systems. This allows users to branch from another system (such as Subversion), make local changes and commit them into a Bazaar branch, and then later merge them back into the other system. Read-only access is also available for Git and Mercurial. Bazaar also allows for interoperation with many other systems (including CVS, Darcs, Git, Perforce, Mercurial) by allowing one to import/export the history.\nBazaar supports files with names from the complete Unicode set. It also allows commit messages, committer names, etc. to be in Unicode.\n\nHistory\nBaz: an earlier Canonical version control system\nThe name \"Bazaar\" was originally used by a fork of the GNU arch client tla. This fork is now called Baz to distinguish it from the current Bazaar software. Baz was announced in October 2004 by Canonical employee Robert Collins and maintained until 2005, when the project then called Bazaar-NG (the present Bazaar) was announced as Baz's successor. Baz is now unmaintained and Canonical declared it deprecated. The last release of Baz was version 1.4.3, released October 2005. A planned 1.5 release of Baz was abandoned in 2006.\n\nBazaar\nIn February 2005, Martin Pool, a developer who had previously described and reviewed a number of revision control systems in talks and in his weblog, announced that he had been hired by Canonical and tasked with \"build[ing] a distributed version-control system that open-source hackers will love to use.\" A public website and mailing list were established in March 2005 and the first numbered pre-release, 0.0.1, was released on 26 March 2005.\nBazaar was conceived from the start as a different piece of software from both GNU arch and Baz. It has a different command set and is a completely different codebase and design. Bazaar was originally intended as a test-bed for features to be later integrated into Baz, but by mid-2005 many of the major Baz developers had begun working primarily on Bazaar directly and Baz was abandoned.\nVersion 1.0 of Bazaar was released in December 2007. In February 2008, Bazaar became a GNU Project. In April 2012 Martin Pool left Canonical and the pace of development of the project slowed. According to Jelmer Vernooij the members of Canonical's Bazaar team were assigned to different tasks in early 2012 and he himself stepped down from contributing to Bazaar at the end of 2012, after 7 years of contributing to the project. In March 2013 a discussion on the GNU Emacs mailing list started about whether Bazaar is still effectively maintained and if Emacs should move to another version control system. In January 2014 Eric Raymond proposed and coordinated a transition of GNU Emacs from Bazaar to the git version control system. This transition was completed in November 2014. Likewise, the Bugzilla project retired Bazaar in favor of git in March 2014 for multiple reasons, one of them being the impression that Bazaar was almost dead: \"There are maybe 2-3 commits to trunk every month. The time to fix bugs in Bazaar also seems to be quite long, generally.\"\nVersion 2.7.0 was released in February 2016.\n\nBreezy\nBazaar was forked as Breezy in 2017 to allow backwards-incompatible changes to be made, such as migrating from Python 2 to Python 3 and dropping support for older versions of Windows.\n\nAdoption\nSource code hosting\nThe following websites provide free source code hosting for Bazaar repositories:\n\nLaunchpad\nGNU Savannah\nSourceForge (discontinued for new projects)\n\nProjects using Bazaar\nProminent projects that have used Bazaar for version control include:\n\nUbuntu (but there were no Bazaar commits since 2022)\n\nSee also\nBreezy\nDistributed version control\nComparison of version-control software\nComparison of source-code-hosting facilities\nThe Cathedral and the Bazaar (source of the name)\n\nReferences\nExternal links\nOfficial website\n",
  "categories": [
    "Category:All articles containing potentially dated statements",
    "Category:Articles containing potentially dated statements from 2008",
    "Category:Articles with short description",
    "Category:Canonical (company)",
    "Category:Distributed version control systems",
    "Category:Free software programmed in Python",
    "Category:Free version control software",
    "Category:GNU Project software",
    "Category:Official website different in Wikidata and Wikipedia",
    "Category:Python (programming language) software",
    "Category:Short description is different from Wikidata",
    "Category:Use dmy dates from January 2021",
    "Category:Version control systems",
    "Category:Wikipedia articles needing clarification from June 2017"
  ],
  "archived_date": "20241220_214834",
  "source_url": "https://en.wikipedia.org/wiki/GNU_Bazaar"
}