{
  "title": "IPython",
  "summary": "IPython (Interactive Python) is a command shell for interactive computing in multiple programming languages, originally developed for the Python programming language, that offers introspection, rich media, shell syntax, tab completion, and history. IPython provides the following features:\n\nInteractive shells (terminal and Qt-based).\nA browser-based notebook interface with support for code, text, mathematical expressions, inline plots and other media.\nSupport for interactive data visualization an",
  "content": "---\ntitle: IPython\nurl: https://en.wikipedia.org/wiki/IPython\nlanguage: en\ncategories: [\"Category:All articles lacking reliable references\", \"Category:Articles lacking reliable references from October 2016\", \"Category:Articles with short description\", \"Category:Command shells\", \"Category:Free mathematics software\", \"Category:Free software programmed in Python\", \"Category:Notebook interface\", \"Category:Python (programming language) development tools\", \"Category:Short description matches Wikidata\", \"Category:Software using the BSD license\", \"Category:Use dmy dates from August 2015\"]\nreferences: 0\nlast_modified: 2024-12-19T14:03:40Z\n---\n\n# IPython\n\n## Summary\n\nIPython (Interactive Python) is a command shell for interactive computing in multiple programming languages, originally developed for the Python programming language, that offers introspection, rich media, shell syntax, tab completion, and history. IPython provides the following features:\n\nInteractive shells (terminal and Qt-based).\nA browser-based notebook interface with support for code, text, mathematical expressions, inline plots and other media.\nSupport for interactive data visualization an\n\n## Full Content\n\nIPython (Interactive Python) is a command shell for interactive computing in multiple programming languages, originally developed for the Python programming language, that offers introspection, rich media, shell syntax, tab completion, and history. IPython provides the following features:\n\nInteractive shells (terminal and Qt-based).\nA browser-based notebook interface with support for code, text, mathematical expressions, inline plots and other media.\nSupport for interactive data visualization and use of GUI toolkits.\nFlexible, embeddable interpreters to load into one's own projects.\nTools for parallel computing.\nIPython is a NumFOCUS fiscally sponsored project.\n\nParallel computing\nIPython is based on an architecture that provides parallel and distributed computing. IPython enables parallel applications to be developed, executed, debugged and monitored interactively, hence the I (Interactive) in IPython. This architecture abstracts out parallelism, enabling IPython to support many different styles of parallelism including:\n\nSingle program, multiple data (SPMD) parallelism\nMultiple program, multiple data (MPMD) parallelism\nMessage passing using MPI\nTask parallelism\nData parallelism\nCombinations of these approaches\nCustom user defined approaches\nWith the release of IPython 4.0, the parallel computing capabilities were made optional and released under the ipyparallel python package. And most of the capabilities of ipyparallel are now covered by more mature libraries like Dask.\nIPython frequently draws from SciPy stack libraries like NumPy and SciPy, often installed alongside one of many Scientific Python distributions. IPython provides integration with some libraries of the SciPy stack, notably matplotlib, producing inline graphs when used with the Jupyter notebook. Python libraries can implement IPython specific hooks to customize rich object display. SymPy for example implements rendering of mathematical expressions as rendered LaTeX when used within IPython context, and Pandas dataframe use an HTML representation.\n\nOther features\nIPython allows non-blocking interaction with Tkinter, PyGTK, PyQt/PySide and wxPython (the standard Python shell only allows interaction with Tkinter). IPython can interactively manage parallel computing clusters using asynchronous status callbacks and/or MPI. IPython can also be used as a system shell replacement. Its default behavior is largely similar to Unix shells, but it allows customization and the flexibility of executing code in a live Python environment.\n\nEnd of Python 2 support\nIPython 5.x (Long Time Support) series is the last version of IPython to support Python 2. The IPython project pledged to not support Python 2 beyond 2020 by being one of the first projects to join the Python 3 Statement, the 6.x series is only compatible with Python 3 and above. It is still possible though to run an IPython kernel and a Jupyter Notebook server on different Python versions allowing users to still access Python 2 on newer version of Jupyter.\n\nProject Jupyter\nIn 2014, IPython creator Fernando Pérez announced a spin-off project from IPython called Project Jupyter. IPython continued to exist as a Python shell and kernel for Jupyter, but the notebook interface and other language-agnostic parts of IPython were moved under the Jupyter name. Jupyter is language agnostic and its name is a reference to core programming languages supported by Jupyter, which are Julia, Python, and R.\nJupyter Notebook (formerly IPython Notebook) is a web-based interactive computational environment for creating, executing, and visualizing Jupyter notebooks. It is similar to the notebook interface of other programs such as Maple, Mathematica, and SageMath, a computational interface style that originated with Mathematica in the 1980s. It supports execution environments (aka kernels) in dozens of languages. By default Jupyter Notebook ships with the IPython kernel, but there are over 100 Jupyter kernels  as of May 2018.\n\nIn the media\nIPython has been mentioned in the popular computing press and other popular media, and it has a presence at scientific conferences. For scientific and engineering work, it is often presented as a companion tool to matplotlib.\n\nGrants and awards\nBeginning 1 January 2013, the Alfred P. Sloan Foundation announced that it would support IPython development for two years.\nOn 23 March 2013, Fernando Perez was awarded the Free Software Foundation Advancement of Free Software award for IPython.\nIn August 2013, Microsoft made a donation of $100,000 to sponsor IPython's continued development.\nIn January 2014, it won the Jolt Productivity Award from Dr. Dobb's in the category of coding tools. In July 2015, the project won a funding of $6 million from Gordon and Betty Moore Foundation, Alfred P. Sloan Foundation and  Leona M. and Harry B. Helmsley Charitable Trust.\nIn May 2018, it was awarded the 2017 ACM Software System Award. It is the largest team to have won the award.\n\nSee also\nPython (programming language)\nElectronic lab notebook\nSageMath\nProject Jupyter\n\nReferences\nExternal links\nOfficial website \nInline graphs\nProject Jupyter\n",
  "categories": [
    "Category:All articles lacking reliable references",
    "Category:Articles lacking reliable references from October 2016",
    "Category:Articles with short description",
    "Category:Command shells",
    "Category:Free mathematics software",
    "Category:Free software programmed in Python",
    "Category:Notebook interface",
    "Category:Python (programming language) development tools",
    "Category:Short description matches Wikidata",
    "Category:Software using the BSD license",
    "Category:Use dmy dates from August 2015"
  ],
  "archived_date": "20241220_214830",
  "source_url": "https://en.wikipedia.org/wiki/IPython"
}