{
  "title": "Lazy initialization",
  "summary": "In computer programming, lazy initialization is the tactic of delaying the creation of an object, the calculation of a value, or some other expensive process until the first time it is needed. It is a kind of lazy evaluation that refers specifically to the instantiation of objects or other resources.\nThis is typically accomplished by augmenting an accessor method (or property getter) to check whether a private member, acting as a cache, has already been initialized.  If it has, it is returned st",
  "content": "---\ntitle: Lazy initialization\nurl: https://en.wikipedia.org/wiki/Lazy_initialization\nlanguage: en\ncategories: [\"Category:Articles with example C++ code\", \"Category:Articles with example C Sharp code\", \"Category:Articles with example C code\", \"Category:Articles with example JavaScript code\", \"Category:Articles with example Java code\", \"Category:Articles with example PHP code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with example Ruby code\", \"Category:Articles with example Smalltalk code\", \"Category:Programming language comparisons\", \"Category:Software design patterns\"]\nreferences: 0\nlast_modified: 2024-12-15T10:08:27Z\n---\n\n# Lazy initialization\n\n## Summary\n\nIn computer programming, lazy initialization is the tactic of delaying the creation of an object, the calculation of a value, or some other expensive process until the first time it is needed. It is a kind of lazy evaluation that refers specifically to the instantiation of objects or other resources.\nThis is typically accomplished by augmenting an accessor method (or property getter) to check whether a private member, acting as a cache, has already been initialized.  If it has, it is returned st\n\n## Full Content\n\nIn computer programming, lazy initialization is the tactic of delaying the creation of an object, the calculation of a value, or some other expensive process until the first time it is needed. It is a kind of lazy evaluation that refers specifically to the instantiation of objects or other resources.\nThis is typically accomplished by augmenting an accessor method (or property getter) to check whether a private member, acting as a cache, has already been initialized.  If it has, it is returned straight away. If not, a new instance is created, placed into the member variable, and returned to the caller just-in-time for its first use. \nIf objects have properties that are rarely used, this can improve startup speed. Mean average program performance may be slightly worse in terms of memory (for the condition variables) and execution cycles (to check them), but the impact of object instantiation is spread in time (\"amortized\") rather than concentrated in the startup phase of a system, and thus median response times can be greatly improved.\nIn multithreaded code, access to lazy-initialized objects/state must be synchronized to guard against race conditions.\n\nThe \"lazy factory\"\nIn a software design pattern view, lazy initialization is often used together with a factory method pattern. This combines three ideas:\n\nUsing a factory method to create instances of a class (factory method pattern)\nStoring the instances in a map, and returning the same instance to each request for an instance with same parameters (multiton pattern)\nUsing lazy initialization to instantiate the object the first time it is requested (lazy initialization pattern)\n\nExamples\nActionScript 3\nThe following is an example of a class with lazy initialization implemented in ActionScript:\n\nBasic use:\n\nC\nIn C, lazy evaluation would normally be implemented inside one function, or one source file, using static variables.\nIn a function:\n\nUsing one source file instead allows the state to be shared between multiple functions, while still hiding it from non-related functions.\nfruit.h:\n\nfruit.c:\n\nmain.c:\n\nC#\nIn .NET Framework 4.0 Microsoft has included a Lazy class that can be used to do lazy loading.\nBelow is some dummy code that does lazy loading of Class Fruit\n\nHere is a dummy example in C#.\nThe Fruit class itself doesn't do anything here, The class variable _typesDictionary is a Dictionary/Map used to store Fruit instances by typeName.\n\nA fairly straightforward 'fill-in-the-blanks' example of a Lazy Initialization design pattern, except that this uses an enumeration for the type\n\nC++\nThis example is in C++.\n\nCrystal\nOutput:\n\nNumber of instances made: 1\nBanana\n\nNumber of instances made: 2\nBanana\nApple\n\nNumber of instances made: 2\nBanana\nApple\n\nHaxe\nThis example is in Haxe.\n\nUsage\n\nJava\nThis example is in Java.\n\nOutput\n\nNumber of instances made = 1\nBanana\n\nNumber of instances made = 2\nBanana\nApple\n\nNumber of instances made = 2\nBanana\nApple\n\nJavaScript\nThis example is in JavaScript.\n\nOutput\n\nNumber of instances made: 1\nApple\n\nNumber of instances made: 2\nApple\nBanana\n\nNumber of instances made: 2\nApple\nBanana\n\nPHP\nHere is an example of lazy initialization in PHP 7.4:\n\nPython\nThis example is in Python.\n\nRuby\nThis example is in Ruby, of lazily initializing an authentication token from a remote service like Google. The way that @auth_token is cached is also an example of memoization.\n\nScala\nScala has built-in support for lazy variable initiation.\n\nSmalltalk\nThis example is in Smalltalk, of a typical accessor method to return the value of a variable using lazy initialization.\n\nThe 'non-lazy' alternative is to use an initialization method that is run when the object is created and then use a simpler accessor method to fetch the value.\n\nNote that lazy initialization can also be used in non-object-oriented languages.\n\nTheoretical computer science\nIn the field of theoretical computer science, lazy initialization (also called a lazy array) is a technique to design data structures that can work with memory that does not need to be initialized. Specifically, assume that we have access to a table T of n uninitialized memory cells (numbered from 1 to n), and want to assign m cells of this array, e.g., we want to assign T[ki] := vi for pairs (k1, v1), ..., (km, vm) with all ki being different. The lazy initialization technique allows us to do this in just O(m) operations, rather than spending O(m+n) operations to first initialize all array cells. The technique is simply to allocate a table V storing the pairs (ki, vi) in some arbitrary order, and to write for each i in the cell T[ki] the position in V where key ki is stored, leaving the other cells of T uninitialized. This can be used to handle queries in the following fashion: when we look up cell T[k] for some k, we can check if k is in the range {1, ..., m}: if it is not, then T[k] is uninitialized. Otherwise, we check V[T[k]], and verify that the first component of this pair is equal to k. If it is not, then T[k] is uninitialized (and just happened by accident to fall in the range {1, ..., m}). Otherwise, we know that T[k] is indeed one of the initialized cells, and the corresponding value is the second component of the pair.\n\nSee also\nDouble-checked locking\nLazy loading\nProxy pattern\nSingleton pattern\n\nReferences\nExternal links\nArticle \"Java Tip 67: Lazy instantiation - Balancing performance and resource usage\" by Philip Bishop and Nigel Warren\nJava code examples\nUse Lazy Initialization to Conserve Resources\nDescription from the Portland Pattern Repository\nLazy Initialization of Application Server Services\nLazy Inheritance in JavaScript\nLazy Inheritance in C#\n",
  "categories": [
    "Category:Articles with example C++ code",
    "Category:Articles with example C Sharp code",
    "Category:Articles with example C code",
    "Category:Articles with example JavaScript code",
    "Category:Articles with example Java code",
    "Category:Articles with example PHP code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with example Ruby code",
    "Category:Articles with example Smalltalk code",
    "Category:Programming language comparisons",
    "Category:Software design patterns"
  ],
  "archived_date": "20241220_214811",
  "source_url": "https://en.wikipedia.org/wiki/Lazy_initialization"
}