{
  "title": "Lorenz system",
  "summary": "The Lorenz system is a system of ordinary differential equations first studied by mathematician and meteorologist Edward Lorenz. It is notable for having chaotic solutions for certain parameter values and initial conditions. In particular, the Lorenz attractor is a set of chaotic solutions of the Lorenz system. The term \"butterfly effect\" in popular media may stem from the real-world implications of the Lorenz attractor, namely that tiny changes in initial conditions evolve to completely differe",
  "content": "---\ntitle: Lorenz system\nurl: https://en.wikipedia.org/wiki/Lorenz_system\nlanguage: en\ncategories: [\"Category:All articles that are too technical\", \"Category:All articles with unsourced statements\", \"Category:Articles containing video clips\", \"Category:Articles with example Julia code\", \"Category:Articles with example MATLAB/Octave code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with short description\", \"Category:Articles with unsourced statements from June 2017\", \"Category:Chaotic maps\", \"Category:Commons category link is on Wikidata\", \"Category:Short description is different from Wikidata\", \"Category:Webarchive template wayback links\", \"Category:Wikipedia articles that are too technical from December 2023\"]\nreferences: 0\nlast_modified: 2024-12-19T13:56:43Z\n---\n\n# Lorenz system\n\n## Summary\n\nThe Lorenz system is a system of ordinary differential equations first studied by mathematician and meteorologist Edward Lorenz. It is notable for having chaotic solutions for certain parameter values and initial conditions. In particular, the Lorenz attractor is a set of chaotic solutions of the Lorenz system. The term \"butterfly effect\" in popular media may stem from the real-world implications of the Lorenz attractor, namely that tiny changes in initial conditions evolve to completely differe\n\n## Full Content\n\nThe Lorenz system is a system of ordinary differential equations first studied by mathematician and meteorologist Edward Lorenz. It is notable for having chaotic solutions for certain parameter values and initial conditions. In particular, the Lorenz attractor is a set of chaotic solutions of the Lorenz system. The term \"butterfly effect\" in popular media may stem from the real-world implications of the Lorenz attractor, namely that tiny changes in initial conditions evolve to completely different trajectories. This underscores that chaotic systems can be completely deterministic and yet still be inherently impractical or even impossible to predict over longer periods of time. For example, even the small flap of a butterfly's wings could set the earth's atmosphere on a vastly different trajectory, in which for example a hurricane occurs where it otherwise would have not (see Saddle points). The shape of the Lorenz attractor itself, when plotted in phase space, may also be seen to resemble a butterfly.\n\nOverview\nIn 1963, Edward Lorenz, with the help of Ellen Fetter who was responsible for the numerical simulations and figures, and Margaret Hamilton who helped in the initial, numerical computations leading up to the findings of the Lorenz model,  developed a simplified mathematical model for atmospheric convection. The model is a system of three ordinary differential equations now known as the Lorenz equations:\n\n  \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      x\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                σ\n                (\n                y\n                −\n                x\n                )\n                ,\n              \n            \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      y\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                x\n                (\n                ρ\n                −\n                z\n                )\n                −\n                y\n                ,\n              \n            \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      z\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                x\n                y\n                −\n                β\n                z\n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}{\\frac {\\mathrm {d} x}{\\mathrm {d} t}}&=\\sigma (y-x),\\\\[6pt]{\\frac {\\mathrm {d} y}{\\mathrm {d} t}}&=x(\\rho -z)-y,\\\\[6pt]{\\frac {\\mathrm {d} z}{\\mathrm {d} t}}&=xy-\\beta z.\\end{aligned}}}\n  \n\nThe equations relate the properties of a two-dimensional fluid layer uniformly warmed from below and cooled from above. In particular, the equations describe the rate of change of three quantities with respect to time: x is proportional to the rate of convection, y to the horizontal temperature variation, and z to the vertical temperature variation. The constants σ, ρ, and β are system parameters proportional to the Prandtl number, Rayleigh number, and certain physical dimensions of the layer itself.\nThe Lorenz equations can arise in simplified models for lasers, dynamos, thermosyphons, brushless DC motors, electric circuits, chemical reactions and forward osmosis. Interestingly, the same Lorenz equations were also derived in 1963 by Sauermann and Haken  for a single-mode laser. In 1975, Haken realized  that their equations derived in 1963 were mathematically equivalent to the original Lorenz equations. Haken's paper  thus started a new field called laser chaos or optical chaos. The Lorenz equations are often called Lorenz-Haken equations in optical literature. Later on, it was also shown the complex version of Lorenz equations also had laser equivalent ones.     \nThe Lorenz equations are also the governing equations in Fourier space for the Malkus waterwheel. The Malkus waterwheel exhibits chaotic motion where instead of spinning in one direction at a constant speed, its rotation will speed up, slow down, stop, change directions, and oscillate back and forth between combinations of such behaviors in an unpredictable manner.\nFrom a technical standpoint, the Lorenz system is nonlinear, aperiodic, three-dimensional and deterministic. The Lorenz equations have been the subject of hundreds of research articles, and at least one book-length study.\n\nAnalysis\nOne normally assumes that the parameters σ, ρ, and β are positive. Lorenz used the values σ = 10, β = ⁠8/3⁠ and ρ = 28. The system exhibits chaotic behavior for these (and nearby) values.\nIf ρ < 1 then there is only one equilibrium point, which is at the origin. This point corresponds to no convection. All orbits converge to the origin, which is a global attractor, when ρ < 1.\nA pitchfork bifurcation occurs at ρ = 1, and for ρ > 1 two additional critical points appear at\n\n  \n    \n      \n        \n          (\n          \n            \n              \n                β\n                (\n                ρ\n                −\n                1\n                )\n              \n            \n            ,\n            \n              \n                β\n                (\n                ρ\n                −\n                1\n                )\n              \n            \n            ,\n            ρ\n            −\n            1\n          \n          )\n        \n        \n        \n          and\n        \n        \n        \n          (\n          \n            −\n            \n              \n                β\n                (\n                ρ\n                −\n                1\n                )\n              \n            \n            ,\n            −\n            \n              \n                β\n                (\n                ρ\n                −\n                1\n                )\n              \n            \n            ,\n            ρ\n            −\n            1\n          \n          )\n        \n        .\n      \n    \n    {\\displaystyle \\left({\\sqrt {\\beta (\\rho -1)}},{\\sqrt {\\beta (\\rho -1)}},\\rho -1\\right)\\quad {\\text{and}}\\quad \\left(-{\\sqrt {\\beta (\\rho -1)}},-{\\sqrt {\\beta (\\rho -1)}},\\rho -1\\right).}\n  \n \nThese correspond to steady convection. This pair of equilibrium points is stable only if \n\n  \n    \n      \n        ρ\n        <\n        σ\n        \n          \n            \n              σ\n              +\n              β\n              +\n              3\n            \n            \n              σ\n              −\n              β\n              −\n              1\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle \\rho <\\sigma {\\frac {\\sigma +\\beta +3}{\\sigma -\\beta -1}},}\n  \n\nwhich can hold only for positive ρ if σ > β + 1. At the critical value, both equilibrium points lose stability through a subcritical Hopf bifurcation.\nWhen ρ = 28, σ = 10, and β = ⁠8/3⁠, the Lorenz system has chaotic solutions (but not all solutions are chaotic). Almost all initial points will tend to an invariant set – the Lorenz attractor – a strange attractor, a fractal, and a self-excited attractor with respect to all three equilibria. Its Hausdorff dimension is estimated from above by the Lyapunov dimension (Kaplan-Yorke dimension) as 2.06±0.01, and the correlation dimension is estimated to be 2.05±0.01. The exact Lyapunov dimension formula of the global attractor can be found analytically under classical restrictions on the parameters:\n\n  \n    \n      \n        3\n        −\n        \n          \n            \n              2\n              (\n              σ\n              +\n              β\n              +\n              1\n              )\n            \n            \n              σ\n              +\n              1\n              +\n              \n                \n                  \n                    \n                      (\n                      \n                        σ\n                        −\n                        1\n                      \n                      )\n                    \n                    \n                      2\n                    \n                  \n                  +\n                  4\n                  σ\n                  ρ\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle 3-{\\frac {2(\\sigma +\\beta +1)}{\\sigma +1+{\\sqrt {\\left(\\sigma -1\\right)^{2}+4\\sigma \\rho }}}}}\n  \n\nThe Lorenz attractor is difficult to analyze, but the action of the differential equation on the attractor is described by a fairly simple geometric model. Proving that this is indeed the case is the fourteenth problem on the list of Smale's problems. This problem was the first one to be resolved, by Warwick Tucker in 2002.\nFor other values of ρ, the system displays knotted periodic orbits. For example, with ρ = 99.96 it becomes a T(3,2) torus knot.\n\nConnection to tent map\nIn Figure 4 of his paper, Lorenz plotted the relative maximum value in the z direction achieved by the system against the previous relative maximum in the z direction. This procedure later became known as a Lorenz map (not to be confused with a Poincaré plot, which plots the intersections of a trajectory with a prescribed surface). The resulting plot has a shape very similar to the tent map. Lorenz also found that when the maximum z value is above a certain cut-off, the system will switch to the next lobe. Combining this with the chaos known to be exhibited by the tent map, he showed that the system switches between the two lobes chaotically.\n\nA Generalized Lorenz System\nOver the past several years, a series of papers regarding high-dimensional Lorenz models have yielded a generalized Lorenz model, which can be simplified into the classical Lorenz model  for three state variables or the following five-dimensional Lorenz model for five state variables:\n\n  \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      x\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                σ\n                (\n                y\n                −\n                x\n                )\n                ,\n              \n            \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      y\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                x\n                (\n                ρ\n                −\n                z\n                )\n                −\n                y\n                ,\n              \n            \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      z\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                x\n                y\n                −\n                x\n                \n                  y\n                  \n                    1\n                  \n                \n                −\n                β\n                z\n                ,\n              \n            \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      \n                        y\n                        \n                          1\n                        \n                      \n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                x\n                z\n                −\n                2\n                x\n                \n                  z\n                  \n                    1\n                  \n                \n                −\n                \n                  d\n                  \n                    0\n                  \n                \n                \n                  y\n                  \n                    1\n                  \n                \n                ,\n              \n            \n            \n              \n                \n                  \n                    \n                      \n                        d\n                      \n                      \n                        z\n                        \n                          1\n                        \n                      \n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n              \n                \n                =\n                2\n                x\n                \n                  y\n                  \n                    1\n                  \n                \n                −\n                4\n                β\n                \n                  z\n                  \n                    1\n                  \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}{\\frac {\\mathrm {d} x}{\\mathrm {d} t}}&=\\sigma (y-x),\\\\[6pt]{\\frac {\\mathrm {d} y}{\\mathrm {d} t}}&=x(\\rho -z)-y,\\\\[6pt]{\\frac {\\mathrm {d} z}{\\mathrm {d} t}}&=xy-xy_{1}-\\beta z,\\\\[6pt]{\\frac {\\mathrm {d} y_{1}}{\\mathrm {d} t}}&=xz-2xz_{1}-d_{0}y_{1},\\\\[6pt]{\\frac {\\mathrm {d} z_{1}}{\\mathrm {d} t}}&=2xy_{1}-4\\beta z_{1}.\\end{aligned}}}\n  \n\nA choice of the parameter \n  \n    \n      \n        \n          d\n          \n            0\n          \n        \n        =\n        \n          \n            \n              19\n              3\n            \n          \n        \n      \n    \n    {\\textstyle d_{0}={\\dfrac {19}{3}}}\n  \n has been applied to be consistent with the choice of the other parameters. See details in.\n\nSimulations\nJulia simulation\nMaple simulation\nMaxima simulation\nMATLAB simulation\nMathematica simulation\nStandard way:\n\nLess verbose:\n\nPython simulation\nR simulation\nApplications\nModel for atmospheric convection\nAs shown in Lorenz's original paper, the Lorenz system is a reduced version of a larger system studied earlier by Barry Saltzman. The Lorenz equations are derived from the Oberbeck–Boussinesq approximation to the equations describing fluid circulation in a shallow layer of fluid, heated uniformly from below and cooled uniformly from above. This fluid circulation is known as Rayleigh–Bénard convection. The fluid is assumed to circulate in two dimensions (vertical and horizontal) with periodic rectangular boundary conditions.\nThe partial differential equations modeling the system's stream function and temperature are subjected to a spectral Galerkin approximation: the hydrodynamic fields are expanded in Fourier series, which are then severely truncated to a single term for the stream function and two terms for the temperature. This reduces the model equations to a set of three coupled, nonlinear ordinary differential equations. A detailed derivation may be found, for example, in nonlinear dynamics texts from Hilborn (2000), Appendix C;  Bergé, Pomeau & Vidal (1984), Appendix D; or Shen (2016), Supplementary Materials.\n\nModel for the nature of chaos and order in the atmosphere\nThe scientific community accepts that the chaotic features found in low-dimensional Lorenz models could represent features of the Earth's atmosphere (), yielding the statement of “weather is chaotic.” By comparison, based on the concept of attractor coexistence within the generalized Lorenz model and the original Lorenz model (), Shen and his co-authors  proposed a revised view that “weather possesses both chaos and order with distinct predictability”. The revised view,  which is a build-up of the conventional view, is used to suggest that “the chaotic and regular features found in theoretical Lorenz models could better represent features of the Earth's atmosphere”.\n\nResolution of Smale's 14th problem\nSmale's 14th problem says, 'Do the properties of the Lorenz attractor exhibit that of a strange attractor?'. The problem was answered affirmatively by Warwick Tucker in 2002. To prove this result, Tucker used rigorous numerics methods like interval arithmetic and normal forms. First, Tucker defined a cross section \n  \n    \n      \n        Σ\n        ⊂\n        {\n        \n          x\n          \n            3\n          \n        \n        =\n        r\n        −\n        1\n        }\n      \n    \n    {\\displaystyle \\Sigma \\subset \\{x_{3}=r-1\\}}\n  \n that is cut transversely by the flow trajectories. From this, one can define the first-return map \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n, which assigns to each \n  \n    \n      \n        x\n        ∈\n        Σ\n      \n    \n    {\\displaystyle x\\in \\Sigma }\n  \n the point \n  \n    \n      \n        P\n        (\n        x\n        )\n      \n    \n    {\\displaystyle P(x)}\n  \n where the trajectory of \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n first intersects \n  \n    \n      \n        Σ\n      \n    \n    {\\displaystyle \\Sigma }\n  \n.\nThen the proof is split in three main points that are proved and imply the existence of a strange attractor. The three points are:\n\nThere exists a region \n  \n    \n      \n        N\n        ⊂\n        Σ\n      \n    \n    {\\displaystyle N\\subset \\Sigma }\n  \n invariant under the first-return map, meaning \n  \n    \n      \n        P\n        (\n        N\n        )\n        ⊂\n        N\n      \n    \n    {\\displaystyle P(N)\\subset N}\n  \n.\nThe return map admits a forward invariant cone field.\nVectors inside this invariant cone field are uniformly expanded by the derivative \n  \n    \n      \n        D\n        P\n      \n    \n    {\\displaystyle DP}\n  \n of the return map.\nTo prove the first point, we notice that the cross section \n  \n    \n      \n        Σ\n      \n    \n    {\\displaystyle \\Sigma }\n  \n is cut by two arcs formed by \n  \n    \n      \n        P\n        (\n        Σ\n        )\n      \n    \n    {\\displaystyle P(\\Sigma )}\n  \n. Tucker covers the location of these two arcs by small rectangles \n  \n    \n      \n        \n          R\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle R_{i}}\n  \n, the union of these rectangles gives \n  \n    \n      \n        N\n      \n    \n    {\\displaystyle N}\n  \n. Now, the goal is to prove that for all points in \n  \n    \n      \n        N\n      \n    \n    {\\displaystyle N}\n  \n, the flow will bring back the points in \n  \n    \n      \n        Σ\n      \n    \n    {\\displaystyle \\Sigma }\n  \n, in \n  \n    \n      \n        N\n      \n    \n    {\\displaystyle N}\n  \n. To do that, we take a plan \n  \n    \n      \n        \n          Σ\n          ′\n        \n      \n    \n    {\\displaystyle \\Sigma '}\n  \n below \n  \n    \n      \n        Σ\n      \n    \n    {\\displaystyle \\Sigma }\n  \n at a distance \n  \n    \n      \n        h\n      \n    \n    {\\displaystyle h}\n  \n small, then by taking the center \n  \n    \n      \n        \n          c\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle c_{i}}\n  \n of \n  \n    \n      \n        \n          R\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle R_{i}}\n  \n and using Euler integration method, one can estimate where the flow will bring \n  \n    \n      \n        \n          c\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle c_{i}}\n  \n in \n  \n    \n      \n        \n          Σ\n          ′\n        \n      \n    \n    {\\displaystyle \\Sigma '}\n  \n which gives us a new point \n  \n    \n      \n        \n          c\n          \n            i\n          \n          ′\n        \n      \n    \n    {\\displaystyle c_{i}'}\n  \n. Then, one can estimate where the points in \n  \n    \n      \n        Σ\n      \n    \n    {\\displaystyle \\Sigma }\n  \n will be mapped in \n  \n    \n      \n        \n          Σ\n          ′\n        \n      \n    \n    {\\displaystyle \\Sigma '}\n  \n using Taylor expansion, this gives us a new rectangle \n  \n    \n      \n        \n          R\n          \n            i\n          \n          ′\n        \n      \n    \n    {\\displaystyle R_{i}'}\n  \n centered on \n  \n    \n      \n        \n          c\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle c_{i}}\n  \n. Thus we know that all points in \n  \n    \n      \n        \n          R\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle R_{i}}\n  \n will be mapped in \n  \n    \n      \n        \n          R\n          \n            i\n          \n          ′\n        \n      \n    \n    {\\displaystyle R_{i}'}\n  \n. The goal is to do this method recursively until the flow comes back to \n  \n    \n      \n        Σ\n      \n    \n    {\\displaystyle \\Sigma }\n  \n and we obtain a rectangle \n  \n    \n      \n        R\n        \n          f\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle Rf_{i}}\n  \n in \n  \n    \n      \n        Σ\n      \n    \n    {\\displaystyle \\Sigma }\n  \n such that we know that \n  \n    \n      \n        P\n        (\n        \n          R\n          \n            i\n          \n        \n        )\n        ⊂\n        R\n        \n          f\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle P(R_{i})\\subset Rf_{i}}\n  \n. The problem is that our estimation may become imprecise after several iterations, thus what Tucker does is to split \n  \n    \n      \n        \n          R\n          \n            i\n          \n          ′\n        \n      \n    \n    {\\displaystyle R_{i}'}\n  \n into smaller rectangles \n  \n    \n      \n        \n          R\n          \n            i\n            ,\n            j\n          \n        \n      \n    \n    {\\displaystyle R_{i,j}}\n  \n and then apply the process recursively.\nAnother problem is that as we are applying this algorithm, the flow becomes more 'horizontal', leading to a dramatic increase in imprecision. To prevent this, the algorithm changes the orientation of the cross sections, becoming either horizontal or vertical.\n\nGallery\nSee also\nEden's conjecture on the Lyapunov dimension\nLorenz 96 model\nList of chaotic maps\nTakens' theorem\n\nNotes\nReferences\nBergé, Pierre; Pomeau, Yves; Vidal, Christian (1984). Order within Chaos: Towards a Deterministic Approach to Turbulence. New York: John Wiley & Sons. ISBN 978-0-471-84967-4.\nCuomo, Kevin M.; Oppenheim, Alan V. (1993). \"Circuit implementation of synchronized chaos with applications to communications\". Physical Review Letters. 71 (1): 65–68. Bibcode:1993PhRvL..71...65C. doi:10.1103/PhysRevLett.71.65. ISSN 0031-9007. PMID 10054374.\nGorman, M.; Widmann, P.J.; Robbins, K.A. (1986). \"Nonlinear dynamics of a convection loop: A quantitative comparison of experiment with theory\". Physica D. 19 (2): 255–267. Bibcode:1986PhyD...19..255G. doi:10.1016/0167-2789(86)90022-9.\nGrassberger, P.; Procaccia, I. (1983). \"Measuring the strangeness of strange attractors\". Physica D. 9 (1–2): 189–208. Bibcode:1983PhyD....9..189G. doi:10.1016/0167-2789(83)90298-1.\nHaken, H. (1975). \"Analogy between higher instabilities in fluids and lasers\". Physics Letters A. 53 (1): 77–78. Bibcode:1975PhLA...53...77H. doi:10.1016/0375-9601(75)90353-9.\nSauermann, H.; Haken, H. (1963). \"Nonlinear Interaction of Laser Modes\". Z. Phys. 173: 261–275.\nNing, C.Z.; Haken, H. (1990). \"Detuned lasers and the complex Lorenz equations: Subcritical and supercritical Hopf bifurcations\". Phys.Rev. A. 41: 3826–3837.\nHemati, N. (1994). \"Strange attractors in brushless DC motors\". IEEE Transactions on Circuits and Systems I: Fundamental Theory and Applications. 41 (1): 40–45. doi:10.1109/81.260218. ISSN 1057-7122.\nHilborn, Robert C. (2000). Chaos and Nonlinear Dynamics: An Introduction for Scientists and Engineers (second ed.). Oxford University Press. ISBN 978-0-19-850723-9.\nHirsch, Morris W.; Smale, Stephen; Devaney, Robert (2003). Differential Equations, Dynamical Systems, & An Introduction to Chaos (Second ed.). Boston, MA: Academic Press. ISBN 978-0-12-349703-1.\nKnobloch, Edgar (1981). \"Chaos in the segmented disc dynamo\". Physics Letters A. 82 (9): 439–440. Bibcode:1981PhLA...82..439K. doi:10.1016/0375-9601(81)90274-7.\nKolář, Miroslav; Gumbs, Godfrey (1992). \"Theory for the experimental observation of chaos in a rotating waterwheel\". Physical Review A. 45 (2): 626–637. Bibcode:1992PhRvA..45..626K. doi:10.1103/PhysRevA.45.626. PMID 9907027.\nLeonov, G.A.; Kuznetsov, N.V.; Korzhemanova, N.A.; Kusakin, D.V. (2016). \"Lyapunov dimension formula for the global attractor of the Lorenz system\". Communications in Nonlinear Science and Numerical Simulation. 41: 84–103. arXiv:1508.07498. Bibcode:2016CNSNS..41...84L. doi:10.1016/j.cnsns.2016.04.032. S2CID 119614076.\nLorenz, Edward Norton (1963). \"Deterministic nonperiodic flow\". Journal of the Atmospheric Sciences. 20 (2): 130–141. Bibcode:1963JAtS...20..130L. doi:10.1175/1520-0469(1963)020<0130:DNF>2.0.CO;2.\nMishra, Aashwin; Sanghi, Sanjeev (2006). \"A study of the asymmetric Malkus waterwheel: The biased Lorenz equations\". Chaos: An Interdisciplinary Journal of Nonlinear Science. 16 (1): 013114. Bibcode:2006Chaos..16a3114M. doi:10.1063/1.2154792. PMID 16599745.\nPchelintsev, A.N. (2014). \"Numerical and Physical Modeling of the Dynamics of the Lorenz System\". Numerical Analysis and Applications. 7 (2): 159–167. doi:10.1134/S1995423914020098. S2CID 123023929.\nPoland, Douglas (1993). \"Cooperative catalysis and chemical chaos: a chemical model for the Lorenz equations\". Physica D. 65 (1): 86–99. Bibcode:1993PhyD...65...86P. doi:10.1016/0167-2789(93)90006-M.\nSaltzman, Barry (1962). \"Finite Amplitude Free Convection as an Initial Value Problem—I\". Journal of the Atmospheric Sciences. 19 (4): 329–341. Bibcode:1962JAtS...19..329S. doi:10.1175/1520-0469(1962)019<0329:FAFCAA>2.0.CO;2.\nShen, B.-W. (2015-12-21). \"Nonlinear feedback in a six-dimensional Lorenz model: impact of an additional heating term\". Nonlinear Processes in Geophysics. 22 (6): 749–764. doi:10.5194/npg-22-749-2015. ISSN 1607-7946.\nSparrow, Colin (1982). The Lorenz Equations: Bifurcations, Chaos, and Strange Attractors. Springer.\nTucker, Warwick (2002). \"A Rigorous ODE Solver and Smale's 14th Problem\" (PDF). Foundations of Computational Mathematics. 2 (1): 53–117. CiteSeerX 10.1.1.545.3996. doi:10.1007/s002080010018. S2CID 353254.\nTzenov, Stephan (2014). \"Strange Attractors Characterizing the Osmotic Instability\". arXiv:1406.0979v1 [physics.flu-dyn].\nViana, Marcelo (2000). \"What's new on Lorenz strange attractors?\". The Mathematical Intelligencer. 22 (3): 6–19. doi:10.1007/BF03025276. S2CID 121427433.\nLorenz, Edward N. (1960). \"The statistical prediction of solutions of dynamic equations\" (PDF). Symposium on Numerical Weather Prediction in Tokyo. Archived from the original (PDF) on 2019-05-23. Retrieved 2020-09-16.\n\nFurther reading\nG.A. Leonov & N.V. Kuznetsov (2015). \"On differences and similarities in the analysis of Lorenz, Chen, and Lu systems\". Applied Mathematics and Computation. 256: 334–343. arXiv:1409.8649. doi:10.1016/j.amc.2014.12.132.\nPchelintsev, A.N. (2022). \"On a high-precision method for studying attractors of dynamical systems and systems of explosive type\". Mathematics. 10 (8): 1207. arXiv:2206.08195. doi:10.3390/math10081207.\n\nExternal links\n\n\"Lorenz attractor\", Encyclopedia of Mathematics, EMS Press, 2001 [1994]\nWeisstein, Eric W. \"Lorenz attractor\". MathWorld.\nLorenz attractor by Rob Morris, Wolfram Demonstrations Project.\nLorenz equation Archived 2009-06-07 at the Wayback Machine on planetmath.org\nSynchronized Chaos and Private Communications, with Kevin Cuomo. The implementation of Lorenz attractor in an electronic circuit.\nLorenz attractor interactive animation (you need the Adobe Shockwave plugin)\n3D Attractors: Mac program to visualize and explore the Lorenz attractor in 3 dimensions\nLorenz Attractor implemented in analog electronic\nLorenz Attractor interactive animation (implemented in Ada with GTK+. Sources & executable)\nInteractive web based Lorenz Attractor made with Iodide\n",
  "categories": [
    "Category:All articles that are too technical",
    "Category:All articles with unsourced statements",
    "Category:Articles containing video clips",
    "Category:Articles with example Julia code",
    "Category:Articles with example MATLAB/Octave code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with short description",
    "Category:Articles with unsourced statements from June 2017",
    "Category:Chaotic maps",
    "Category:Commons category link is on Wikidata",
    "Category:Short description is different from Wikidata",
    "Category:Webarchive template wayback links",
    "Category:Wikipedia articles that are too technical from December 2023"
  ],
  "archived_date": "20241221_183015",
  "source_url": "https://en.wikipedia.org/wiki/Lorenz_system"
}