{
  "title": "Mark Pilgrim",
  "summary": "Mark Pilgrim is a software developer, writer, and advocate of free software.  He authored a popular blog, and has written several books, including Dive into Python, a guide to the Python programming language published under the GNU Free Documentation License. Formerly an accessibility architect in the IBM Emerging Technologies Group, he started working at Google in March 2007. In 2018, he moved to Brave.",
  "content": "---\ntitle: Mark Pilgrim\nurl: https://en.wikipedia.org/wiki/Mark_Pilgrim\nlanguage: en\ncategories: [\"Category:1972 births\", \"Category:All articles with failed verification\", \"Category:American bloggers\", \"Category:American computer programmers\", \"Category:Articles with failed verification from August 2023\", \"Category:Articles with failed verification from October 2021\", \"Category:Articles with hCards\", \"Category:Articles with short description\", \"Category:Free software people\", \"Category:Google employees\", \"Category:Living people\", \"Category:People from Apex, North Carolina\", \"Category:Place of birth missing (living people)\", \"Category:Python (programming language) people\", \"Category:Short description matches Wikidata\"]\nreferences: 0\nlast_modified: 2024-12-19T13:57:03Z\n---\n\n# Mark Pilgrim\n\n## Summary\n\nMark Pilgrim is a software developer, writer, and advocate of free software.  He authored a popular blog, and has written several books, including Dive into Python, a guide to the Python programming language published under the GNU Free Documentation License. Formerly an accessibility architect in the IBM Emerging Technologies Group, he started working at Google in March 2007. In 2018, he moved to Brave.\n\n## Full Content\n\nMark Pilgrim is a software developer, writer, and advocate of free software.  He authored a popular blog, and has written several books, including Dive into Python, a guide to the Python programming language published under the GNU Free Documentation License. Formerly an accessibility architect in the IBM Emerging Technologies Group, he started working at Google in March 2007. In 2018, he moved to Brave.\n\nEarly life\nIn 1992, while a sophomore at Cornell University and a part-time employee of Cornell Information Technologies (CIT), Pilgrim and another student, David Blumenthal, embedded a computer virus, MBDF, into three games. In February of the same year, Pilgrim, Blumenthal, Randall Johnson, and Eric Sooros uploaded the games from Cornell's Upson Hall computer lab to a public server at Stanford University. The four used false mainframe accounts created by Blumenthal, then also a CIT employee  The virus caused disruption to Macintosh computers internationally.\nThe origin of the virus was first identified by Claris employees in Wales on February 14, and was traced to Stanford, and then further to one of Cornell's mainframes. Cornell's access logs showed the uploads were made from several computers in the lab while Pilgrim was working there. Sooros was granted immunity from prosecution in return for his grand jury testimony against Pilgrim, Johnson, and Blumenthal. Pilgrim and Blumenthal were arrested and initially charged with computer tampering in the second degree, a Class A misdemeanor. The FBI investigated to determine if federal charges were warranted, though no additional charges were filed.  After facing disciplinary hearings, none of the four implicated continued as Cornell students.\nIn September 1992, Pilgrim and Blumenthal pled guilty and were later sentenced to 520 hours of community service, forfeiture of seized computer equipment, and payment of nearly $2,500 in restitution to Cornell and other affected parties. Johnson pled guilty to a lesser charge and was sentenced to 450 hours of community service.\n\nBooks and articles\nDive into Python\nPilgrim's book Dive into Python is a teach-by-example guide to the paradigms of programming in Python and modern software development techniques. It assumes some preexisting knowledge of programming, although not necessarily in Python. The first edition was published in 2004 (ISBN 1-59059-356-1), and a 2009 second edition (ISBN 9781430224150) covers Python 3. Both are available online as well as in print.\nMuch of the book consists of example programs with annotations and explanatory text, and it generally describes how to modify an example to serve new purposes. One early example program reads through a directory of MP3 files and lists the header information, such as artist, album, etc. Other topics covered include object oriented programming, documentation, unit testing, and accessing and parsing HTML and XML.\n\nOther works\nPilgrim, Mark (2005). Greasemonkey Hacks: Tips & Tools for Remixing the Web with Firefox. O'Reilly. ISBN 978-0596101657.\nDive into Accessibility, a free book on web accessibility, for web designers\nDive into Greasemonkey, a free book on Greasemonkey.\nDive into HTML 5, a free book on HTML5\nPilgrim, Mark (2010). HTML5: Up and Running. O'Reilly. ISBN 978-0596806026.\nPilgrim has also written a monthly column Dive into XML for O'Reilly's XML.com.\n\nOpen source work\nPilgrim contributed to a number of open source works including\n\nFeed Validator\nUniversal Feed Parser\nGoogle Doctype\nPilgrim was a vocal critic of Creative Commons licensing, which he believed needlessly cluttered the licensing environment of open source software.\n\n\"Disappearance\" from the Internet\nFrom 4 October 2011, Mark Pilgrim's various websites (diveintomark.org, Dive into HTML5, Dive into Accessibility, Dive into Greasemonkey, Dive into Python, etc.) returned HTTP status 410 Gone. He also deleted his Twitter, Reddit, Google+ and GitHub accounts. On 5 October 2011 Jason Scott tweeted that Pilgrim himself was \"alive/annoyed we called the police\". Commenting on the event, a writer for The Economist wrote that the concern showed for Pilgrim's well-being demonstrated that \"the internet, often mocked as impersonal and uncaring, can be quite the reverse.\"\nBoth Pilgrim's actions in October 2011 and why the lucky stiff's similar disappearance in August 2009 have been described as \"infosuicide\".\nThe incident was reminiscent of Pilgrim's 2004 hiatus from blogging, which lasted approximately 18 months. In 2004, rather than deleting his content, he posted a short entry entitled \"Every Exit\" in which he said, \"It’s time for me to find a new hobby. Preferably one that doesn’t involve angle brackets. Or computers. Or electricity.\"\n\nReferences\nExternal links\n\n\"Dive into Mark – Personal site\". Archived from the original on 2011-07-18. Retrieved 2011-09-30.\n\"Mark Pilgrim < Case Studies\". Creative Commons wiki. Creative Commons. 23 May 2012. Retrieved 22 February 2021.\nMark Pilgrim (October 21, 2009). Dive into Python 3. ISBN 978-1-4302-2415-0. Retrieved 2013-10-07.\nDive into Python - The complete text can be downloaded in a variety of formats\nDive into HTML5 - The full copy of Mark's online book\nMike Orr (January 5, 2005). \"Dive into Python by Mark Pilgrim\". Linux Journal. Retrieved 2010-01-06.\n",
  "categories": [
    "Category:1972 births",
    "Category:All articles with failed verification",
    "Category:American bloggers",
    "Category:American computer programmers",
    "Category:Articles with failed verification from August 2023",
    "Category:Articles with failed verification from October 2021",
    "Category:Articles with hCards",
    "Category:Articles with short description",
    "Category:Free software people",
    "Category:Google employees",
    "Category:Living people",
    "Category:People from Apex, North Carolina",
    "Category:Place of birth missing (living people)",
    "Category:Python (programming language) people",
    "Category:Short description matches Wikidata"
  ],
  "archived_date": "20241220_214752",
  "source_url": "https://en.wikipedia.org/wiki/Mark_Pilgrim"
}