{
  "title": "Maximum subarray problem",
  "summary": "In computer science, the maximum sum subarray problem, also known as the maximum segment sum problem, is the task of finding a contiguous subarray with the largest sum, within a given one-dimensional array A[1...n] of numbers. It can be solved in \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n  \n time and \n  \n    \n      \n        O\n        (\n        1\n        )\n      \n    \n    {\\displaystyle O(1)}\n  \n space.\nFormally, the task is to find indices \n  \n ",
  "content": "---\ntitle: Maximum subarray problem\nurl: https://en.wikipedia.org/wiki/Maximum_subarray_problem\nlanguage: en\ncategories: [\"Category:Articles with example Python (programming language) code\", \"Category:Articles with short description\", \"Category:Dynamic programming\", \"Category:Optimization algorithms and methods\", \"Category:Short description is different from Wikidata\"]\nreferences: 0\nlast_modified: 2024-12-19T14:02:54Z\n---\n\n# Maximum subarray problem\n\n## Summary\n\nIn computer science, the maximum sum subarray problem, also known as the maximum segment sum problem, is the task of finding a contiguous subarray with the largest sum, within a given one-dimensional array A[1...n] of numbers. It can be solved in \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n  \n time and \n  \n    \n      \n        O\n        (\n        1\n        )\n      \n    \n    {\\displaystyle O(1)}\n  \n space.\nFormally, the task is to find indices \n  \n \n\n## Full Content\n\nIn computer science, the maximum sum subarray problem, also known as the maximum segment sum problem, is the task of finding a contiguous subarray with the largest sum, within a given one-dimensional array A[1...n] of numbers. It can be solved in \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n  \n time and \n  \n    \n      \n        O\n        (\n        1\n        )\n      \n    \n    {\\displaystyle O(1)}\n  \n space.\nFormally, the task is to find indices \n  \n    \n      \n        i\n      \n    \n    {\\displaystyle i}\n  \n and \n  \n    \n      \n        j\n      \n    \n    {\\displaystyle j}\n  \n with \n  \n    \n      \n        1\n        ≤\n        i\n        ≤\n        j\n        ≤\n        n\n      \n    \n    {\\displaystyle 1\\leq i\\leq j\\leq n}\n  \n, such that the sum\n\n  \n    \n      \n        \n          ∑\n          \n            x\n            =\n            i\n          \n          \n            j\n          \n        \n        A\n        [\n        x\n        ]\n      \n    \n    {\\displaystyle \\sum _{x=i}^{j}A[x]}\n  \n\nis as large as possible. (Some formulations of the problem also allow the empty subarray to be considered; by convention, the sum of all values of the empty subarray is zero.)  Each number in the input array A could be positive, negative, or zero.\nFor example, for the array of values [−2, 1, −3, 4, −1, 2, 1, −5, 4], the contiguous subarray with the largest sum is [4, −1, 2, 1], with sum 6.\nSome properties of this problem are: \n\nIf the array contains all non-negative numbers, then the problem is trivial; a maximum subarray is the entire array.\nIf the array contains all non-positive numbers, then a solution is any subarray of size 1 containing the maximal value of the array (or the empty subarray, if it is permitted).\nSeveral different sub-arrays may have the same maximum sum.\nAlthough this problem can be solved using several different algorithmic techniques, including brute force, divide and conquer, dynamic programming, and reduction to shortest paths, a simple single-pass algorithm known as Kadane's algorithm solves it efficiently.\n\nHistory\nThe maximum subarray problem was proposed by Ulf Grenander in 1977 as a simplified model for maximum likelihood estimation of patterns in digitized images.\nGrenander was looking to find a rectangular subarray with maximum sum, in a two-dimensional array of real numbers.  A brute-force algorithm for the two-dimensional problem runs in O(n6) time; because this was prohibitively slow, Grenander proposed the one-dimensional problem to gain insight into its structure.  Grenander derived an algorithm that solves the one-dimensional problem in O(n2) time,\nimproving the brute force running time of O(n3). When Michael Shamos heard about the problem, he overnight devised an O(n log n) divide-and-conquer algorithm for it.\nSoon after, Shamos described the one-dimensional problem and its history at a Carnegie Mellon University seminar attended by Jay Kadane, who designed within a minute an O(n)-time algorithm, which is as fast as possible. In 1982, David Gries obtained the same O(n)-time algorithm by applying Dijkstra's \"standard strategy\"; in 1989, Richard Bird derived it by purely algebraic manipulation of the brute-force algorithm using the Bird–Meertens formalism.\nGrenander's two-dimensional generalization can be solved in O(n3) time either by using Kadane's algorithm as a subroutine, or through a divide-and-conquer approach.  Slightly faster algorithms based on distance matrix multiplication have been proposed by Tamaki & Tokuyama (1998) and by Takaoka (2002). There is some evidence that no significantly faster algorithm exists; an algorithm that solves the two-dimensional maximum subarray problem in O(n3−ε) time, for any ε>0, would imply a similarly fast algorithm for the all-pairs shortest paths problem.\n\nApplications\nMaximum subarray problems arise in many fields, such as genomic sequence analysis and computer vision.\nGenomic sequence analysis employs maximum subarray algorithms to identify important biological segments of protein sequences that have unusual properties, by assigning scores to points within the sequence that are positive when a motif to be recognized is present, and negative when it is not, and then seeking the maximum subarray among these scores. These problems include conserved segments, GC-rich regions, tandem repeats, low-complexity filter, DNA binding domains, and regions of high charge.\nIn computer vision, bitmap images generally consist only of positive values, for which the maximum subarray problem is trivial: the result is always the whole array. However, after subtracting a threshold value (such as the average pixel value) from each pixel, so that above-average pixels will be positive and below-average pixels will be negative, the maximum subarray problem can be applied to the modified image to detect bright areas within it.\n\nKadane's algorithm\nNo empty subarrays admitted\nKadane's algorithm scans the given array \n  \n    \n      \n        A\n        [\n        1\n        …\n        n\n        ]\n      \n    \n    {\\displaystyle A[1\\ldots n]}\n  \n from left to right. \nIn the \n  \n    \n      \n        j\n      \n    \n    {\\displaystyle j}\n  \nth step, it computes the subarray with the largest sum ending at \n  \n    \n      \n        j\n      \n    \n    {\\displaystyle j}\n  \n; this sum is maintained in variable current_sum.\nMoreover, it computes the subarray with the largest sum anywhere in \n  \n    \n      \n        A\n        [\n        1\n        …\n        j\n        ]\n      \n    \n    {\\displaystyle A[1\\ldots j]}\n  \n, maintained in variable best_sum,\nand easily obtained as the maximum of all values of current_sum seen so far, cf. line 7 of the algorithm.\nAs a loop invariant, in the \n  \n    \n      \n        j\n      \n    \n    {\\displaystyle j}\n  \nth step, the old value of current_sum holds the maximum over all \n  \n    \n      \n        i\n        ∈\n        {\n        1\n        ,\n        …\n        ,\n        j\n        −\n        1\n        }\n      \n    \n    {\\displaystyle i\\in \\{1,\\ldots ,j-1\\}}\n  \n of the sum \n  \n    \n      \n        A\n        [\n        i\n        ]\n        +\n        ⋯\n        +\n        A\n        [\n        j\n        −\n        1\n        ]\n      \n    \n    {\\displaystyle A[i]+\\cdots +A[j-1]}\n  \n.\nTherefore, current_sum\n  \n    \n      \n        +\n        A\n        [\n        j\n        ]\n      \n    \n    {\\displaystyle +A[j]}\n  \n\nis the maximum over all \n  \n    \n      \n        i\n        ∈\n        {\n        1\n        ,\n        …\n        ,\n        j\n        −\n        1\n        }\n      \n    \n    {\\displaystyle i\\in \\{1,\\ldots ,j-1\\}}\n  \n of the sum \n  \n    \n      \n        A\n        [\n        i\n        ]\n        +\n        ⋯\n        +\n        A\n        [\n        j\n        ]\n      \n    \n    {\\displaystyle A[i]+\\cdots +A[j]}\n  \n. To extend the latter maximum to cover also the case \n  \n    \n      \n        i\n        =\n        j\n      \n    \n    {\\displaystyle i=j}\n  \n, it is sufficient to consider also the singleton subarray \n  \n    \n      \n        A\n        [\n        j\n        \n        …\n        \n        j\n        ]\n      \n    \n    {\\displaystyle A[j\\;\\ldots \\;j]}\n  \n. This is done in line 6 by assigning \n  \n    \n      \n        max\n        (\n        A\n        [\n        j\n        ]\n        ,\n      \n    \n    {\\displaystyle \\max(A[j],}\n  \ncurrent_sum\n  \n    \n      \n        +\n        A\n        [\n        j\n        ]\n        )\n      \n    \n    {\\displaystyle +A[j])}\n  \n as the new value of current_sum, which after that holds the maximum over all \n  \n    \n      \n        i\n        ∈\n        {\n        1\n        ,\n        …\n        ,\n        j\n        }\n      \n    \n    {\\displaystyle i\\in \\{1,\\ldots ,j\\}}\n  \n of the sum \n  \n    \n      \n        A\n        [\n        i\n        ]\n        +\n        ⋯\n        +\n        A\n        [\n        j\n        ]\n      \n    \n    {\\displaystyle A[i]+\\cdots +A[j]}\n  \n.\nThus, the problem can be solved with the following code, expressed in Python. \n\nIf the input contains no positive element, the returned value is that of the largest element (i.e., the value closest to 0), or negative infinity if the input was empty. For correctness, an exception should be raised when the input array is empty, since an empty array has no maximum nonempty subarray. If the array is nonempty, its first element could be used in place of negative infinity, if needed to avoid mixing numeric and non-numeric values.\nThe algorithm can be adapted to the case which allows empty subarrays or to keep track of the starting and ending indices of the maximum subarray.\nThis algorithm calculates the maximum subarray ending at each position from the maximum subarray ending at the previous position, so it can be viewed as a case of dynamic programming.\n\nEmpty subarrays admitted\nKadane's original algorithm solves the problem variant when empty subarrays are admitted. \nThis variant will return 0 if the input contains no positive elements (including when the input is empty).\nIt is obtained by two changes in code: in line 3, best_sum should be initialized to 0 to account for the empty subarray \n  \n    \n      \n        A\n        [\n        0\n        …\n        −\n        1\n        ]\n      \n    \n    {\\displaystyle A[0\\ldots -1]}\n  \n\nand line 6 in the for loop current_sum should be updated as max(0, current_sum + x).\n\nAs a loop invariant, in the \n  \n    \n      \n        j\n      \n    \n    {\\displaystyle j}\n  \nth step, the old value of current_sum holds the maximum over all \n  \n    \n      \n        i\n        ∈\n        {\n        1\n        ,\n        …\n        ,\n        j\n        }\n      \n    \n    {\\displaystyle i\\in \\{1,\\ldots ,j\\}}\n  \n of the sum \n  \n    \n      \n        A\n        [\n        i\n        ]\n        +\n        ⋯\n        +\n        A\n        [\n        j\n        −\n        1\n        ]\n      \n    \n    {\\displaystyle A[i]+\\cdots +A[j-1]}\n  \n.\nTherefore, current_sum\n  \n    \n      \n        +\n        A\n        [\n        j\n        ]\n      \n    \n    {\\displaystyle +A[j]}\n  \n\nis the maximum over all \n  \n    \n      \n        i\n        ∈\n        {\n        1\n        ,\n        …\n        ,\n        j\n        }\n      \n    \n    {\\displaystyle i\\in \\{1,\\ldots ,j\\}}\n  \n of the sum \n  \n    \n      \n        A\n        [\n        i\n        ]\n        +\n        ⋯\n        +\n        A\n        [\n        j\n        ]\n      \n    \n    {\\displaystyle A[i]+\\cdots +A[j]}\n  \n. To extend the latter maximum to cover also the case \n  \n    \n      \n        i\n        =\n        j\n        +\n        1\n      \n    \n    {\\displaystyle i=j+1}\n  \n, it is sufficient to consider also the empty subarray \n  \n    \n      \n        A\n        [\n        j\n        +\n        1\n        \n        …\n        \n        j\n        ]\n      \n    \n    {\\displaystyle A[j+1\\;\\ldots \\;j]}\n  \n. This is done in line 6 by assigning \n  \n    \n      \n        max\n        (\n        0\n        ,\n      \n    \n    {\\displaystyle \\max(0,}\n  \ncurrent_sum\n  \n    \n      \n        +\n        A\n        [\n        j\n        ]\n        )\n      \n    \n    {\\displaystyle +A[j])}\n  \n as the new value of current_sum, which after that holds the maximum over all \n  \n    \n      \n        i\n        ∈\n        {\n        1\n        ,\n        …\n        ,\n        j\n        +\n        1\n        }\n      \n    \n    {\\displaystyle i\\in \\{1,\\ldots ,j+1\\}}\n  \n of the sum \n  \n    \n      \n        A\n        [\n        i\n        ]\n        +\n        ⋯\n        +\n        A\n        [\n        j\n        ]\n      \n    \n    {\\displaystyle A[i]+\\cdots +A[j]}\n  \n. Machine-verified C / Frama-C code of both variants can be found here.\n\nComputing the best subarray's position\nThe algorithm can be modified to keep track of the starting and ending indices of the maximum subarray as well.\nBecause of the way this algorithm uses optimal substructures (the maximum subarray ending at each position is calculated in a simple way from a related but smaller and overlapping subproblem: the maximum subarray ending at the previous position) this algorithm can be viewed as a simple/trivial example of dynamic programming.\n\nComplexity\nThe runtime complexity of Kadane's algorithm is \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n  \n and its space complexity is \n  \n    \n      \n        O\n        (\n        1\n        )\n      \n    \n    {\\displaystyle O(1)}\n  \n.\n\nGeneralizations\nSimilar problems may be posed for higher-dimensional arrays, but their solutions are more complicated; see, e.g., Takaoka (2002). Brodal & Jørgensen (2007) showed how to find the k largest subarray sums in a one-dimensional array, in the optimal time bound \n  \n    \n      \n        O\n        (\n        n\n        +\n        k\n        )\n      \n    \n    {\\displaystyle O(n+k)}\n  \n.\nThe Maximum sum k-disjoint subarrays can also be computed in the optimal time bound \n  \n    \n      \n        O\n        (\n        n\n        +\n        k\n        )\n      \n    \n    {\\displaystyle O(n+k)}\n  \n \n.\n\nSee also\nSubset sum problem\n\nNotes\nNotes\nReferences\nAlves, Carlos E. R.; Cáceres, Edson; Song, Siang W. (2004), \"BSP/CGM Algorithms for Maximum Subsequence and Maximum Subarray\", in Kranzlmüller, Dieter; Kacsuk, Péter; Dongarra, Jack J. (eds.), Recent Advances in Parallel Virtual Machine and Message Passing Interface, 11th European PVM/MPI Users' Group Meeting, Budapest, Hungary, September 19-22, 2004, Proceedings, Lecture Notes in Computer Science, vol. 3241, Springer, pp. 139–146, doi:10.1007/978-3-540-30218-6_24, ISBN 978-3-540-23163-9\nBackurs, Arturs; Dikkala, Nishanth; Tzamos, Christos (2016), \"Tight Hardness Results for Maximum Weight Rectangles\", Proc. 43rd International Colloquium on Automata, Languages, and Programming: 81:1–81:13, doi:10.4230/LIPIcs.ICALP.2016.81, S2CID 12720136\nBae, Sung Eun (2007), Sequential and Parallel Algorithms for the Generalized Maximum Subarray Problem (PDF) (Ph.D. thesis), University of Canterbury, S2CID 2681670, archived from the original (PDF) on 2017-10-26.\nBae, Sung Eun; Takaoka, Tadao (2006), \"Improved Algorithms for the \\emph{K}-Maximum Subarray Problem\", The Computer Journal, 49 (3): 358–374, doi:10.1093/COMJNL/BXL007\nBengtsson, Fredrik; Chen, Jingsen (2007), Computing maximum-scoring segments optimally (PDF) (Research report), Luleå University of Technology\nBentley, Jon (1984), \"Programming Pearls: Algorithm Design Techniques\", Communications of the ACM, 27 (9): 865–873, doi:10.1145/358234.381162, S2CID 207565329\nBentley, Jon (May 1989), Programming Pearls (2nd? ed.), Reading, MA: Addison Wesley, ISBN 0-201-10331-1\nBird, Richard S. (1989), \"Algebraic Identities for Program Calculation\", The Computer Journal, 32 (2): 122–126, doi:10.1093/comjnl/32.2.122\nBrodal, Gerth Stølting; Jørgensen, Allan Grønlund (2007), \"A linear time algorithm for the k maximal sums problem\", Mathematical Foundations of Computer Science 2007, Lecture Notes in Computer Science, vol. 4708, Springer-Verlag, pp. 442–453, doi:10.1007/978-3-540-74456-6_40, ISBN 978-3-540-74455-9.\nGries, David (1982), \"A Note on the Standard Strategy for Developing Loop Invariants and Loops\" (PDF), Science of Computer Programming, 2 (3): 207–241, doi:10.1016/0167-6423(83)90015-1, hdl:1813/6370\nRuzzo, Walter L.; Tompa, Martin (1999), \"A Linear Time Algorithm for Finding All Maximal Scoring Subsequences\", in Lengauer, Thomas; Schneider, Reinhard; Bork, Peer; Brutlag, Douglas L.; Glasgow, Janice I.; Mewes, Hans-Werner; Zimmer, Ralf (eds.), Proceedings of the Seventh International Conference on Intelligent Systems for Molecular Biology, August 6–10, 1999, Heidelberg, Germany, AAAI, pp. 234–241\nTakaoka, Tadao (2002), \"Efficient algorithms for the maximum subarray problem by distance matrix multiplication\", Electronic Notes in Theoretical Computer Science, 61: 191–200, doi:10.1016/S1571-0661(04)00313-5.\nTamaki, Hisao; Tokuyama, Takeshi (1998), \"Algorithms for the Maximum Subarray Problem Based on Matrix Multiplication\", Proceedings of the 9th Symposium on Discrete Algorithms (SODA): 446–452, ISBN 978-0-89871-410-4, retrieved November 17, 2018\nWeddell, Stephen John; Read, Tristan; Thaher, Mohammed; Takaoka, Tadao (2013), \"Maximum subarray algorithms for use in astronomical imaging\", Journal of Electronic Imaging, 22 (4): 043011, Bibcode:2013JEI....22d3011W, doi:10.1117/1.JEI.22.4.043011\n\nExternal links\nTAN, Lirong. \"Maximum Contiguous Subarray Sum Problems\" (PDF). Archived from the original (PDF) on 2015-10-10. Retrieved 2017-10-26.\nMu, Shin-Cheng (2010). \"The Maximum Segment Sum Problem: Its Origin, and a Derivation\".\n\"Notes on Maximum Subarray Problem\". 2012.\nwww.algorithmist.com\nalexeigor.wikidot.com\ngreatest subsequential sum problem on Rosetta Code\ngeeksforgeeks page on Kadane's Algorithm\n",
  "categories": [
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with short description",
    "Category:Dynamic programming",
    "Category:Optimization algorithms and methods",
    "Category:Short description is different from Wikidata"
  ],
  "archived_date": "20241220_214808",
  "source_url": "https://en.wikipedia.org/wiki/Maximum_subarray_problem"
}