{
  "title": "Metaclass",
  "summary": "In object-oriented programming, a metaclass is a class whose instances are classes themselves. Unlike ordinary classes, which define the behaviors of objects, metaclasses specify the behaviors of classes and their instances. Not all object-oriented programming languages support the concept of metaclasses. For those that do, the extent of control metaclasses have over class behaviors varies. Metaclasses are often implemented by treating classes as first-class citizens, making a metaclass an objec",
  "content": "---\ntitle: Metaclass\nurl: https://en.wikipedia.org/wiki/Metaclass\nlanguage: en\ncategories: [\"Category:All accuracy disputes\", \"Category:All articles needing additional references\", \"Category:All articles that may contain original research\", \"Category:All articles with style issues\", \"Category:Articles needing additional references from October 2013\", \"Category:Articles needing additional references from September 2013\", \"Category:Articles that may contain original research from September 2013\", \"Category:Articles with disputed statements from May 2015\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with multiple maintenance issues\", \"Category:Articles with short description\", \"Category:Class (computer programming)\", \"Category:Short description is different from Wikidata\", \"Category:Webarchive template wayback links\", \"Category:Wikipedia articles with style issues from September 2013\"]\nreferences: 0\nlast_modified: 2024-12-19T13:44:46Z\n---\n\n# Metaclass\n\n## Summary\n\nIn object-oriented programming, a metaclass is a class whose instances are classes themselves. Unlike ordinary classes, which define the behaviors of objects, metaclasses specify the behaviors of classes and their instances. Not all object-oriented programming languages support the concept of metaclasses. For those that do, the extent of control metaclasses have over class behaviors varies. Metaclasses are often implemented by treating classes as first-class citizens, making a metaclass an objec\n\n## Full Content\n\nIn object-oriented programming, a metaclass is a class whose instances are classes themselves. Unlike ordinary classes, which define the behaviors of objects, metaclasses specify the behaviors of classes and their instances. Not all object-oriented programming languages support the concept of metaclasses. For those that do, the extent of control metaclasses have over class behaviors varies. Metaclasses are often implemented by treating classes as first-class citizens, making a metaclass an object that creates and manages these classes. Each programming language adheres to its own metaobject protocol, which are the rules that determine interactions among objects, classes, and metaclasses. Metaclasses are utilized to automate code generation and to enhance framework development.\n\nPython example\nIn Python, the builtin class type is a metaclass. Consider this simple Python class:\n\nAt run time, Car itself is an instance of type. The source code of the Car class, shown above, does not include such details as the size in bytes of Car objects, their binary layout in memory, how they are allocated, that the __init__ method is automatically called each time a Car is created, and so on. These details come into play not only when a new Car object is created, but also each time any attribute of a Car is accessed. In languages without metaclasses, these details are defined by the language specification and can't be overridden. In Python, the metaclass - type - controls these details of Car's behavior. They can be overridden by using a different metaclass instead of type.\nThe above example contains some redundant code to do with the four attributes make, model, year, and color. It is possible to eliminate some of this redundancy using a custom metaclass. In Python, a metaclass is most easily defined as a subclass of type.\n\nThis metaclass only overrides object creation.  All other aspects of class and object behavior are still handled by type.\nNow the class Car can be rewritten to use this metaclass. In Python 3 this is done by providing a \"keyword argument\" metaclass to the class definition:\n\nThe resulting object Car can be instantiated as usual, but can contain any number of keyword arguments:\n\nIn Smalltalk-80\nIn Smalltalk, everything is an object. Additionally, Smalltalk is a class based system, which means that every object has a class that defines the structure of that object (i.e. the instance variables the object has) and the messages an object understands. Together this implies that a class in Smalltalk is an object and that, therefore a class needs to be an instance of a class (called metaclass).\nAs an example, a car object c is an instance of the class Car. In turn, the class Car is again an object and as such an instance of the metaclass of Car called Car class. Note the blank in the name of the metaclass. The name of the metaclass is the Smalltalk expression that, when evaluated, results in the metaclass object. Thus evaluating Car class results in the metaclass object for Car whose name is Car class (one can confirm this by evaluating Car class name which returns the name of the metaclass of Car.)\nClass methods actually belong to the metaclass, just as instance methods actually belong to the class. When a message is sent to the object 2, the search for the method starts in Integer. If it is not found it proceeds up the superclass chain, stopping at Object whether it is found or not.\nWhen a message is sent to Integer the search for the method starts in Integer class and proceeds up the superclass chain to Object class. Note that, so far, the metaclass inheritance chain exactly follows that of the class inheritance chain. But the metaclass chain extends further because Object class is the subclass of Class. All metaclasses are subclasses of Class.\nIn early Smalltalks, there was only one metaclass called Class. This implied that the methods all classes have were the same, in particular the method to create new objects, i.e., new. To allow classes to have their own methods and their own instance variables (called class instance variables and should not be confused with class variables), Smalltalk-80 introduced for each class C their own metaclass C class. This means that each metaclass is effectively a singleton class.\nSince there is no requirement that metaclasses behave differently from each other, all metaclasses are instances of only one class called Metaclass. The metaclass of Metaclass is called Metaclass class which again is an instance of class Metaclass.\nIn Smalltalk-80, every class (except Object) has a superclass. The abstract superclass of all metaclasses is Class, which describes the general nature of classes.\nThe superclass hierarchy for metaclasses parallels that for classes, except for class Object. ALL metaclasses are subclasses of Class, therefore: \n\nObject class superclass == Class.\nLike conjoined twins, classes and metaclasses are born together. Metaclass has an instance variable thisClass, which points to its conjoined class.\nNote that the usual Smalltalk class browser does not show metaclasses as separate classes. Instead the class browser allows to edit the class together with its metaclass at the same time.\nThe names of classes in the metaclass hierarchy are easily confused with the concepts of the same name. For instance:\n\nObject is the base class that provides common methods for all objects; \"an object\" is an integer, or a widget, or a Car, etc.\nClass is the base of the metaclasses that provides common methods for all classes (though it is not a metaclass itself); \"a class\" is something like Integer, or Widget, or Car, etc.\nMetaclass provides common methods for all metaclasses.\nFour classes provide the facilities to describe new classes. Their inheritance hierarchy (from Object), and the main facilities they provide are:\n\nObject - default behavior common to all objects, like class access\nBehavior - minimum state for compiling methods and creating/running objects\nClassDescription (abstract class) - class/variable naming, comments\nClass - similar, more comprehensive, facilities to superclasses\nMetaclass - initializing class variables, instance creation messages\n\nIn Ruby\nRuby purifies the Smalltalk-80 concept of metaclasses by introducing eigenclasses,\nremoving the Metaclass class,\nand (un)redefining the class-of map.\nThe change can be schematized as follows:\n\nNote in particular the correspondence between Smalltalk's implicit metaclasses and Ruby's eigenclasses of classes.\nThe Ruby eigenclass model makes the concept of implicit metaclasses fully uniform: every object x has its own meta-object, called the eigenclass of x, which is one meta-level higher than x. The \"higher order\" eigenclasses usually exist purely conceptually – they do not contain any methods or store any (other) data in most Ruby programs.\nThe following diagrams show a sample core structure of Smalltalk-80 and Ruby in comparison.\nIn both languages, the structure consists of a built-in part which contains the circular objects (i.e. objects that appear in a cycle formed by a combination of blue or green links) and a user-part which has four explicit objects: classes A and B\nand terminal objects u and v.\nGreen links show the child→parent relation of inheritance (with the implicit upward direction), blue links show the complementary member→container relation of instantiation (a blue link from x points to the least actual container of x that is the start point for the method lookup when a method is invoked on x). Gray nodes display the eigenclasses (resp. implicit metaclasses in the case of Smalltalk-80).\n\nThe diagram on the right also provides a picture of lazy evaluation of eigenclasses in Ruby. The v object can have its eigenclass evaluated (allocated) as a consequence of adding singleton methods to v.\nAccording to the Ruby's introspection method named class,\nthe class of every class (and of every eigenclass) is\nconstantly the Class class (denoted by c in the diagram).\nClass, and Struct are the only classes that have classes as instances.  Subclassing of Class is disallowed.\nFollowing the standard definition of metaclasses we can conclude that Class and Struct are the only metaclasses in Ruby.\nThis seems to contradict the correspondence between Ruby and Smalltalk,\nsince in Smalltalk-80, every class has its own metaclass.\nThe discrepancy is based on the disagreement between\nthe class introspection method in Ruby and Smalltalk. While the map x ↦ x.class coincides on terminal objects, it differs in the restriction to classes. As already mentioned above, for a class x, the Ruby expression x.class evaluates constantly to Class. In Smalltalk-80, if x is a class then the expression x class corresponds\nto the Ruby's x.singleton_class\n– which evaluates to the eigenclass of x.\n\nIn Objective-C\nMetaclasses in Objective-C are almost the same as those in Smalltalk-80—not surprising since Objective-C borrows a lot from Smalltalk. Like Smalltalk, in Objective-C, the instance variables and methods are defined by an object's class. A class is an object, hence it is an instance of a metaclass.\nLike Smalltalk, in Objective-C, class methods are simply methods called on the class object, hence a class's class methods must be defined as instance methods in its metaclass. Because different classes can have different sets of class methods, each class must have its own separate metaclass. Classes and metaclasses are always created as a pair: the runtime has functions objc_allocateClassPair() and objc_registerClassPair() to create and register class-metaclass pairs, respectively.\nThere are no names for the metaclasses; however, a pointer to any class object can be referred to with the generic type Class (similar to the type id being used for a pointer to any object).\nBecause class methods are inherited through inheritance, like Smalltalk, metaclasses must follow an inheritance scheme paralleling that of classes (e.g. if class A's parent class is class B, then A's metaclass's parent class is B's metaclass), except that of the root class.\nUnlike Smalltalk, the metaclass of the root class inherits from the root class (usually NSObject using the Cocoa framework) itself. This ensures that all class objects are ultimately instances of the root class, so that you can use the instance methods of the root class, usually useful utility methods for objects, on class objects themselves.\nSince metaclass objects do not behave differently (you cannot add class methods for a metaclass, so metaclass objects all have the same methods), they are all instances of the same class—the metaclass of the root class (unlike Smalltalk). Thus, the metaclass of the root class is an instance of itself. The reason for this is that all metaclasses inherit from root class; hence, they must inherit the class methods of the root class.\n\nSupport in languages and tools\nThe following are some of the most prominent programming languages that support metaclasses.\n\nCommon Lisp, via CLOS\nDelphi and other versions of Object Pascal influenced by it\nGroovy\nObjective-C\nooRexx\nPython\nPerl, via the metaclass pragma, as well as Moose\nRuby\nSmalltalk\nC++ (proposed for a possible inclusion in future version of the standard)\nSome less widespread languages that support metaclasses include OpenJava, OpenC++, OpenAda, CorbaScript, ObjVLisp, Object-Z, MODEL-K, XOTcl, and MELDC. Several of these languages date from the early 1990s and are of academic interest.\nLogtalk, an object-oriented extension of Prolog, also supports metaclasses.\nResource Description Framework (RDF) and Unified Modeling Language (UML) both support metaclasses.\n\nSee also\nReferences\nExternal links\nWhat Is a Metaclass?\n",
  "categories": [
    "Category:All accuracy disputes",
    "Category:All articles needing additional references",
    "Category:All articles that may contain original research",
    "Category:All articles with style issues",
    "Category:Articles needing additional references from October 2013",
    "Category:Articles needing additional references from September 2013",
    "Category:Articles that may contain original research from September 2013",
    "Category:Articles with disputed statements from May 2015",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with multiple maintenance issues",
    "Category:Articles with short description",
    "Category:Class (computer programming)",
    "Category:Short description is different from Wikidata",
    "Category:Webarchive template wayback links",
    "Category:Wikipedia articles with style issues from September 2013"
  ],
  "archived_date": "20241220_214803",
  "source_url": "https://en.wikipedia.org/wiki/Metaclass"
}