{
  "title": "Named parameter",
  "summary": "In computer programming, named parameters, named-parameter arguments, named arguments or keyword arguments refer to a computer language's support for function calls to clearly associate each argument with a given parameter within the function call.",
  "content": "---\ntitle: Named parameter\nurl: https://en.wikipedia.org/wiki/Named_parameter\nlanguage: en\ncategories: [\"Category:All articles needing additional references\", \"Category:All articles with dead external links\", \"Category:All articles with unsourced statements\", \"Category:Articles needing additional references from August 2014\", \"Category:Articles with dead external links from December 2023\", \"Category:Articles with example C code\", \"Category:Articles with example JavaScript code\", \"Category:Articles with example PHP code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with short description\", \"Category:Articles with unsourced statements from July 2021\", \"Category:Short description matches Wikidata\", \"Category:Subroutines\"]\nreferences: 0\nlast_modified: 2024-12-19T13:44:34Z\n---\n\n# Named parameter\n\n## Summary\n\nIn computer programming, named parameters, named-parameter arguments, named arguments or keyword arguments refer to a computer language's support for function calls to clearly associate each argument with a given parameter within the function call.\n\n## Full Content\n\nIn computer programming, named parameters, named-parameter arguments, named arguments or keyword arguments refer to a computer language's support for function calls to clearly associate each argument with a given parameter within the function call.\n\nOverview\nA function call using named parameters differs from a regular function call in that the arguments are passed by associating each one with a parameter name, instead of providing an ordered list of arguments.\nFor example, consider this Java or C# method call that doesn't use named parameters:\n\nUsing named parameters in Python, the call can be written as:\n\nUsing named parameters in PHP, the call can be written as:\n\nThe version with positional arguments is more implicit. The versions that name parameters are more explicit. Depending on circumstance, a programmer may find one or the other to be easier to read.\n\nUse in programming languages\nNamed parameters are supported explicitly in many languages. A non-exhaustive selection of examples includes Ada, C# 4.0+, Ceylon, ColdFusion Markup Language (CFML), Common Lisp, Fortran, IDL, Kotlin, Mathematica, PL/SQL, PowerShell, Python, R, PHP, Ruby, Scala, Smalltalk, Swift and Visual Basic. Objective-C does not have named parameters (even though parts of the method name may look like named parameters).\nIn C++, you can achieve named parameters by using designated initializers since C++20, like so:\n\nOrder of parameters\nIn languages that do not support named parameters, the order of arguments in a function call is necessarily fixed, since it is the only way that the language can identify which argument is intended to be used for which parameter.\nWith named parameters, it is usually possible to provide the arguments in any order, since the parameter name attached to each argument identifies its purpose. This reduces the connascence between parts of the program. A few languages support named parameters but still require the arguments to be provided in a specific order.\n\nOptional parameters and positional parameters\nNamed parameters are often used in conjunction with optional parameters.  Without named parameters, optional parameters can only appear at the end of the parameter list, since there is no other way to determine which values have been omitted.  In languages that support named optional parameters, however, programs may supply any subset of the available parameters, and the names are used to determine which values have been provided.\nAn added complication arises in languages such as OCaml that support both optional named parameters and partial application. It is impossible in general to distinguish between a function partly applied, and a function to which a subset of parameters have been provided.  OCaml resolves this ambiguity by requiring a positional argument after all optional named-parameter arguments: its presence or absence is used to decide if the function has been fully or partly applied. If all parameters are optional, the implementor may solve the issue by adding a dummy positional parameter of type unit.\n\nEmulating\nIn languages that do not support named parameters, some of the same benefits can be achieved in other ways.\n\nWith documentation\nTheir value as documentation can be replicated by tooltips in integrated development environments (IDEs) for languages such as Java, or with comments (in C):\n\nSuch comments are not checked for correctness and the order of arguments remains important.\n\nWith data structures\nRemoving the argument order restriction, and the ability to leave some values unspecified, can be achieved by passing a record or associative array.\nFor example, in JavaScript, these two calls are equivalent:\n\nCompare to C99:\n\nSpecial Support\nIn Perl and pre-2.0 Ruby a similar convention exists (generally called a hash or options hash), with special support for omitting the delimiters within function calls. As an example, the core module's Net::FTP new function accepts a hash of optional arguments.\n\nWith chained method calls\nIn object-oriented programming languages, it is possible to use method chaining to simulate named parameters, as a form of fluent interface. Each named-parameter argument is replaced with a method on an \"arguments\" object that modifies and then returns the object. In C++, this is termed the named parameter idiom. The object may then be passed to a function that uses the arguments it contains.\nMethod chaining is often used in conjunction with the builder pattern as a way to override default values provided by the builder class.\n\nSee also\nHelp:Template for named and positional parameters.\nFluent interface\nTag (programming)\n\nReferences\nExternal links\nhttps://web.archive.org/web/20070502112455/http://plg.uwaterloo.ca/~rgesteve/cforall/named_pars.html\nIn C++ this paradigm can be easily implemented: Boost Parameter Library\nNamed Parameters in various programming languages at Rosetta Code\n",
  "categories": [
    "Category:All articles needing additional references",
    "Category:All articles with dead external links",
    "Category:All articles with unsourced statements",
    "Category:Articles needing additional references from August 2014",
    "Category:Articles with dead external links from December 2023",
    "Category:Articles with example C code",
    "Category:Articles with example JavaScript code",
    "Category:Articles with example PHP code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with short description",
    "Category:Articles with unsourced statements from July 2021",
    "Category:Short description matches Wikidata",
    "Category:Subroutines"
  ],
  "archived_date": "20241221_183036",
  "source_url": "https://en.wikipedia.org/wiki/Named_parameter"
}