{
  "title": "Peter Norvig",
  "summary": "Peter Norvig (born December 14, 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J. Russell of the most popular textbook in the field of AI: Artificial Intelligence: A Modern Approach used in more than 1,500 universities in 135 countries.",
  "content": "---\ntitle: Peter Norvig\nurl: https://en.wikipedia.org/wiki/Peter_Norvig\nlanguage: en\ncategories: [\"Category:1956 births\", \"Category:2006 fellows of the Association for Computing Machinery\", \"Category:American artificial intelligence researchers\", \"Category:American computer scientists\", \"Category:Articles with hCards\", \"Category:Articles with short description\", \"Category:Biography with signature\", \"Category:Brown University alumni\", \"Category:Fellows of the Association for the Advancement of Artificial Intelligence\", \"Category:Google employees\", \"Category:Lisp (programming language) people\", \"Category:Living people\", \"Category:Natural language processing researchers\", \"Category:Python (programming language) people\", \"Category:Short description is different from Wikidata\", \"Category:University of California, Berkeley alumni\", \"Category:Use dmy dates from September 2022\"]\nreferences: 0\nlast_modified: 2024-12-19T13:44:47Z\n---\n\n# Peter Norvig\n\n## Summary\n\nPeter Norvig (born December 14, 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J. Russell of the most popular textbook in the field of AI: Artificial Intelligence: A Modern Approach used in more than 1,500 universities in 135 countries.\n\n## Full Content\n\nPeter Norvig (born December 14, 1956) is an American computer scientist and Distinguished Education Fellow at the Stanford Institute for Human-Centered AI. He previously served as a director of research and search quality at Google. Norvig is the co-author with Stuart J. Russell of the most popular textbook in the field of AI: Artificial Intelligence: A Modern Approach used in more than 1,500 universities in 135 countries.\n\nEducation\nNorvig received a Bachelor of Science in applied mathematics from Brown University and a Ph.D. in computer science from the University of California, Berkeley.\n\nCareer and research\nNorvig is a councilor of the Association for the Advancement of Artificial Intelligence and co-author, with Stuart J. Russell, of Artificial Intelligence: A Modern Approach, now the leading college text in the field. He was head of the Computational Sciences Division (now the Intelligent Systems Division) at NASA Ames Research Center, where he oversaw a staff of 200 scientists performing NASA's research and development in autonomy and robotics, automated software engineering and data analysis, neuroengineering, collaborative systems research, and simulation-based decision-making. Before that he was chief scientist at Junglee, where he helped develop one of the first Internet comparison-shopping services; chief designer at Harlequin Inc.; and senior scientist at Sun Microsystems Laboratories.\nNorvig has served as an assistant professor at the University of Southern California and as a research faculty member at Berkeley. He has over fifty publications in various areas of computer science, concentrating on artificial intelligence, natural language processing, information retrieval and software engineering, including the books Artificial Intelligence: A Modern Approach, Paradigms of AI Programming: Case Studies in Common Lisp, Verbmobil: A Translation System for Face-to-Face Dialog, and Intelligent Help Systems for UNIX.\nNorvig is one of the creators of JScheme. Norvig is listed under \"Academic Faculty & Advisors\" for the Singularity University. In 2011, Norvig worked with Sebastian Thrun to develop a popular online course in Artificial Intelligence that had more than 160,000 students enrolled. He also teaches an online course via the Udacity platform.\n\nSelected publications and presentations\nBy 2022, Artificial Intelligence: A Modern Approach, which Norvig first co-authored with Stuart J. Russell in 1995, was the leading textbook in the field used by over 1400 schools globally.\nIn 2001, Norvig published a short article titled Teach Yourself Programming in Ten Years, arguing against the fashionable introductory programming textbooks that purported to teach programming in days or weeks.  The article was widely shared and discussed, and has attracted contributed translations to over 20 languages.\nNorvig is also known for his 2003 Gettysburg Powerpoint Presentation, a satire about bad presentation practices using Abraham Lincoln's famous Gettysburg Address.\nHis 2009 IEEE Intelligent Systems article, \"The Unreasonable Effectiveness of Data\" co-authored with Alon Y. Halevy and  Fernando Pereira, described how the best approach to highly complex natural language understanding problems is to harness large quantities of data, not to depend on \"tidy\", simple formulas. They said that by generating \"large amounts of unlabeled, noisy data, new algorithms can be used to build high-quality models from the data. This has informed the development of foundation models. \"But invariably, simple models and a lot of data trump more elaborate models based on less data.\": 9  \"Choose a representation that can use unsupervised learning on unlabeled data, which is so much more plentiful than labeled data.\": 12  The title refers to the physicist Eugene Wigner's 1960 journal article, \"The Unreasonable Effectiveness of Mathematics in the Natural Sciences\".\nIn a 23 September 2010 lecture presented as part of the Vancouver-based University of British Columbia's Department of Computer Science's Distinguished Lecture Series, Norvig, who was then the Director of Research at Google, described how large quantities of data deepen our understanding of phenomena.\nIn his June 2012 Ted Talk, described the fall of 2011 hybrid class on artificial intelligence attended by 100,000 online students around the globe that he co-taught with Sebastian Thrun at Stanford University.\n\nAwards and honors\nNorvig was elected an AAAI Fellow in 2001 and a fellow of the Association for Computing Machinery in 2006.\n\nReferences\nExternal links\nThe Prospects for AI, featuring Neil Jacobstein, Patrick Lincoln, Peter Norvig, and Bruno Olshausen\nAn experiment by Norvig on Scientific opinion on climate change\n",
  "categories": [
    "Category:1956 births",
    "Category:2006 fellows of the Association for Computing Machinery",
    "Category:American artificial intelligence researchers",
    "Category:American computer scientists",
    "Category:Articles with hCards",
    "Category:Articles with short description",
    "Category:Biography with signature",
    "Category:Brown University alumni",
    "Category:Fellows of the Association for the Advancement of Artificial Intelligence",
    "Category:Google employees",
    "Category:Lisp (programming language) people",
    "Category:Living people",
    "Category:Natural language processing researchers",
    "Category:Python (programming language) people",
    "Category:Short description is different from Wikidata",
    "Category:University of California, Berkeley alumni",
    "Category:Use dmy dates from September 2022"
  ],
  "archived_date": "20241220_214826",
  "source_url": "https://en.wikipedia.org/wiki/Peter_Norvig"
}