{
  "title": "PyGTK",
  "summary": "PyGTK is a set of Python wrappers for the GTK graphical user interface library. PyGTK is free software and licensed under the LGPL. It is analogous to PyQt/PySide and wxPython, the Python wrappers for Qt and wxWidgets, respectively. Its original author is GNOME developer James Henstridge. There are six people in the core development team, with various other people who have submitted patches and bug reports. PyGTK has been selected as the environment of choice for applications running on One Lapt",
  "content": "---\ntitle: PyGTK\nurl: https://en.wikipedia.org/wiki/PyGTK\nlanguage: en\ncategories: [\"Category:Articles with short description\", \"Category:GTK language bindings\", \"Category:Python (programming language) libraries\", \"Category:Short description matches Wikidata\", \"Category:Software that uses PyGObject\", \"Category:Software that uses PyGTK\", \"Category:Widget toolkits\"]\nreferences: 0\nlast_modified: 2024-12-19T13:45:56Z\n---\n\n# PyGTK\n\n## Summary\n\nPyGTK is a set of Python wrappers for the GTK graphical user interface library. PyGTK is free software and licensed under the LGPL. It is analogous to PyQt/PySide and wxPython, the Python wrappers for Qt and wxWidgets, respectively. Its original author is GNOME developer James Henstridge. There are six people in the core development team, with various other people who have submitted patches and bug reports. PyGTK has been selected as the environment of choice for applications running on One Lapt\n\n## Full Content\n\nPyGTK is a set of Python wrappers for the GTK graphical user interface library. PyGTK is free software and licensed under the LGPL. It is analogous to PyQt/PySide and wxPython, the Python wrappers for Qt and wxWidgets, respectively. Its original author is GNOME developer James Henstridge. There are six people in the core development team, with various other people who have submitted patches and bug reports. PyGTK has been selected as the environment of choice for applications running on One Laptop Per Child systems.\nPyGTK will be phased out with the transition to GTK version 3 and be replaced with PyGObject, which uses GObject Introspection to generate bindings for Python and other languages on the fly. This is expected to eliminate the delay between GTK updates and corresponding language binding updates, as well as reduce maintenance burden on the developers.\n\nSyntax\nThe Python code below will produce a 200x200 pixel window with the words \"Hello World\" inside.\n\nNotable applications that have used PyGTK\nPyGTK has been used in a number of notable applications, some examples:\n\nPyGObject\nPyGObject provides a wrapper for use in Python programs when accessing GObject libraries. GObject is an object system used by GTK, GLib, GIO, GStreamer and other libraries.\nLike the GObject library itself, PyGObject is licensed under the GNU LGPL, so it is suitable for use in both free software and proprietary applications. It is already in use in many applications ranging from small single-purpose scripts to large full-featured applications.\nPyGObject can dynamically access any GObject libraries that use GObject Introspection. It replaces the need for separate modules such as PyGTK, GIO and python-gnome to build a full GNOME 3.0 application.  Once new functionality is added to GObject library it is instantly available as a Python API without the need for intermediate Python glue.\n\nNotable applications that use PyGObject\nPyGObject has replaced PyGTK, but it has taken a considerable amount of time for many programs to be ported. Most of the software listed here has an older version which used PyGTK.\n\nSee also\nPyQt (Python wrapper for the Qt toolkit)\nPySide (Alternative Python wrapper for the Qt toolkit)\nwxPython (Python wrapper for the wx widgets collection)\n\nReferences\nExternal links\nPyGTK Homepage\nPyGTK FAQ\nPyGTK Tutorial\nPyGTK Notebook A Journey Through Python Gnome Technologies by Peter Gill\nPyGTK at Python wiki\nPyGObject Homepage\nPyGObject tutorial\n",
  "categories": [
    "Category:Articles with short description",
    "Category:GTK language bindings",
    "Category:Python (programming language) libraries",
    "Category:Short description matches Wikidata",
    "Category:Software that uses PyGObject",
    "Category:Software that uses PyGTK",
    "Category:Widget toolkits"
  ],
  "archived_date": "20241220_214822",
  "source_url": "https://en.wikipedia.org/wiki/PyGTK"
}