{
  "title": "Pylons project",
  "summary": "Pylons Project is an open-source organization that develops a set of web application technologies written in Python. Initially the project was a single web framework called Pylons, but after the merger with the repoze.bfg framework under the new name Pyramid, the Pylons Project now consists of multiple related web application technologies.",
  "content": "---\ntitle: Pylons project\nurl: https://en.wikipedia.org/wiki/Pylons_project\nlanguage: en\ncategories: [\"Category:Articles with short description\", \"Category:Cross-platform free software\", \"Category:Free software programmed in Python\", \"Category:Python (programming language) software\", \"Category:Python (programming language) web frameworks\", \"Category:Short description is different from Wikidata\", \"Category:Webarchive template wayback links\"]\nreferences: 0\nlast_modified: 2024-12-19T14:33:19Z\n---\n\n# Pylons project\n\n## Summary\n\nPylons Project is an open-source organization that develops a set of web application technologies written in Python. Initially the project was a single web framework called Pylons, but after the merger with the repoze.bfg framework under the new name Pyramid, the Pylons Project now consists of multiple related web application technologies.\n\n## Full Content\n\nPylons Project is an open-source organization that develops a set of web application technologies written in Python. Initially the project was a single web framework called Pylons, but after the merger with the repoze.bfg framework under the new name Pyramid, the Pylons Project now consists of multiple related web application technologies.\n\nPyramid\nPyramid is an open source web framework written in Python and is based on WSGI. It is a minimalistic web framework inspired by Zope, Pylons and Django.\nOriginally called \"repoze.bfg\", Pyramid gathered attention mostly in the Zope and Plone community as the Open Society Institute's KARL project migrated from Plone to BFG. In 2010 it was announced that the Pylons framework will move over to using BFG as a base in version 1.5. As a result of the inclusion of BFG into the Pylons project, BFG was renamed Pyramid.\n\nFeatures\nPyramid is a minimalistic, platform-independent web framework. It is persistence agnostic and is integrated both with SQL databases via SQLAlchemy and with the Zope Object Database, as well as other NoSQL databases, such as CouchDB.\nPyramid allows developers to define routes using regular expressions that map to objects. Like its fellow framework Zope, Pyramid also allows hierarchical object traversal, where each part of a URL is an object containing other objects, in a way that is similar to folders in a filesystem.\n\nPylons Web Framework\nPylons Framework is an open-source Web application framework written in Python. It makes extensive use of the Web Server Gateway Interface standard to promote reusability and to separate functionality into distinct modules. It is strongly influenced by Ruby on Rails: two of its main components, Routes and WebHelpers, are Python reimplementations of Rails features.\n\nStructure\nPylons is well known for having a near-complete stack of third-party tools, eschewing the \"not-invented-here\" phenomenon.\n\nInstallation, dependencies, and setup\nThe official installation method of Pylons is through EasyInstall via the Python Package Index (PyPI), and most of the additional tools are typically installed the same way. EasyInstall also handles package dependencies when relevant. Some distributions could also package Pylons and Paste, but it is likely that any distribution's packages would lag the official distribution. Pylons may also be installed by hand by renaming its .egg file to .zip and extracting the contents.\nPaste is used for project setup, testing, and deployment. Using the common INI configuration format, Paste allows for multiple \"profiles\", so that developers can run development and deployment setups from the same codebase without revealing sensitive parts of Pylons, such as the interactive debugger, to production users.\n\nURL dispatch\nCurrently the only widely used URL dispatcher for Pylons is Routes, a Python reimplementation of Ruby on Rails' URL dispatching, although any WSGI-compatible URL dispatcher can be used.  While Routes is a separate library, it was developed for use in Pylons and its development remains closely in sync with Pylons.\n\nHTML generation\nAnother piece of Rails adapted for Pylons is WebHelpers, which provides URL mapping based on the Routes configuration. WebHelpers also provides some utility functions for generating JavaScript code making use of the script.aculo.us and Prototype libraries.\nFormEncode and FormBuild are used for HTML form validation and generation; there has been some use of Mako for form generation using Mako's inheritance model.\n\nTemplating\nMyghty was the default Pylons templating language, but as of version 0.9.6 it has been replaced by Mako. Both templating languages are text-based (as opposed to XML-based), and support includes, inheritance and embedding arbitrary Python code.\nBecause of Pylons' loosely coupled layers, other templating languages can be used as well. Genshi, an XML-based templating language, can be used in lieu of either Mako or Myghty.\n\nDatabase abstraction and object-relational mapping\nPylons has no default database library. Both SQLObject and SQLAlchemy are known to be used.\n\nMerger with repoze.bfg and birth of Pyramid Web Framework\nPylons has developed into the Pylons Project, and the old code from Pylons 1.0 is now in maintenance-only mode. However, pursuant to the project's merger with repoze.bfg since November 2010, newer versions of Pylons are actually different from the original Pylons 1.0. Pylons developers initially planned to rewrite certain portions of the code, but they observed that the new code was approximating repoze.bfg, which led to the merger of Pylons and repoze.bfg. This led to repoze.bfg (a part of the Repoze Python-based web framework) to become rebranded and relaunched as the Pyramid web framework.\n\nSee also\nDjango (web framework)\nFastAPI\nFlask (web framework)\nWeb2py\nTurboGears: a derivative project, built on top of Pylons\nTornado\nComparison of web frameworks\n\nReferences\nFurther reading\nGardner, James (January 2009). The Definitive Guide to Pylons. Berkeley, CA: Apress. doi:10.1007/978-1-4302-0534-0. ISBN 978-1-59059-934-1.\n\nExternal links\nOfficial website\n",
  "categories": [
    "Category:Articles with short description",
    "Category:Cross-platform free software",
    "Category:Free software programmed in Python",
    "Category:Python (programming language) software",
    "Category:Python (programming language) web frameworks",
    "Category:Short description is different from Wikidata",
    "Category:Webarchive template wayback links"
  ],
  "archived_date": "20241220_214832",
  "source_url": "https://en.wikipedia.org/wiki/Pylons_project"
}