{
  "title": "Pyomo",
  "summary": "Pyomo is a collection of Python software packages for formulating optimization models.\nPyomo was developed by William Hart and Jean-Paul Watson at Sandia National Laboratories and David Woodruff at University of California, Davis.  Significant extensions to Pyomo were developed by Bethany Nicholson and John Siirola at Sandia National Laboratories, Carl Laird at Purdue University, and Gabriel Hackebeil.  Pyomo is an open-source project that is freely available, and it is licensed with the BSD lic",
  "content": "---\ntitle: Pyomo\nurl: https://en.wikipedia.org/wiki/Pyomo\nlanguage: en\ncategories: [\"Category:Mathematical optimization software\", \"Category:Python (programming language) software\", \"Category:Software using the BSD license\"]\nreferences: 0\nlast_modified: 2024-11-27T09:14:41Z\n---\n\n# Pyomo\n\n## Summary\n\nPyomo is a collection of Python software packages for formulating optimization models.\nPyomo was developed by William Hart and Jean-Paul Watson at Sandia National Laboratories and David Woodruff at University of California, Davis.  Significant extensions to Pyomo were developed by Bethany Nicholson and John Siirola at Sandia National Laboratories, Carl Laird at Purdue University, and Gabriel Hackebeil.  Pyomo is an open-source project that is freely available, and it is licensed with the BSD lic\n\n## Full Content\n\nPyomo is a collection of Python software packages for formulating optimization models.\nPyomo was developed by William Hart and Jean-Paul Watson at Sandia National Laboratories and David Woodruff at University of California, Davis.  Significant extensions to Pyomo were developed by Bethany Nicholson and John Siirola at Sandia National Laboratories, Carl Laird at Purdue University, and Gabriel Hackebeil.  Pyomo is an open-source project that is freely available, and it is licensed with the BSD license.  Pyomo is developed as part of the COIN-OR project.  Pyomo is a popular open-source software package that is used by a variety of government agencies and academic institutions.\n\nFeatures\nPyomo allows users to formulate optimization problems in Python in a manner that is similar to the notation commonly used in mathematical optimization. Pyomo supports an object-oriented style of formulating optimization models, which are defined with a variety of modeling components:  sets, scalar and multidimensional parameters, decision variables, objectives, constraints, equations, disjunctions and more.  Optimization models can be initialized with python data, and external data sources can be defined using spreadsheets, databases, various formats of text files.  Pyomo supports both abstract models, which are defined without data, and concrete models, which are defined with data.  In both cases, Pyomo allows for the separation of model and data.\nPyomo supports dozens of solvers, both open source and commercial, including many solvers supported by AMPL, PICO, CBC, CPLEX, IPOPT,  and GLPK. Pyomo can either invoke the solver directly or asynchronously with a solver manager.  Solver managers support remote, asynchronous execution of solvers, which supports parallel execution of Pyomo scripts.  Solver interaction is performed with a variety of solver interfaces, depending on the solver being used.  A very generic\nsolver interface is supported with AMPL's nl (format).\n\nRelated software\nThe following software packages integrate Pyomo as a library to support optimization modeling and analysis:\n\nSolverStudio lets you use Excel to edit, save and solve optimisation models built using a variety of modeling languages, including Pyomo. Pyomo is bundled with the SolverStudio software.\nTEMOA (Tools for Energy Model Optimization and Assessment) is an open source modeling framework for conducting energy system analysis. The core component of TEMOA is an energy economy optimization model. This model is formulated and optimized using Pyomo.\nMinPower is an open source toolkit for students and researchers in power systems. It is designed to make working with standard power system models simple and intuitive. MinPower uses Pyomo to formulate and optimize these power system models.\nlinopy project, offering similar functionality to Pyomo.\n\nSee also\nAlgebraic modeling language\n\nReferences\nExternal links\nArticles from IBM's developerWorks:\nGift, Noah (5 February 2013). \"Linear optimization in Python, Part 1: Solve complex problems in the cloud with Pyomo\".\nLinear optimization in Python, Part 2: Build a scalable architecture in the cloud\n\"Pyomo Meets Fantasy Football\". 2015-01-27.\nAPOPT Solver for LP, QP, MILP, NLP, and MINLP solutions in Pyomo\n",
  "categories": [
    "Category:Mathematical optimization software",
    "Category:Python (programming language) software",
    "Category:Software using the BSD license"
  ],
  "archived_date": "20241221_182955",
  "source_url": "https://en.wikipedia.org/wiki/Pyomo"
}