{
  "title": "Python Software Foundation",
  "summary": "The Python Software Foundation (PSF) is an American nonprofit organization devoted to the Python programming language, launched on March 6, 2001. The mission of the foundation is to foster development of the Python community and is responsible for various processes within the Python community, including developing the core Python distribution, managing intellectual rights, developer conferences including the Python Conference (PyCon), and raising funds.\nIn 2005, the Python Software Foundation re",
  "content": "---\ntitle: Python Software Foundation\nurl: https://en.wikipedia.org/wiki/Python_Software_Foundation\nlanguage: en\ncategories: [\"Category:501(c)(3) organizations\", \"Category:All stub articles\", \"Category:Articles with short description\", \"Category:Free software project foundations in the United States\", \"Category:Organizations established in 2001\", \"Category:Python (programming language)\", \"Category:Short description matches Wikidata\", \"Category:United States organization stubs\"]\nreferences: 0\nlast_modified: 2024-12-19T13:45:13Z\n---\n\n# Python Software Foundation\n\n## Summary\n\nThe Python Software Foundation (PSF) is an American nonprofit organization devoted to the Python programming language, launched on March 6, 2001. The mission of the foundation is to foster development of the Python community and is responsible for various processes within the Python community, including developing the core Python distribution, managing intellectual rights, developer conferences including the Python Conference (PyCon), and raising funds.\nIn 2005, the Python Software Foundation re\n\n## Full Content\n\nThe Python Software Foundation (PSF) is an American nonprofit organization devoted to the Python programming language, launched on March 6, 2001. The mission of the foundation is to foster development of the Python community and is responsible for various processes within the Python community, including developing the core Python distribution, managing intellectual rights, developer conferences including the Python Conference (PyCon), and raising funds.\nIn 2005, the Python Software Foundation received the Computerworld Horizon Award for \"cutting-edge\" technology.\n\nOverview\nThe PSF focuses on empowering and supporting people within the Python community with grant programs that support sprints, conferences, meetups, user groups, and Python development.  The PSF runs Python Conference (PyCon) US, the leading Python community conference.  The PSF is the primary point of contact for organizations that wish to work with Python, to support Python, or sponsor Python development. The PSF provides a structure by which work, donations, and sponsorships are coordinated worldwide. The PSF also possesses and protects intellectual property associated with Python and the Python community, such as the word \"Python,\" the two-snakes logo, and the terms \"PyLadies\" and \"PyCon.\"\n\nMembership\nThere are five tiers of membership within the PSF. These tiers include:\n\nBasic members – Basic members are individuals or entities who are part of the Python language community and who have decided to declare their support for Python and agree to the community Code of Conduct.\nSupporting members – Supporting members make an annual donation to the PSF to sustain the foundation and support the Python community. Supporting members are eligible to vote.\nManaging members – Managing members are people who commit to working at least five hours per month to support the Python ecosystem, by organizing Python events, managing or contributing to PSF projects, running infrastructure, participating in one of the PSF's working groups, etc. Managing members are eligible to vote.\nContributing members – Contributing members are people who dedicate at least five hours per month working on projects that advance the mission of the PSF, where the work relates to the creation or maintenance of open source software available to the public at no charge. Contributing members are eligible to vote.\n Fellows – Fellows are members who have been nominated by their extraordinary efforts and impact upon Python, the community, and the broader Python ecosystem. Fellows are nominated from the broader community and elevated by a vote of the members. Fellow members are eligible to vote.\n\nCode of Conduct\nSince late 2012, the Python Software Foundation started recommending that all Python conferences create and apply a code of conduct. This is mandatory to any event to be granted funds by the Python Software Foundation.\n\nSee also\nPyLadies\nPyCon\n\nReferences\nFurther reading\nJyh-An Lee (2012). Nonprofit Organizations and the Intellectual Commons. Edward Elgar Publishing. ISBN 978-1-78100-158-5. OCLC 1027550705.\n\nExternal links\nPython Software Foundation\n",
  "categories": [
    "Category:501(c)(3) organizations",
    "Category:All stub articles",
    "Category:Articles with short description",
    "Category:Free software project foundations in the United States",
    "Category:Organizations established in 2001",
    "Category:Python (programming language)",
    "Category:Short description matches Wikidata",
    "Category:United States organization stubs"
  ],
  "archived_date": "20241221_182943",
  "source_url": "https://en.wikipedia.org/wiki/Python_Software_Foundation"
}