{
  "title": "Python Robotics",
  "summary": "Python Robotics (Pyro) is a project designed to create an easy-to-use interface for accessing and controlling a wide variety of real and simulated robots.",
  "content": "---\ntitle: Python Robotics\nurl: https://en.wikipedia.org/wiki/Python_Robotics\nlanguage: en\ncategories: [\"Category:2003 in robotics\", \"Category:2003 software\", \"Category:Bryn Mawr College\", \"Category:Python (programming language) libraries\", \"Category:Robotics suites\", \"Category:SRI International software\"]\nreferences: 0\nlast_modified: 2024-11-24T06:40:51Z\n---\n\n# Python Robotics\n\n## Summary\n\nPython Robotics (Pyro) is a project designed to create an easy-to-use interface for accessing and controlling a wide variety of real and simulated robots.\n\n## Full Content\n\nPython Robotics (Pyro) is a project designed to create an easy-to-use interface for accessing and controlling a wide variety of real and simulated robots.\n\nHistory\nPyrobot was funded from 2003 to 2005 by the National Science Foundation as NSF DUE CCLI-EMD Award number 0231363, \"Beyond LEGOs: Hardware, Software, and Curriculum for the Next Generation Robot Laboratory\". The principal investigators on the NSF grant were Douglas Blank of Bryn Mawr College, Kurt Konolige of SRI International, Deepak Kumar (computer scientist) of Bryn Mawr College, Lisa Meeden of Swarthmore College, and Holly Yanco of University of Massachusetts Lowell.\nPyroBot is a Python library with some C++ code for processing camera images. It has connections to Player, Stage, and Gazebo. It also contains its own simulator written completely in Python. It can directly control a variety of real robots, including the Pioneer, Khepera, AIBO, and Hemisson.\nThe ideas from PyroBot continue to evolve as Myro, short for My Robot, in the Institute for Personal Robots in Education software, although it is no longer for Python only. Myro can be used by many other computer languages as well.\n\nSee also\nRobotics\n\nReferences\nBlank, D. S.; Kumar, D.; Meeden, L.; Yanco, H. (Spring 2006). \"The Pyro Toolkit for AI and Robotics\" (PDF). AI Magazine. 27 (1): 39–50. doi:10.1609/aimag.v27i1.1862. S2CID 7858018.\nBlank, D. S.; Kumar, D.; Meeden, L.; Yanco, H. (September 2004). \"Pyro: A Python-based Versatile Programming Environment for Teaching Robotics\" (PDF). Journal on Educational Resources in Computing. 4 (3): 1. doi:10.1145/1083310.1047569.\nBlank, D.; Meeden, L.; Kumar, D. (2003). Python robotics: An Environment for Exploring Robotics Beyond LEGOs (PDF). SIGCSE '03. Proceedings of the 34th SIGCSE technical symposium on Computer science education. pp. 317–321. doi:10.1145/611892.611996. ISBN 1-58113-648-X.\nBlank, D. S.; Yanco, H.; Kumar, D.; Meeden, L. (Spring 2004). Avoiding the Karel-the-Robot Paradox: A Framework for Making Sophisticated Robotics Accessible (PDF). AAAI Spring Symposium. Accessible Hands-on Artificial Intelligence and Robotics Education. pp. 48–51. ISBN 1-57735-193-2. SS-04-01.\n\nExternal links\nBeyond LEGOs - NSF funding page for Pyrobot\n",
  "categories": [
    "Category:2003 in robotics",
    "Category:2003 software",
    "Category:Bryn Mawr College",
    "Category:Python (programming language) libraries",
    "Category:Robotics suites",
    "Category:SRI International software"
  ],
  "archived_date": "20241220_214822",
  "source_url": "https://en.wikipedia.org/wiki/Python_Robotics"
}