{
  "title": "Python-Ogre",
  "summary": "Python-Ogre is a Python binding for the OGRE 3D engine, designed to provide the functionality and performance of OGRE (written in C++) with the accessibility and ease of use of Python to facilitate the rapid development of 3D games and to make the OGRE engine more accessible to the beginner, who might otherwise be daunted by the technicalities of writing in the native C++. The performance of the engine is decreased in comparison to the original C++ demos, however the original OGRE engine provide",
  "content": "---\ntitle: Python-Ogre\nurl: https://en.wikipedia.org/wiki/Python-Ogre\nlanguage: en\ncategories: [\"Category:All articles lacking reliable references\", \"Category:All articles needing additional references\", \"Category:All articles with dead external links\", \"Category:All articles with topics of unclear notability\", \"Category:Articles lacking reliable references from May 2021\", \"Category:Articles needing additional references from January 2009\", \"Category:Articles with dead external links from April 2018\", \"Category:Articles with multiple maintenance issues\", \"Category:Articles with permanently dead external links\", \"Category:Articles with topics of unclear notability from May 2021\", \"Category:Free 3D graphics software\", \"Category:Free computer libraries\", \"Category:Products articles with topics of unclear notability\", \"Category:Python (programming language)-scriptable game engines\", \"Category:Python (programming language) libraries\"]\nreferences: 0\nlast_modified: 2024-11-26T12:58:14Z\n---\n\n# Python-Ogre\n\n## Summary\n\nPython-Ogre is a Python binding for the OGRE 3D engine, designed to provide the functionality and performance of OGRE (written in C++) with the accessibility and ease of use of Python to facilitate the rapid development of 3D games and to make the OGRE engine more accessible to the beginner, who might otherwise be daunted by the technicalities of writing in the native C++. The performance of the engine is decreased in comparison to the original C++ demos, however the original OGRE engine provide\n\n## Full Content\n\nPython-Ogre is a Python binding for the OGRE 3D engine, designed to provide the functionality and performance of OGRE (written in C++) with the accessibility and ease of use of Python to facilitate the rapid development of 3D games and to make the OGRE engine more accessible to the beginner, who might otherwise be daunted by the technicalities of writing in the native C++. The performance of the engine is decreased in comparison to the original C++ demos, however the original OGRE engine provides such high performance that the performance of Python-Ogre is still more than acceptable for all but the most graphics-intensive games.\n\nFeatures\nPython-Ogre is different from the Ogre3D engine it is based upon as it comes pre-bundled with Python bindings and demos for many other support libraries.\n\nCompatibility\nPython-Ogre has compatibility for all platforms supported by OGRE:\n\nMicrosoft Windows - Binaries are available at the Python-Ogre forums.\nLinux - Build instructions can be found on the Python-Ogre wiki. An Ubuntu binary is currently in development.\nMac OS X - Build instructions can be found on the Python-Ogre wiki. Python-Ogre builds on both Mac OS X 10.4 “Tiger” and Mac OS X 10.5 “Leopard”.\n\nSupport\nThe Python-Ogre wiki, contains build instructions for Windows, Linux, and Mac OS X platforms, as well as tutorials and example code snippets.\nOgre3D hosts the official Python-Ogre forum for helping developers in their use of the engine.\n\nHistory\nThe PyOgre project began in early 2005, where a Python binding for OGRE was first attempted using Boost.Python from the Boost C++ Libraries by two members of the Ogre3D community, Clay Culver and Federico Di Gergorio. This effort ultimately failed, which prompted the use of SWIG as the basis for the C++ binding. This method proved to be rather successful, providing to the community with a somewhat limited and error-prone implementation, but an implementation nonetheless.\nIn mid-2006, Lakin Wecker began work on Python-Ogre, based on the Boost.Python libraries, as was attempted before. This was developed alongside the PyOgre project. He was aided by Andy Miller, who then later took over development of the project with assistance from Roman Yakovenko, Joseph Lisee, and Ben Harling during the evolution of the engine.\nDevelopment of PyOgre was halted in mid-2007, and officially succeeded by Python-Ogre.\nAs of summer of 2008, Andy Miller was actively working on adding new features to Python-Ogre, as well as providing support and maintenance.\nAs of January 2014, the main website at python-ogre.org went offline, but wiki.python-ogre.org is still extant.\n\nIncluded libraries\nThe following libraries are either currently supported, or have at one point in time worked with the Python-Ogre engine. Support for particular libraries are noted in each release. Demos are available for all libraries listed, however, not all demos function, due to the constantly evolving codebase and limited number of active developers.\n\nRenderer\nOgre 1.4.9 Legacy version\nOgre 1.5 \"Shoggoth\" experimental software build\nOgre 1.6 official release\nOgre 1.7 \"Cthugha\" experimental build, including full DirectX 10 support.\nGUI\nBetaGUI—Compact and lightweight OGRE GUI library\nCEGUI—Fully featured general-purpose videogame GUI library\nNavi—HTML/CSS/JS-based OGRE GUI library\nQuickGUI—Easy to use, widget-based OGRE GUI library\nHikari—Flash based OGRE GUI library\nI/O\nOIS—Standard OGRE input library, allowing buffered, object-oriented input\nAudio\nOpenAL—Cross-platform audio API commonly used with Ogre3D\nPhysics\nBullet—Full-featured physics engine with a feature set similar to that of proprietary libraries, offering both rigid body and soft body collision detection\nODE—Open source rigid body collision detection library\nNewton—Offers real-world physics simulation, where accuracy and real-world physical parameters are desired over performance and newer features\nPhysX—Popular, proprietary, high performance, fully featured library\nNxOgre—Wrapper for the PhysX library and Ogre3D, with an editor and other helpful Ogre3D-oriented features\nEffects\nParticle Universe—Scriptable particle effects engine that helps create complex particle effects easily\nCaelum—Realistic sky, atmosphere, weather and lighting simulation\nLibNoise—Portable, open-source, coherent noise-generating library\n\nReferences\nExternal links\nPython-Ogre wiki\nDownloads from SourceForge\nArchive of Python-Ogre.org\nOfficial Python-Ogre forum\nPython-Ogre Google Group\nOhloh page\n",
  "categories": [
    "Category:All articles lacking reliable references",
    "Category:All articles needing additional references",
    "Category:All articles with dead external links",
    "Category:All articles with topics of unclear notability",
    "Category:Articles lacking reliable references from May 2021",
    "Category:Articles needing additional references from January 2009",
    "Category:Articles with dead external links from April 2018",
    "Category:Articles with multiple maintenance issues",
    "Category:Articles with permanently dead external links",
    "Category:Articles with topics of unclear notability from May 2021",
    "Category:Free 3D graphics software",
    "Category:Free computer libraries",
    "Category:Products articles with topics of unclear notability",
    "Category:Python (programming language)-scriptable game engines",
    "Category:Python (programming language) libraries"
  ],
  "archived_date": "20241220_214821",
  "source_url": "https://en.wikipedia.org/wiki/Python-Ogre"
}