{
  "title": "Reddit",
  "summary": "Reddit ( ) is an American social news aggregation, content rating, and forum social network. Registered users (commonly referred to as \"Redditors\") submit content to the site such as links, text posts, images, and videos, which are then voted up or down (\"upvoted\" or \"downvoted\") by other members. Posts are organized by subject into user-created boards called \"subreddits\". Submissions with more upvotes appear towards the top of their subreddit and, if they receive enough upvotes, ultimately on t",
  "content": "---\ntitle: Reddit\nurl: https://en.wikipedia.org/wiki/Reddit\nlanguage: en\ncategories: [\"Category:2005 establishments in Massachusetts\", \"Category:2024 initial public offerings\", \"Category:Aggregation websites\", \"Category:All articles containing potentially dated statements\", \"Category:American social networking websites\", \"Category:Android (operating system) software\", \"Category:Articles containing potentially dated statements from 2018\", \"Category:Articles containing potentially dated statements from April 2018\", \"Category:Articles containing potentially dated statements from August 2018\", \"Category:Articles containing potentially dated statements from August 2021\", \"Category:Articles containing potentially dated statements from December 2023\", \"Category:Articles containing potentially dated statements from July 2018\", \"Category:Articles containing potentially dated statements from November 2009\", \"Category:Articles with short description\", \"Category:Community websites\", \"Category:Companies based in San Francisco\", \"Category:Companies listed on the New York Stock Exchange\", \"Category:Cond\\u00e9 Nast websites\", \"Category:Economy of San Francisco\", \"Category:Formerly open-source or free software\", \"Category:Internet forums\", \"Category:Internet properties established in 2005\", \"Category:Media sharing\", \"Category:Pages including recorded pronunciations\", \"Category:Pages using Sister project links with hidden wikidata\", \"Category:Pages using Sister project links with wikidata namespace mismatch\", \"Category:Pages using the Phonos extension\", \"Category:Proprietary wiki software\", \"Category:Python (programming language) software\", \"Category:Question-and-answer websites\", \"Category:Reddit\", \"Category:Short description is different from Wikidata\", \"Category:Social bookmarking websites\", \"Category:Social media companies of the United States\", \"Category:Tor onion services\", \"Category:Use mdy dates from December 2024\", \"Category:Webarchive template wayback links\", \"Category:Wikipedia indefinitely semi-protected pages\", \"Category:Y Combinator companies\"]\nreferences: 0\nlast_modified: 2024-12-19T13:53:32Z\n---\n\n# Reddit\n\n## Summary\n\nReddit ( ) is an American social news aggregation, content rating, and forum social network. Registered users (commonly referred to as \"Redditors\") submit content to the site such as links, text posts, images, and videos, which are then voted up or down (\"upvoted\" or \"downvoted\") by other members. Posts are organized by subject into user-created boards called \"subreddits\". Submissions with more upvotes appear towards the top of their subreddit and, if they receive enough upvotes, ultimately on t\n\n## Full Content\n\nReddit ( ) is an American social news aggregation, content rating, and forum social network. Registered users (commonly referred to as \"Redditors\") submit content to the site such as links, text posts, images, and videos, which are then voted up or down (\"upvoted\" or \"downvoted\") by other members. Posts are organized by subject into user-created boards called \"subreddits\". Submissions with more upvotes appear towards the top of their subreddit and, if they receive enough upvotes, ultimately on the site's front page. Reddit administrators moderate the communities. Moderation is also conducted by community-specific moderators, who are unpaid volunteers. It is operated by Reddit, Inc., based in San Francisco.\nAs of August 2024, Reddit is the 9th most-visited website in the world. According to data provided by Similarweb, 51.75% of the website traffic comes from the United States, followed by the United Kingdom at 7.15% and Canada at 7.09%.\nReddit was founded by University of Virginia roommates Steve Huffman and Alexis Ohanian, as well as Aaron Swartz, in 2005. Condé Nast Publications acquired the site in October 2006. In 2011, Reddit became an independent subsidiary of Condé Nast's parent company, Advance Publications. In October 2014, Reddit raised $50 million in a funding round led by Sam Altman and including investors Marc Andreessen, Peter Thiel, Ron Conway, Snoop Dogg, and Jared Leto. Their investment valued the company at $500 million at the time. In July 2017, Reddit raised $200 million for a $1.8 billion valuation; Advance Publications remained the majority stakeholder. In February 2019, a $300 million funding round led by Tencent brought the company's valuation to $3 billion. In August 2021, a $700 million funding round led by Fidelity Investments raised that valuation to over $10 billion. The company then reportedly filed for an IPO in December 2021 with a valuation of $15 billion. Reddit debuted on the stock market on the morning of March 21, 2024, with the ticker symbol RDDT. The current—July 2024—market cap is $10 billion. Reddit in modern times has been noted for its role in political activism, with notable left-wing and anti-theist subcultures on the website. \nReddit has received praise for many of its features, such as the ability to create several subreddits for niche communities, being a platform for raising publicity for numerous causes, and has grown to be one of the most visited websites on the Internet. It has also received criticism for spreading misinformation and its voting system encouraging echo chambers. In its early years, Reddit also received controversy over hosting misogynic content, including the doxxing of erotic models and revenge porn.\n\nHistory\nThe idea and initial development of Reddit originated with college roommates Steve Huffman and Alexis Ohanian in 2005, who attended a lecture by programmer-entrepreneur Paul Graham in Boston, Massachusetts, during their spring break from University of Virginia. After speaking with Huffman and Ohanian following the lecture, Graham invited the two to apply to his startup incubator Y Combinator. Their initial idea, My Mobile Menu, was unsuccessful, and was intended to allow users to order food by SMS text messaging. During a brainstorming session to pitch another startup, the idea was created for what Graham called the \"front page of the Internet\". For this idea, Huffman and Ohanian were accepted in Y Combinator's first class. Supported by the funding from Y Combinator, Huffman coded the site in Common Lisp and together with Ohanian launched Reddit in June 2005. Embarrassed by an empty-looking site, the founders created hundreds of fake users for their posts to make it look more populated.\nThe team expanded to include Christopher Slowe in November 2005. Between November 2005 and January 2006, Reddit merged with Aaron Swartz's company Infogami, and Swartz became an equal owner of the resulting parent company, Not A Bug. Swartz went on to help rewrite the software running Reddit using web.py, a web framework he developed. The passage from Aaron Swartz's blog post \"Rewriting Reddit\" reveals that the switch from Lisp to Python, specifically using the web.py framework developed by Swartz, was driven by a desire for simplicity, maintainability, and performance. Despite facing skepticism and critique from the Lisp community, the change was justified by the efficiency and clarity Python provided for the project. This initiative not only influenced the technical evolution of Reddit but also contributed to the broader web development community by inspiring other frameworks and remaining a significant part of Reddit's history. (In 2020, Ohanian claimed that rather than Swartz being a co-founder, the correct description would be that Swartz's company was acquired by Reddit 6 months after he and Huffman had started.)\nHuffman and Ohanian sold Reddit to Condé Nast Publications, owner of Wired, on October 31, 2006, for a reported $10 million to $20 million and the team moved to San Francisco. In November 2006, Swartz blogged complaining about the new corporate environment, criticizing its level of productivity. In January 2007, Swartz was fired for undisclosed reasons.\nHuffman and Ohanian left Reddit in 2009. Huffman went on to co-found Hipmunk with Adam Goldstein, and later recruited Ohanian and Slowe to the new company. After Huffman and Ohanian left Reddit, Erik Martin, who joined the company as a community manager in 2008 and later became general manager in 2011, played a role in Reddit's growth. VentureBeat noted that Martin was \"responsible for keeping the site going\" under Condé Nast's ownership. Martin facilitated the purchase of RedditGifts and led charity initiatives.\nReddit launched two different ways of advertising on the site in 2009. The company launched sponsored content and a self-serve ads platform that year. Reddit launched its Reddit Gold benefits program in July 2010, which offered new features to editors and created a new revenue stream for the business that did not rely on banner ads. On September 6, 2011, Reddit became operationally independent of Condé Nast, operating as a separate subsidiary of its parent company, Advance Publications. Reddit and other websites participated in a 12-hour sitewide blackout on January 18, 2012, in protest of the Stop Online Piracy Act. In May 2012, Reddit joined the Internet Defense League, a group formed to organize future protests.\nYishan Wong joined Reddit as CEO in 2012. Wong resigned from Reddit in 2014, citing disagreements about his proposal to move the company's offices from San Francisco to nearby Daly City, but also the \"stressful and draining\" nature of the position. Ohanian credited Wong with the company's newfound success as its user base grew from 35 million to 174 million. Wong oversaw the company as it raised $50 million in funding and spun off as an independent company. Also during this time, Reddit began accepting the digital currency Bitcoin for its Reddit Gold subscription service through a partnership with bitcoin payment processor Coinbase in February 2013. Ellen Pao replaced Wong as interim CEO in 2014 and resigned in 2015 amid a user revolt over the firing of a popular Reddit employee. During her tenure, Reddit initiated an anti-harassment policy, banned involuntary sexualization, and banned several forums that focused on bigoted content or harassment of individuals.\nAfter five years away from the company, Ohanian and Huffman returned to leadership roles at Reddit: Ohanian became the full-time executive chairman in November 2014 following Wong's resignation, while Pao's departure on July 10, 2015, led to Huffman's return as the company's chief executive. After Huffman rejoined Reddit as CEO, he launched Reddit's iOS and Android apps, improved Reddit's mobile website, and created A/B testing infrastructure. The company launched a major redesign of its website in April 2018. Huffman said new users were turned off from Reddit because it had looked like a \"dystopian Craigslist\". Reddit also instituted several technological improvements, such as a new tool that allows users to hide posts, comments, and private messages from selected redditors in an attempt to curb online harassment, and new content guidelines. These new content guidelines were aimed at banning content inciting violence and quarantining offensive material. Slowe, the company's first employee, rejoined Reddit in 2017 as chief technology officer. Reddit's largest round of funding came in 2017 when the company raised $200 million and was valued at $1.8 billion. The funding supported Reddit's site redesign and video efforts.\nOn June 5, 2020, Ohanian resigned as a member of the board in response to the George Floyd protests and requested to be replaced \"by a Black candidate\". Michael Seibel, then-CEO of Y Combinator, was subsequently named to the board.\nOn December 13, 2020, Reddit announced it had acquired short-form video social platform Dubsmash, hiring its entire team, with the intention of integrating its video creation tools into Reddit.\nOn March 5, 2021, Reddit announced that it had appointed Drew Vollero, who had worked at Snapchat's parent company Snap (SNAP), as its first Chief Financial Officer weeks after the site was thrust into the spotlight due to its role in the GameStop trading frenzy. Vollero's appointment spurred speculation of an initial public offering, a move that senior leaders have considered publicly.\nIn December 2021, Reddit revealed that it had confidentially filed for an initial public offering with the U.S. Securities and Exchange Commission. In June 2022, Reddit acquired MeaningCloud, a natural language processing company.\nIn September 2022, Reddit acquired Spiketrap for an undisclosed sum.\nIn April 2023, Fidelity, the lead investor in Reddit's funding round in 2021, devalued its investment in Reddit by 41% cumulatively. It was revealed in a monthly disclosure that Fidelity valued its stake at $16.6 million, down from its initial investment of $28.2 million which had valued the company at $10 billion. This was followed by an announcement in June 2023 of plans to layoff 5% of Reddit's workforce and to reduce the number of planned hires for the year.\nIn June 2023, The BlackCat hacker gang claimed responsibility for a February 2023 breach of Reddit's systems. On its data leak site, it claimed that it stole 80 GB of compressed data and demanded a $4.5 million ransom from Reddit. This attack did not involve data encryption like typical ransomware campaigns.\nIn February 2024, Reddit announced a partnership with Google in a deal worth about $60 million per year, to license its real-time user content to train Google's AI model. The partnership also lets Reddit get access to Google's \"Vertex AI\" service which would help improve search results on Reddit.\nIn March 2024 it was announced that Reddit would target a valuation of up to $6.4 billion in its U.S. IPO. The platform intends to sell 22 million class A common shares at a price between $31 and $34 alongside some of its investors, looking to raise up to $748 million.\nReddit's initial public offering opened on March 20, 2024, at $34 per share and a $6.4 billion valuation. They went public the next day on the New York Stock Exchange at $47 per share and rose to $50.44 at market close on their first day of trading, reaching a market cap of $9.5 billion.\nOn May 16, 2024, it was announced that Reddit and OpenAI had reached a deal that will allow OpenAI access to the Reddit API to train its models, while Reddit will receive certain AI tools for moderators and users.\nReddit's share price increased by 42% after reporting its third-quarter results in October 2024, where it recorded its first quarterly profit. The surge was also attributed in part to increases in revenue from AI content licensing and advertising, and reaching close to 100 million active users.\nIn December 2024, Reddit announced Reddit Answers, an AI search tool that summarizes conversations in response to a question from the user.\n\nSite overview\nReddit is a website comprising user-generated content—including photos, videos, links, and text-based posts—and discussions of this content in what is essentially a bulletin board system. The name \"Reddit\" is a play-on-words with the phrase \"read it\", i.e., \"I read it on Reddit.\" According to Reddit, in 2019, there were approximately 430 million monthly users, who are known as \"redditors\". The site's content is divided into categories or communities known on-site as \"subreddits\", of which there are more than 138,000 active communities.\nAs a network of communities, Reddit's core content consists of posts from its users. Users can comment on others' posts to continue the conversation. A key feature to Reddit is that users can cast positive or negative votes, called upvotes and downvotes respectively, for each post and comment on the site. The number of upvotes or downvotes determines the posts' visibility on the site, so the most popular content is displayed to the most people. Users can also earn \"karma\" for their posts and comments, a status that reflects their standing within the community and their contributions to Reddit. Posts are sometimes automatically archived after six months, meaning they can no longer be commented or voted on.\nThe most popular posts from the site's numerous subreddits are visible on the front page to those who browse the site without an account. By default for those users, the front page will display the subreddit r/popular, featuring top-ranked posts across all of Reddit, excluding not-safe-for-work communities and others that are most commonly filtered out by users (even if they are safe for work). The subreddit r/all originally did not filter topics, but as of 2021 it does not include not-safe-for-work content. Registered users who subscribe to subreddits see the top content from the subreddits to which they subscribe on their personal front pages. Additionally, some subreddits have a karma and account age requirement to discourage bots and spammers from posting.\nFront-page rank—for both the general front page and for individual subreddits—is determined by a combination of factors, including the age of the submission, positive (\"upvoted\") to negative (\"downvoted\") feedback ratio, and the total vote-count.\n\nUsers and moderators\nRegistering an account with Reddit is free and requires an email address. In addition to commenting and voting, registered users can also create their own subreddit on a topic of their choosing. In Reddit style, usernames begin with \"u/\". Noteworthy redditors include u/Poem_for_your_sprog, who responds to messages across Reddit in verse, u/Shitty_Watercolour who posts paintings in response to posts, and u/spez, the CEO of Reddit (Steve Huffman).\nSubreddits are overseen by moderators, Reddit users who earn the title by creating a subreddit or being promoted by a current moderator. Reddit users may also request to moderate a sub that has no moderators or very inactive ones in r/redditrequest. These requests are reviewed by the Reddit admins. Moderators are volunteers who manage their communities, set and enforce community-specific rules, remove posts and comments that violate these rules, and generally work to keep discussions in their subreddit on topic. Admins, by contrast, are paid to work for Reddit.\nReddit also releases transparency reports annually which have information like how many posts have been taken down by moderators and for what reason. It also details information about requests law enforcement agencies have made for information about users or to take down content. In 2020, Reddit removed 6% of posts made on the platform (approx. 233 million). More than 99% of removals were marked as spam; the remainder made up of a mix of other offensive content. Around 131 million posts were removed by the automated moderator and the rest were taken down manually.\nIt is estimated that Reddit's moderators do a total of 466 hours of work every day, which totals up to $3.4 million in unpaid work each year. This roughly equates to 2.8% of the company's annual revenue.\n\nSubreddits\nSubreddits (officially called communities) are user-created areas of interest where discussions on Reddit are organized. There are about 138,000 active subreddits (among a total of 1.2 million) as of July 2018. Subreddit names begin with \"r/\"; for instance, \"r/science\" is a community devoted to discussing scientific publications, while \"r/gaming\" is a community devoted to discussing video games, and \"r/worldnews\" is for posting news articles from around the world.\nIn a 2014 interview with Memeburn, Erik Martin, then the general manager of Reddit, remarked that their \"approach is to give the community moderators or curators as much control as possible so that they can shape and cultivate the type of communities they want\". Subreddits often use themed variants of Reddit's alien mascot, Snoo, in the visual styling of their communities.\n\nOther features\nReddit Premium (formerly Reddit Gold) is a premium membership that allows users to view the site ad-free. Until 2023, subscribers could also use coins to award posts or comments they valued, generally due to humorous or high-quality content. Reddit Premium unlocks several features not accessible to regular users, such as comment highlighting, exclusive subreddits such as r/lounge, a personalized Snoo (known as a \"snoovatar\"), and a Reddit premium trophy that can be displayed on the user's profile. Reddit Gold was renamed to Reddit Premium in 2018. In addition to gold coins, users were able to gift silver and platinum coins to other users as rewards for quality content.\nOn the site, redditors commemorate their \"cake day\" once a year, on the anniversary of the day their account was created. Cake day adds an icon of a small slice of cake next to the user's name for 24 hours.\nIn August 2021, the company introduced a TikTok-like short-form video feature for iOS that lets users rapidly swipe through a feed of short video content. In December 2021, the company introduced a Spotify Wrapped-like feature called Reddit Recap that recaps various statistics from January 1 to November 30 about each individual user, such as how much time they spent on Reddit, which communities they joined, and the topics that they engaged with, and allows the user to view it.\nOn July 7, 2022, Reddit announced 'blockchain-backed Collectible Avatars', customizable avatars which are available on the subreddit r/CollectibleAvatars for purchase separate from Reddit Premium. The avatars were created by independent artists who post work on other subreddits, and who receive a portion of the profits. They use Reddit's Polygon blockchain-powered digital wallet the Vault. Richard Lawler of The Verge described them as \"non-fungible tokens (NFTs) that are available for purchase in the Reddit Avatar Builder\".\n\nChat features\nIn 2017, Reddit developed its own real-time chat software for the site. While some established subreddits have used third-party software to chat about their communities, the company built chat functions that it hopes will become an integral part of Reddit. Individual chat rooms were rolled out in 2017 and community chat rooms for members of a given subreddit were rolled out in 2018.\nReddit Talk was announced in April 2021 as a competitor to Clubhouse. Reddit Talk lets subreddit moderators start audio meeting rooms that mimic Clubhouse in design. In 2022, Reddit Talk was updated to support recording audio rooms and work on the web version of Reddit. A desktop app is reportedly slated for a late February release.\n\nDiscontinued features\nReddit Public Access Network, commonly known as RPAN, was a live streaming service run by Reddit. Viewers interacted with streams by upvoting or downvoting, chatting, and giving paid awards. During the off-air hours, 24/7 streaming was possible to the dedicated subreddits, but with limited slots and capabilities. On August 19, 2019, Reddit announced RPAN. It was said to be in testing, but they were experimenting with making it a permanent program, as well as a way to increase revenue for the platform. Later, a five-day testing period began. During the testing period, streaming was for a select group of users, allowing 30 minutes of streaming per person and 100 slots. On July 1, 2020, RPAN Studio was released, an application that allows users to broadcast live from desktop computers. RPAN Studio has been built on top of OBS, an open-source streaming and recording program. On January 28, 2021, Reddit permanently increased streaming times to three hours. RPAN was officially discontinued on November 15, 2022.\nIn 2019, Reddit tested a new feature that allowed users to tip others. It was only made available for a user named Chris who goes by the alias u/shittymorph, who was known for posting well-written comments, only for them to end with the same copypasta referencing the 1998 Hell in a Cell match between wrestlers The Undertaker and Mankind.\n\nTechnology and design\nUnderlying code\nReddit was originally written in Common Lisp but was rewritten in Python in December 2005 for wider access to code libraries and greater development flexibility. The Python web framework that Swartz developed to run the site, web.py, is available as an open source project. As of November 10, 2009, Reddit used Pylons as its web framework. Reddit was an open source project from June 18, 2008, until 2017. During that time, all of the code and libraries written for Reddit were freely available on GitHub, with the exception of the anti-spam/cheating portions. In a September 2017 announcement, the company stated that \"we've been doing a bad job of keeping our open-source product repos up to date\", partially because \"open-source makes it hard for us to develop some features 'in the clear'... without leaking our plans too far in advance\", prompting the decision to archive its public GitHub repos.\n\nHosting and servers\nAs of November 10, 2009, Reddit decommissioned its servers which it owned and migrated to Amazon Web Services, using EC2 for application services and S3 for storage. Reddit uses PostgreSQL as its primary datastore. As part of an effort to be more data-driven, Reddit built a data analytics pipeline on top of Apache Kafka and Hive as its data warehouse. It uses Amazon's Elastic MapReduce to run Hadoop workloads across Hive and stores results in S3, eventually putting data in Amazon RDS for visualization purposes. It also uses HAProxy for load balancing and Jenkins and Apache Pig in the data pipeline. Reddit uses Redis and its implementation of HyperLogLog to cache approximate page views with an underlying Apache Cassandra cluster for persistence. For general caching of queries and memoization, Reddit uses memcached behind Facebook's memcached router, mcrouter. In 2017, it had almost 3.3 terabytes of memory on 54 EC2 instances dedicated to caching split across different pools. Services at Reddit are structured around a common foundation named Baseplate. It was originally implemented in Python, but since 2019, parts of it have been reimplemented in Go for better performance. Reddit also runs its services through Kubernetes and uses Spinnaker for continuous delivery.\nIn early 2009, Reddit started using jQuery. In 2017, Reddit announced it adopted TypeScript for its UI redesign.\nReddit's search function has had many iterations and currently uses Lucidworks Fusion to implementation.\n\nMobile apps\nIn 2010, Reddit released its first mobile web interface for easier reading and navigating the website on touch screen devices. For several years, redditors relied on third-party apps to access Reddit on mobile devices. In October 2014, Reddit acquired one of them, Alien Blue, which became the official iOS Reddit app. Reddit removed Alien Blue and released its official application, Reddit: The Official App, on Google Play and the iOS App Store in April 2016. The company released an app for Reddit's question-and-answer Ask Me Anything subreddit in 2014. The app allowed users to see active Ask Me Anythings, receive notifications, ask questions and vote.\n\nProduct and design changes\nThe site has undergone several products and design changes since it originally launched in 2005. When it initially launched, there were no comments or subreddits. Comments were added in 2005 and interest-based groups (called 'subreddits') were introduced in 2008. Allowing users to create subreddits has led to much of the activity that redditors would recognize that helped define Reddit. These include subreddits \"WTF\", \"funny\", and \"AskReddit\". Reddit rolled out its multireddit feature, the site's biggest change to its front page in years, in 2013. With the multireddits, users see top stories from a collection of subreddits.\nIn 2015, Reddit enabled embedding and as a result users could share Reddit content on other sites. In 2016, Reddit began hosting images using a new image uploading tool, a move that shifted away from the uploading service Imgur that had been the de facto service. Users still can upload images to Reddit using Imgur. Reddit's in-house video uploading service for desktop and mobile launched in 2017. Previously, users had to use third-party video uploading services, which Reddit acknowledged was time-consuming for users.\nReddit released its \"spoiler tags\" feature in January 2017. The feature warns users of potential spoilers in posts and pixelates preview images. Reddit unveiled changes to its public front page, called r/popular, in 2017; the change creates a front page free of potentially adult-oriented content for unregistered users.\nIn late 2017, Reddit declared it wanted to be a mobile-first site, launching several changes to its apps for iOS and Android. The new features included user-to-user chat, a theater mode for viewing visual content, and mobile tools for the site's moderators. \"Mod mode\" lets moderators manage content and their subreddits on mobile devices.\nReddit launched its redesigned website in 2018, with its first major visual update in a decade. Development for the new site took more than a year. It was the result of an initiative by Huffman upon returning to Reddit, who said the site's outdated look deterred new users. The new site features a hamburger menu to help users navigate the site, different views, and new fonts to better inform redditors if they are clicking on a Reddit post or an external link. The nominal goal was not only for Reddit to improve its appearance, but also to make it easier to accommodate a new generation of Reddit users. Additionally Reddit's growth had strained the site's back end; Huffman and Reddit Vice President of Engineering Nick Caldwell told The Wall Street Journal's COI Journal that Reddit needed to leverage artificial intelligence and other modern digital tools. For years, registered users could opt-out of the redesign by using the old.reddit.com domain. On May 15, 2024, the dedicated login flow was removed from the old domain, although site admins said they had \"no plans\" to remove the old domain entirely.\nIn November 2023, Fast Company reported that Reddit began rolling out a comprehensive rebrand, including a new logo, typeface, brand colors, and an updated version of its mascot Snoo, as part of its preparation for a potential 2024 IPO and in response to its expanding user base and global reach.\n\nLogo\nReddit's logo consists of a time-traveling alien named Snoo and the company name stylized as \"reddit\". The alien has an oval head, pom-pom ears, and an antenna. Its colors are black, white, and orange-red. The mascot was created in 2005 while company co-founder Alexis Ohanian was an undergraduate at the University of Virginia. Ohanian drew a doodle of the creature while he was bored during a marketing class. Originally, Ohanian sought to name the mascot S'new, a play on \"What's new?\", to tie the mascot into Reddit's premise as the \"front page of the Internet\". Eventually, the name Snoo was chosen. In 2011, Ohanian outlined the logo's evolution with a graphic that showcased several early versions, including various spellings of the website name, such as \"Reditt\".\nSnoo is genderless, so the logo is moldable. Over the years, the Reddit logo has frequently changed for holidays and other special events. Many subreddits have a customized Snoo logo to represent the subreddit. Redditors can also submit their own logos, which sometimes appear on the site's front page, or create their own customized versions of Snoo for their communities (or \"subreddits\"). When Reddit revamped its website in April 2018, the company imposed several restrictions on how Snoo can be designed: Snoo's head \"should always appear blank or neutral\", Snoo's eyes are orange-red, and Snoo cannot have fingers. Snoo's purpose is to discover and explore humanity.\n\nCorporate affairs\nReddit is a public company based in San Francisco. In 2023, it downsized from an office in the Mid-Market neighborhood to an office in the South of Market neighborhood. Reddit doubled its headcount in 2017; as of 2018, it employed approximately 350 people. In 2017, the company was valued at $1.8 billion during a $200 million round of new venture funding. The company was previously owned by Condé Nast, but was spun off as an independent company. As of April 2018, Advance Publications, Condé Nast's parent company, retained a majority stake in Reddit.\nReddit's key management personnel includes co-founder and CEO Steve Huffman, Chief Technology Officer Chris Slowe, who was the company's original lead engineer, and Chief Operating Officer Jen Wong, a former president of digital and chief operating officer at Time Inc.\nReddit does not disclose its revenue figures. The company generates revenue in part through advertising and premium memberships that remove ads from the site.\nAs part of its company culture, Reddit operates on a no-negotiation policy for employee salaries. The company offers new mothers, fathers, and adoptive parents up to 16 weeks of parental leave.\nAs of August 2021, Reddit is valued at more than $10 billion following a $410 million funding round. The company was looking to hire investment bankers and lawyers to assist in making an initial public offering. However, CEO Steve Huffman said the company has not decided on the timing for when to go public. In December 2021, Reddit announced they had filed a draft registration statement with the SEC regarding their prospective IPO. Reddit finally made its debut on the stock market on March 21, 2024.\n\nAdvertising\nIn February 2013, Betabeat published a post that recognized the influx of multinational corporations like Costco, Taco Bell, Subaru, and McDonald's posting branded content on Reddit that was made to appear as if it was original content from legitimate Reddit users. PAN Communications wrote that marketers want to \"infiltrate the reddit community on behalf of their brand,\" but emphasized that \"self-promotion is frowned upon\" and Reddit's former director of communications noted that the site is \"100 percent organic.\" She recommended that advertisers design promotions that \"spark conversations and feedback.\" She recommended that businesses use AMAs to get attention for public figures but cautioned \"It is important to approach AMAs carefully and be aware that this may not be a fit for every project or client.\" Nissan ran a successful branded content promotion offering users free gifts to publicize a new car, though the company was later ridiculed for suspected astroturfing when the CEO only answered puff piece questions on the site. Taylor described these situations as \"high risk\" noting: \"We try hard to educate people that they have to treat questions that may seem irreverent or out of left field the same as they would questions about the specific project they are promoting.\"\nReddit's users tend to be more privacy-conscious than on other websites, often using tools like ad-blocking software and proxies, and they dislike \"feeling manipulated by brands\" but respond well to \"content that begs for intelligent viewers and participants.\" Lauren Orsini writes in ReadWrite that \"Reddit's huge community is the perfect hype machine for promoting a new movie, a product release, or a lagging political campaign\" but there is a \"very specific set of etiquette. Redditors don't want to advertise for you, they want to talk to you.\" Journalists have used the site as a basis for stories, though they are advised by the site's policies to respect that \"reddit's communities belong to their members\" and to seek proper attribution for people's contributions.\nReddit announced that they would begin using VigLink to redirect affiliate links in June 2016.\nSince 2017, Reddit has partnered with companies to host sponsored AMAs and other interactive events, increased advertising offerings, and introduced efforts to work with content publishers.\nIn 2018, Reddit hired Jen Wong as COO, responsible for the company's business strategy and growth, and introduced native mobile ads. Reddit opened a Chicago office to be closer to major companies and advertising agencies located in and around Chicago. In 2019, Reddit hired former Twitter ad director Shariq Rizvi as its vice president of ad products and engineering.\n\nCommunity and culture\nThe website is known for its open nature and diverse user community that generate its content. Its demographics allows for wide-ranging subject areas, as well as the ability for smaller subreddits to serve more niche purposes. The possibilities that subreddits provide create new opportunities for raising attention and fostering discussion across various areas. In gaining popularity in terms of unique users per day, Reddit has been a platform to raise publicity for a number of causes. Additionally, the user base of Reddit has given birth to other websites, including image sharing community and image host Imgur, which started in 2009 as a gift to Reddit's community. In its first five months, it jumped from a thousand hits per day to a million total page views.\nData collected by Pew Research Center in 2013 found that Reddit users were much more likely to be from urban communities than rural ones. Women were greatly under-represented on the website. Reddit's userbase had a disproportionately high number of Hispanic users. With regards to education, high school dropouts were over-represented among Reddit users.\nReddit has been noted for its role in political activism, with notable left-wing and anti-theist subcultures on the website.nStatistics from Google Ad Planner suggest that 74% of Reddit users are male. In 2016, the Pew Research Center published research showing that 4% of U.S. adults use Reddit, of which 67% are men, while 78% of users get news from Reddit. Users tend to be significantly younger than average with less than 1% of users being 65 or over. Politically, 43% of Reddit users surveyed by Pew Research Center in 2016 identified as liberal, with 38% identifying as moderate and 19% as conservative.\nReddit is known in part for its passionate user base, which has been described as \"offbeat, quirky, and anti-establishment\". Similar to the \"Slashdot effect\", the Reddit effect occurs when a smaller website crashes due to a high influx of traffic after being linked to on Reddit; this is also called the Reddit \"hug of death\".\n\nPhilanthropy\nUsers have used Reddit as a platform for their charitable and philanthropic efforts. Redditors raised more than $100,000 for charity in support of comedians Jon Stewart's and Stephen Colbert's Rally to Restore Sanity and/or Fear; more than $180,000 for Haiti earthquake relief efforts; and delivered food pantries' Amazon wish lists. In 2010, Christians, Muslims, and atheists held a friendly fundraising competition, where the groups raised more than $50,000. A similar donation drive in 2011 saw the atheism subreddit raise over $200,000 for charity. In February 2014, Reddit announced it would donate 10% of its annual ad revenue to non-profits voted upon by its users. As a result of the campaign, Reddit donated $82,765 each to Electronic Frontier Foundation, Planned Parenthood Federation of America, Doctors Without Borders, Erowid Center, Wikimedia Foundation, Multidisciplinary Association for Psychedelic Studies, NPR, Free Software Foundation, Freedom From Religion Foundation, and Tor Project.\n\nActivism\nReddit has been used for a wide variety of political engagement including the presidential campaigns of Barack Obama, Donald Trump, Hillary Clinton, and Bernie Sanders. It has also been used for self-organizing sociopolitical activism such as protests, communication with politicians and active communities. Reddit has become a popular place for worldwide political discussions.\n\nMarch for Science\nThe March for Science originated from a discussion on Reddit over the deletion of all references to climate change from the White House website, about which a user commented that \"There needs to be a Scientists' March on Washington\". On April 22, 2017, more than 1 million scientists and supporters participated in more than 600 events in 66 countries across the globe.\n\nInternet privacy, neutrality and anonymity\nReddit users have been engaged in the defense of Internet privacy, net neutrality and Internet anonymity.\nReddit created an Internet blackout day and was joined by Wikipedia and other sites in 2012 in protest of the Stop Online Piracy and Protect IP acts. On January 18, Reddit participated in a 12-hour sitewide blackout to coincide with a congressional committee hearing on the measures. During that time, Reddit displayed a message on the legislation's effects on Reddit, in addition to resources on the proposed laws. In May 2012, Reddit joined the Internet Defense League, a group formed to organize future protests.\nThe site and its users protested the Federal Communications Commission as it prepared to scrap net neutrality rules. In 2017, users upvoted \"Battle for the Net\" posts enough times that they filled up the entire front page. On another day, the front page was overtaken by posts showcasing campaign donations received by members of Congress from the telecommunications industry. Reddit CEO Steve Huffman has also advocated for net neutrality rules. In 2017, Huffman told The New York Times that without net neutrality protections, \"you give internet service providers the ability to choose winners and losers\". On Reddit, Huffman urged redditors to express support for net neutrality and contact their elected representatives in Washington, D.C. Huffman said that the repeal of net neutrality rules stifles competition. He said he and Reddit would continue to advocate for net neutrality.\n\n\"Restoring Truthiness\" campaign\nAs a response to Glenn Beck's August 28, 2010, Restoring Honor rally, in September 2010 Reddit users started a movement to persuade satirist Stephen Colbert to have a counter-rally in Washington, D.C. The movement, which came to be called \"Restoring Truthiness\", was started by user mrsammercer, in a post where he described waking up from a dream in which Stephen Colbert was holding a satirical rally in D.C. Over $100,000 was raised for charity to gain the attention of Colbert. The campaign was mentioned on-air several times, and when the Rally to Restore Sanity and/or Fear was held in Washington, D.C., on October 30, 2010, thousands of redditors made the journey.\nDuring a post-rally press conference, Reddit co-founder Ohanian asked, \"What role did the Internet campaign play in convincing you to hold this rally?\" Jon Stewart responded by saying that, though it was a very nice gesture, he and Colbert had already thought of the idea and the deposit for using the National Mall was already paid during the summer, so it acted mostly as a \"validation of what we were thinking about attempting\". In a message to the Reddit community, Colbert later added, \"I have no doubt that your efforts to organize and the joy you clearly brought to your part of the story contributed greatly to the turnout and success.\"\n\nCensorship of Reddit\nReddit has been blocked in multiple countries due to Internet censorship performed by the governments of some countries. As of October 2023, Reddit is blocked in Indonesia, China, North Korea, Turkey, and partially blocked in Bangladesh. Reddit was blocked in Russia in 2015 and later unblocked.\n\nChina\nIn June 2015, Reddit was blocked in China for a few weeks.\n\nIndia\nISPs in India were found to be blocking traffic over Reddit for intermittent periods in some regions in 2019.\n\nIndonesia\nSince May 2014, Reddit has been blocked in Indonesia by the Ministry of Communication and Information Technology for hosting content containing nudity.\n\nRussia\nIn August 2015, the Federal Drug Control Service of Russia determined that Reddit was promoting conversations about psychedelic drugs. The Roskomnadzor banned the website, citing advice on how to grow magic mushrooms as the reason. The Russian government had asked Reddit before to remove drug-related posts to no response. The site was later unblocked.\n\nCommunity traditions\nApril Fools' Day\nOver the years, Reddit has done multiple pranks and events for April Fools' Day. Since 2013, they have often taken the form of massive social experiments. Noteworthy events include The Button in 2015, which included a global \"button\" that could only be clicked once per user. It attracted more than a million clicks. \n2017's experiment r/place involved making a collaborative pixel art. Millions of users worked together in communities to place pixels one at a time to create a larger canvas. This experiment was very successful and repeated in 2022's April Fools experiment and in 2023.\n\nAMAs (\"Ask Me Anything\")\nAMAs, or \"Ask Me Anything\" interviews, are among Reddit's most popular features. As of August 1, 2018, r/IAmA, which is the most popular community for AMAs, was the eighth most popular subreddit on the site with 17.7 million subscribers. During an AMA on r/IAmA and other subreddits, users can ask questions to interviewees. Notable participants include former-United States President Barack Obama (while campaigning for the 2012 election), Bill Gates (multiple times), and Donald Trump (also while campaigning). AMAs have featured CEO Steve Huffman, as well as figures from entertainment industries around the world (including Priyanka Chopra and George Clooney), literature (Margaret Atwood), space (Buzz Aldrin), privacy (Edward Snowden), fictional characters (including Borat and Cookie Monster) and others, such as experts who answered questions about the transgender community. The Atlantic wrote that an AMA \"imports the aspirational norms of honesty and authenticity from pseudonymous Internet forums into a public venue\". On May 24, 2024, Reddit introduced dedicated platform features for hosting AMAs, allowing hosts to schedule and promote them, and participants to RSVP to them.\n\nRedditGifts\nRedditGifts was a program that offers gift exchanges throughout the year. The fan-made RedditGifts site was created in 2009 for a Secret Santa exchange among Reddit users, which has since become the world's largest and set a Guinness World record. In 2009, 4,500 redditors participated. For the 2010 holiday season, 92 countries were involved in the secret Santa program. There were 17,543 participants, and $662,907.60 was collectively spent on gift purchases and shipping costs. In 2014, about 200,000 users from 188 countries participated. Several celebrities have participated in the program, including Bill Gates, Alyssa Milano, and Snoop Dogg. Eventually, the secret Santa program expanded to various other occasions through RedditGifts, which Reddit acquired in 2011.\nOn June 9, 2021, Reddit announced the shutdown of Reddit Gifts, effective at the conclusion of the 2021 Secret Santa exchange; new account registration was disabled when the announcement was issued.\n\nGlobal Reddit Meetup Day\nThe online Reddit community conducts real-world meetups across the globe each summer. These in-person meetups are called Global Reddit Meetup Day.\n\nBrigading\nAs with most public online forums, Reddit is vulnerable to the use of disruptive or manipulative practices by its members, from sources such as troll farms, click farms and astroturfing.\nAnother example is brigading, notable in the case of Reddit as it is often cited as the origin of the practice and use of the word in this context. Though all of these examples are in some form, against the rules of Reddit's content policy, at least in the case of brigading, they are not always malicious in intent. A notable example is the case of \"Mr. Splashy Pants\", when organized brigading of another website, by redditors, appears to have been tacitly encouraged by the Reddit administration. In the aftermath, the target of this vote brigading appeared to take it in good humor.\n\nMister Splashy Pants\nReddit communities occasionally coordinate Reddit-external projects such as skewing polls on other websites, like the 2007 incident when Greenpeace allowed web users to decide the name of a humpback whale it was tracking. Reddit users voted en masse to name the whale \"Mister Splashy Pants\", and Reddit administrators encouraged the prank by changing the site logo to a whale during the voting. In December of that year, Mister Splashy Pants was announced as the winner of the competition.\n\nControversies\nIn general, the website grants subreddit moderators discretion in deciding what content is and is not allowed on their subreddits, so long as site-wide rules are not being violated. This relative freedom has allowed for a wide diversity of subreddits to exist, and some of them have attracted controversy.\n\nMany of the default subreddits are highly moderated, with the \"science\" subreddit banning climate change denialism, and the \"news\" subreddit banning opinion pieces and columns. Reddit has changed its site-wide editorial policies several times, sometimes in reaction to controversies. Reddit has historically been a platform for objectionable but legal content, and in 2011, news media covered the way that jailbait was being shared on the site before the site changed their policies to explicitly ban \"suggestive or sexual content featuring minors\". Following some controversial incidents of Internet vigilantism, Reddit introduced a strict rule against the online publication of non-public personally-identifying information (a common internet harassment tool colloquially known as doxxing) via the site. Those who break the rule are subject to a site-wide ban, which can result in the deletion of their user-generated content.\nDue to Reddit's decentralized moderation, user anonymity, and lack of fact-checking systems, the platform is highly prone to spreading misinformation and disinformation. It has been suggested that those who use Reddit should exercise caution in taking user-created unsourced content as fact. Concerns have been raised in particular about dangerous medical misinformation on the platform. A 2022 study of 300 comments and posts discussing urinary tract infections found that fewer than 1% cited a source for their content, and several contained harmful medical misinformation that may dissuade readers from seeking medical care or lead to dangerous self-medication, such as proposing fasting as a cure for UTIs.\nReddit communities exhibit the echo chamber effect, in which repeated unsourced statements come to be accepted among the community as fact, leading to distorted worldviews among users. It has been suggested that since 2019, Russian state-sponsored troll accounts and bots have engaged in a broad campaign to take over subreddits, such as r/antiwar.\n\n2013 Boston bombing suspect misidentifications\nFollowing the Boston Marathon bombing in April 2013, Reddit faced criticism after users wrongly identified a number of people as suspects in the Subreddit r/FindBostonBombers. Notable among misidentified bombing suspects was Sunil Tripathi, a student reported missing before the bombings took place. A body reported to be Sunil's was found in Providence River in Rhode Island on April 25, according to Rhode Island Health Department. The cause of death was not immediately known, but authorities said they did not suspect foul play. The family later confirmed Tripathi's death was a result of suicide. Reddit general manager Erik Martin later issued an apology for this behavior, criticizing the \"online witch hunts and dangerous speculation\" that took place on the website. The incident was later referenced in the season 5 episode of the CBS TV series The Good Wife titled \"Whack-a-Mole\", as well as The Newsroom.\n\n2014 celebrity photo hacks\nIn August, private sexual photos from the celebrity photo hack were widely disseminated across the site. A dedicated subreddit, \"TheFappening\", was created for this purpose, and contained links to most if not all of the criminally obtained explicit images. Some images of McKayla Maroney and Liz Lee were identified by redditors and outside commentators as child pornography because the photos were taken when the women were underage. The subreddit was banned on September 6. The scandal led to wider criticisms concerning the website's administration from The Verge and The Daily Dot.\n\n2015 CEO change and subreddit bannings\nAfter Ellen Pao became CEO in 2014, she was initially a target of criticism by users who objected to the deletion of content critical of herself and her husband. Later on June 10, 2015, Reddit shut down the 150,000-subscriber \"fatpeoplehate\" subreddit and four others citing issues related to harassment. This move was seen as very controversial; some commenters said that the bans went too far, while others said that the bans did not go far enough. One of the latter complaints concerned a subreddit that was \"expressing support\" for the perpetrator of the Charleston church shooting. Responding to the accusations of \"skewed enforcement\", Reddit reaffirmed their commitment to free expression and stated, \"There are some subreddits with very little viewership that get highlighted repeatedly for their content, but those are a tiny fraction of the content on the site.\"\nOn July 2, Reddit began experiencing a series of blackouts as moderators set popular subreddit communities to private, in an event dubbed \"AMAgeddon\", a portmanteau of AMA (\"ask me anything\") and Armageddon. This was done in protest of the recent firing of Victoria Taylor, an administrator who helped organize citizen-led interviews with famous people on the popular AMA subreddit. Organizers of the blackout also expressed resentment about the recent severance of the communication between Reddit and the moderators of subreddits. The blackout intensified on July 3 when former community manager David Croach gave an AMA about being fired. Before deleting his posts, he stated that Ellen Pao dismissed him with one year of health coverage when he had cancer and did not recover quickly enough. Following this, a Change.org petition to remove Pao as CEO of Reddit Inc. reached over 200,000 signatures. Pao posted a response on July 3 as well as an extended version of it on July 6 in which she apologized for bad communication and not delivering on promises. She also apologized on behalf of the other administrators and noted that problems already existed over the past several years. On July 10, Pao resigned as CEO and was replaced by former CEO and co-founder Steve Huffman.\nIn August, Steve Huffman introduced a policy which led to the banning of several offensive and sexual communities. Included in the ban was lolicon, to which Huffman referred as \"animated CP [child porn]\". Some subreddits had also been \"quarantined\" due to having \"highly-offensive or upsetting content\" such as r/European, r/swedenyes, r/drawpeople, r/kiketown, r/blackfathers, r/greatapes, and r/whitesarecriminals.\n\n2023 API changes\nIn April 2023, Reddit announced its intentions to charge large fees for its application programming interface (API), a feature of the site that has existed for free since 2008, causing an ongoing dispute. The move forced multiple third-party applications to shut down and threatened accessibility applications and moderation tools.\nOn May 31, Apollo developer Christian Selig stated that Reddit's pricing would force him to cease development on the app. The resulting outcry from the Reddit community ultimately led to a planned protest from June 12 to 14 in which moderators for the site would make their communities private or restricted posting. Following the release of an internal memo from Reddit CEO Steve Huffman and defiance from Reddit, some moderators have continued their protest.\nAlternate forms of protest have emerged in the days following the initial blackout. Upon reopening, users of r/pics, r/gifs, and r/aww voted to exclusively post about comedian John Oliver. Multiple subreddits labeled themselves as not safe for work (NSFW), affecting advertisements and resulting in administrators removing the entire moderation team of some subreddits. The protest has been compared to a strike.\n/r/place had its third launch on July 20, 2023; however, the launch was heavily protested by users and developers due to the event following the 2023 Reddit API controversy; Reddit CEO Steve Huffman's decision to make it prohibitively expensive for third-party app developers drew widespread condemnation.\n\nOther controversies\n2014\nOn December 18, Reddit took a criticized action of banning a subreddit, \"SonyGOP\", that was being used to distribute hacked Sony files.\n\n2016\nIn May, Steve Huffman said in an interview at the TNW Conference that, unlike Facebook, which \"only knows what [its users are] willing to declare publicly\", Reddit knows its users' \"dark secrets\" at the same time that the website's \"values\" page was updated regarding its \"privacy\" section. The video reached the top of the website's main feed. Shortly thereafter, announcements concerning new advertisement content drew criticism on the website.\nIn September, a user named \"mormondocuments\" released thousands of administrative documents belonging to the Church of Jesus Christ of Latter-day Saints, an action driven by the ex-Mormon and atheist communities on Reddit. Previously, on April 22, the same user had announced his plans to do so. Church officials commented that the documents did not contain anything confidential.\nOn November 23, Huffman admitted to having replaced his username with the names of r/The_Donald moderators in many insulting comments. He did so by changing insulting comments made towards him and made it appear as if the insult were directed at the moderators of r/The_Donald.\nOn November 24, The Washington Post reported Reddit had banned the \"Pizzagate\" conspiracy board from their site, stating it violated their policy of posting personal information of others, triggering a wave of criticism from users on r/The_Donald, who felt the ban amounted to censorship. After the forum was banned from Reddit, the words \"we don't want witchhunts on our site\" now appears on the former page of the Pizzagate subreddit.\nOn November 30, Huffman announced changes to the algorithm of Reddit's r/all page to block \"stickied\" posts from a number of subreddits, such as r/The_Donald. In the announcement, he also apologized for personally editing posts by users from r/The_Donald, and declared intentions to take actions against \"hundreds of the most toxic users\" of Reddit and \"communities whose users continually cross the line\".\n\n2017\nIn February, Reddit banned the alt-right subreddit r/altright for violating its terms of service, more specifically for attempting to share private information about the man who attacked alt-right figure Richard B. Spencer. The forum's users and moderators accused Reddit administrators of having political motivations for the ban.\n\n2018\nIn March, it was revealed that Huffman had hidden Russian troll activity from users.\nOn July 12, the creator and head moderator of the GamerGate subreddit, r/KotakuInAction, removed all of the moderators and set the forum to private, alleging it to have become \"infested with racism and sexism\". A Reddit employee restored the forum and its moderators an hour later.\n\n2019\nIn February, Chinese company Tencent invested $150 million into Reddit. This resulted in a large backlash from Reddit users, who were worried about potential censorship. Many posts featuring subjects censored in China, such as Tiananmen Square, Tank Man, and Winnie the Pooh, received popularity on Reddit.\n\n2020\nDuring the George Floyd protests in early June, over 800 moderators signed an open letter demanding a policy banning hate speech, a shutdown of racist and sexist subreddits, and more employee support for moderation. Bloomberg News pointed out the company's slow reaction to r/watchpeopledie, a subreddit dedicated to videos of people dying in accidents and other situations, and the harassment that accompanied new unmoderated features like icons for purchase and public chats.\nOn June 29, Reddit updated its content policy and introduced rules aimed at curbing the presence of communities they believed to be \"promoting hate\", and banned approximately 2,000 subreddits that were found to be in violation of the new guidelines on the same day. Larger subreddits affected by the bans included r/The_Donald, r/GenderCritical (the platform's largest and most active anti-transgender radical feminist subreddit), and r/ChapoTrapHouse (a far-left subreddit originally created by fans of the podcast Chapo Trap House). Some media outlets and political commentators also condemned the banning of the r/The_Donald and r/ChapoTrapHouse subreddits as a violation of the right to free political expression.\n\n2021\nAfter the 2021 storming of the United States Capitol, Reddit banned the subreddit r/DonaldTrump in response to repeated policy violations and alluding to the potential influence the community had on those who participated in or supported the storming. The move followed similar actions from social media platforms, Twitter, YouTube, TikTok and more. The ban was criticized by those who believed it furthered an agenda and censorship of conservative ideologies. The subreddit had over 52,000 members just before it was banned.\nThe GameStop short squeeze was primarily organized on the subreddit r/wallstreetbets in January.\nIn March, Reddit users discovered that Aimee Challenor, an English politician who had been suspended from two UK political parties, was hired as an administrator for the site. Her first suspension from the Green Party came for retaining her father as her campaign manager after his arrest on child sexual abuse charges. She was later suspended from the Liberal Democrats after tweets describing pedophilic fantasies were discovered on her partner's Twitter account. Reddit banned a moderator for posting a news article which mentioned Challenor, and some Reddit users alleged that Reddit were removing all mention of Challenor. Many subreddits, including r/Music, which had 27 million subscribers, and 46 other subreddits with over 1 million subscribers, went private in protest. On March 24, Reddit's CEO Steve Huffman said that Challenor had been inadequately vetted before being hired and that Reddit would review its relevant internal processes. Huffman attributed user suspensions to over-indexing on anti-harassment measures. Challenor was also removed from her role as a Reddit admin.\nIn late August, more than 70 subreddits went private to protest against COVID-19 misinformation on Reddit, as well as Reddit's refusal to delete subreddits undermining the severity of the pandemic. A 2021 letter from the United States Senate to Reddit CEO Steve Huffman expressed concern about the spread of COVID-19 misinformation on the platform.\n\n2023\nIn October, Reddit Moons (a site-specific cryptocurrency launched in May 2020) had seen a surge of value in 2023, at one point in mid-2023 rising past 50 cents per moon, but it crashed by more than 90% after it was announced on October 17 that the token would be \"wound down\" on November 8, allegedly due to scaling and regulatory issues; Reddit-centric coins DONUT and BRICK also crashed upon the news.\n\n2024\nIn September, the Federal Trade Commission released a report summarizing 9 company responses (including from Reddit) to orders made by the agency pursuant to Section 6(b) of the Federal Trade Commission Act of 1914 to provide information about user and non-user data collection (including of children and teenagers) and data use by the companies that found that the companies' user and non-user data practices put individuals vulnerable to identity theft, stalking, unlawful discrimination, emotional distress and mental health issues, social stigma, and reputational harm.\n\nScience\nA 2014 study showed how subreddits can support role-based group recommendations or provide evaluation towards group stability and growth. Another study evoked a connection between cognitive and attention dynamics and the usage of online social peer production platforms, including the effects of deterioration of user performance. There is also work that has studied the influence of Reddit posts on the popularity of Wikipedia content. A participant-observation study of April Fools' Day 2017 social experiment on r/place identified top-down and bottom-up coordination mechanisms, rules and emergence, and analyzed their relative impact on the collaboratively created artwork, revealing cooperation and conflict, using qualitative and quantitative methods.\nData from Reddit can also be used to assess academic publications.\n\nSee also\nSimilar websites\nNotes\nReferences\nFurther reading\nForestal, Jennifer (January 2021) [December 3, 2020 (published online)]. \"Beyond Gatekeeping: Propaganda, Democracy, and the Organization of Digital Publics\". The Journal of Politics. 83 (1): 306–320. doi:10.1086/709300. S2CID 216325883.\n\nExternal links\n\nOfficial website \nBusiness data for Reddit, Inc.: \nreddittorjg6rue252oqsxryoxengawnmo46qy4kyii5wtqnwfj4ooad.onion (Accessing link help)\n\"Live Episode! Reddit: Alexis Ohanian & Steve Huffman\"—How I Built This (audio interview with founders)\n",
  "categories": [
    "Category:2005 establishments in Massachusetts",
    "Category:2024 initial public offerings",
    "Category:Aggregation websites",
    "Category:All articles containing potentially dated statements",
    "Category:American social networking websites",
    "Category:Android (operating system) software",
    "Category:Articles containing potentially dated statements from 2018",
    "Category:Articles containing potentially dated statements from April 2018",
    "Category:Articles containing potentially dated statements from August 2018",
    "Category:Articles containing potentially dated statements from August 2021",
    "Category:Articles containing potentially dated statements from December 2023",
    "Category:Articles containing potentially dated statements from July 2018",
    "Category:Articles containing potentially dated statements from November 2009",
    "Category:Articles with short description",
    "Category:Community websites",
    "Category:Companies based in San Francisco",
    "Category:Companies listed on the New York Stock Exchange",
    "Category:Condé Nast websites",
    "Category:Economy of San Francisco",
    "Category:Formerly open-source or free software",
    "Category:Internet forums",
    "Category:Internet properties established in 2005",
    "Category:Media sharing",
    "Category:Pages including recorded pronunciations",
    "Category:Pages using Sister project links with hidden wikidata",
    "Category:Pages using Sister project links with wikidata namespace mismatch",
    "Category:Pages using the Phonos extension",
    "Category:Proprietary wiki software",
    "Category:Python (programming language) software",
    "Category:Question-and-answer websites",
    "Category:Reddit",
    "Category:Short description is different from Wikidata",
    "Category:Social bookmarking websites",
    "Category:Social media companies of the United States",
    "Category:Tor onion services",
    "Category:Use mdy dates from December 2024",
    "Category:Webarchive template wayback links",
    "Category:Wikipedia indefinitely semi-protected pages",
    "Category:Y Combinator companies"
  ],
  "archived_date": "20241220_214835",
  "source_url": "https://en.wikipedia.org/wiki/Reddit"
}