{
  "title": "Reflective programming",
  "summary": "In computer science, reflective programming or reflection is the ability of a process to examine, introspect, and modify its own structure and behavior.",
  "content": "---\ntitle: Reflective programming\nurl: https://en.wikipedia.org/wiki/Reflective_programming\nlanguage: en\ncategories: [\"Category:All articles needing additional references\", \"Category:All articles with unsourced statements\", \"Category:Articles needing additional references from January 2008\", \"Category:Articles with example BASIC code\", \"Category:Articles with example C Sharp code\", \"Category:Articles with example C code\", \"Category:Articles with example JavaScript code\", \"Category:Articles with example Java code\", \"Category:Articles with example Julia code\", \"Category:Articles with example Lisp (programming language) code\", \"Category:Articles with example Objective-C code\", \"Category:Articles with example PHP code\", \"Category:Articles with example Pascal code\", \"Category:Articles with example Perl code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with example R code\", \"Category:Articles with example Ruby code\", \"Category:Articles with short description\", \"Category:Articles with unsourced statements from July 2015\", \"Category:Programming constructs\", \"Category:Programming language comparisons\", \"Category:Short description is different from Wikidata\", \"Category:Webarchive template wayback links\"]\nreferences: 0\nlast_modified: 2024-12-19T13:43:53Z\n---\n\n# Reflective programming\n\n## Summary\n\nIn computer science, reflective programming or reflection is the ability of a process to examine, introspect, and modify its own structure and behavior.\n\n## Full Content\n\nIn computer science, reflective programming or reflection is the ability of a process to examine, introspect, and modify its own structure and behavior.\n\nHistorical background\nThe earliest computers were programmed in their native assembly languages, which were inherently reflective, as these original architectures could be programmed by defining instructions as data and using self-modifying code. As the bulk of programming moved to higher-level compiled languages such as Algol, Cobol, Fortran, Pascal, and C, this reflective ability largely disappeared until new programming languages with reflection built into their type systems appeared.\nBrian Cantwell Smith's 1982 doctoral dissertation introduced the notion of computational reflection in procedural programming languages and the notion of the meta-circular interpreter as a component of 3-Lisp.\n\nUses\nReflection helps programmers make generic software libraries to display data, process different formats of data, perform serialization and deserialization of data for communication, or do bundling and unbundling of data for containers or bursts of communication.\nEffective use of reflection almost always requires a plan: A design framework, encoding description, object library, a map of a database or entity relations.\nReflection makes a language more suited to network-oriented code. For example, it assists languages such as Java to operate well in networks by enabling libraries for serialization, bundling and varying data formats. Languages without reflection such as C are required to use auxiliary compilers for tasks like Abstract Syntax Notation to produce code for serialization and bundling.\nReflection can be used for observing and modifying program execution at runtime. A reflection-oriented program component can monitor the execution of an enclosure of code and can modify itself according to a desired goal of that enclosure. This is typically accomplished by dynamically assigning program code at runtime.\nIn object-oriented programming languages such as Java, reflection allows inspection of classes, interfaces, fields and methods at runtime without knowing the names of the interfaces, fields, methods at compile time. It also allows instantiation of new objects and invocation of methods.\nReflection is often used as part of software testing, such as for the runtime creation/instantiation of mock objects.\nReflection is also a key strategy for metaprogramming.\nIn some object-oriented programming languages such as C# and Java, reflection can be used to bypass member accessibility rules. For C#-properties this can be achieved by writing directly onto the (usually invisible) backing field of a non-public property. It is also possible to find non-public methods of classes and types and manually invoke them. This works for project-internal files as well as external libraries such as .NET's assemblies and Java's archives.\n\nImplementation\nA language that supports reflection provides a number of features available at runtime that would otherwise be difficult to accomplish in a lower-level language. Some of these features are the abilities to:\n\nDiscover and modify source-code constructions (such as code blocks, classes, methods, protocols, etc.) as first-class objects at runtime.\nConvert a string matching the symbolic name of a class or function into a reference to or invocation of that class or function.\nEvaluate a string as if it were a source-code statement at runtime.\nCreate a new interpreter for the language's bytecode to give a new meaning or purpose for a programming construct.\nThese features can be implemented in different ways. In MOO, reflection forms a natural part of everyday programming idiom. When verbs (methods) are called, various variables such as verb (the name of the verb being called) and this (the object on which the verb is called) are populated to give the context of the call. Security is typically managed by accessing the caller stack programmatically: Since callers() is a list of the methods by which the current verb was eventually called, performing tests on callers()[0] (the command invoked by the original user) allows the verb to protect itself against unauthorised use.\nCompiled languages rely on their runtime system to provide information about the source code. A compiled Objective-C executable, for example, records the names of all methods in a block of the executable, providing a table to correspond these with the underlying methods (or selectors for these methods) compiled into the program. In a compiled language that supports runtime creation of functions, such as Common Lisp, the runtime environment must include a compiler or an interpreter.\nReflection can be implemented for languages without built-in reflection by using a program transformation system to define automated source-code changes.\n\nSecurity considerations\nReflection may allow a user to create unexpected control flow paths through an application, potentially bypassing security measures. This may be exploited by attackers. Historical vulnerabilities in Java caused by unsafe reflection allowed code retrieved from potentially untrusted remote machines to break out of the Java sandbox security mechanism. A large scale study of 120 Java vulnerabilities in 2013 concluded that unsafe reflection is the most common vulnerability in Java, though not the most exploited.\n\nExamples\nThe following code snippets create an instance foo of class Foo and invoke its method PrintHello. For each programming language, normal and reflection-based call sequences are shown.\n\nCommon Lisp\nThe following is an example in Common Lisp using the Common Lisp Object System:\n\nC#\nThe following is an example in C#:\n\nDelphi, Object Pascal\nThis Delphi and Object Pascal example assumes that a TFoo class has been declared in a unit called Unit1:\n\neC\nThe following is an example in eC:\n\nGo\nThe following is an example in Go:\n\nJava\nThe following is an example in Java:\n\nJavaScript\nThe following is an example in JavaScript:\n\nJulia\nThe following is an example in Julia:\n\nObjective-C\nThe following is an example in Objective-C, implying either the OpenStep or Foundation Kit framework is used:\n\nPerl\nThe following is an example in Perl:\n\nPHP\nThe following is an example in PHP:\n\nPython\nThe following is an example in Python:\n\nR\nThe following is an example in R:\n\nRuby\nThe following is an example in Ruby:\n\nXojo\nThe following is an example using Xojo:\n\nSee also\nList of reflective programming languages and platforms\nMirror (programming)\nProgramming paradigms\nSelf-hosting (compilers)\nSelf-modifying code\nType introspection\ntypeof\n\nReferences\nCitations\nSources\nFurther reading\nIra R. Forman and Nate Forman, Java Reflection in Action (2005), ISBN 1-932394-18-4\nIra R. Forman and Scott Danforth, Putting Metaclasses to Work (1999), ISBN 0-201-43305-2\n\nExternal links\nReflection in logic, functional and object-oriented programming: a short comparative study\nAn Introduction to Reflection-Oriented Programming\nBrian Foote's pages on Reflection in Smalltalk\nJava Reflection API Tutorial from Oracle\n",
  "categories": [
    "Category:All articles needing additional references",
    "Category:All articles with unsourced statements",
    "Category:Articles needing additional references from January 2008",
    "Category:Articles with example BASIC code",
    "Category:Articles with example C Sharp code",
    "Category:Articles with example C code",
    "Category:Articles with example JavaScript code",
    "Category:Articles with example Java code",
    "Category:Articles with example Julia code",
    "Category:Articles with example Lisp (programming language) code",
    "Category:Articles with example Objective-C code",
    "Category:Articles with example PHP code",
    "Category:Articles with example Pascal code",
    "Category:Articles with example Perl code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with example R code",
    "Category:Articles with example Ruby code",
    "Category:Articles with short description",
    "Category:Articles with unsourced statements from July 2015",
    "Category:Programming constructs",
    "Category:Programming language comparisons",
    "Category:Short description is different from Wikidata",
    "Category:Webarchive template wayback links"
  ],
  "archived_date": "20241221_183044",
  "source_url": "https://en.wikipedia.org/wiki/Reflective_programming"
}