{
  "title": "SCons",
  "summary": "SCons is a software development tool that analyzes source code dependencies and operating system adaptation requirements from a software project description and generates final binary executables for installation on the target operating system platform. Its function is similar to the more popular GNU build system.\nThe tool generates Python scripts for project configuration and build logic.",
  "content": "---\ntitle: SCons\nurl: https://en.wikipedia.org/wiki/SCons\nlanguage: en\ncategories: [\"Category:All articles with unsourced statements\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with unsourced statements from March 2014\", \"Category:Build automation\", \"Category:Compiling tools\", \"Category:Free software programmed in Python\", \"Category:Official website different in Wikidata and Wikipedia\", \"Category:Pages displaying wikidata descriptions as a fallback via Module:Annotated link\", \"Category:Software using the MIT license\"]\nreferences: 0\nlast_modified: 2024-12-18T11:29:15Z\n---\n\n# SCons\n\n## Summary\n\nSCons is a software development tool that analyzes source code dependencies and operating system adaptation requirements from a software project description and generates final binary executables for installation on the target operating system platform. Its function is similar to the more popular GNU build system.\nThe tool generates Python scripts for project configuration and build logic.\n\n## Full Content\n\nSCons is a software development tool that analyzes source code dependencies and operating system adaptation requirements from a software project description and generates final binary executables for installation on the target operating system platform. Its function is similar to the more popular GNU build system.\nThe tool generates Python scripts for project configuration and build logic.\n\nHistory\nThe Cons software construction utility, written in the Perl, was created by Bob Sidebotham in 1999. It served as a base for the ScCons build tool, a design which won the Software Carpentry project SC Build competition in August 2000.  ScCons was the foundation for SCons.\nSCons inspired the creation of Waf, formerly known as SCons/BKsys, which emerged in the KDE community. For some time, there were plans to use it as the build tool for KDE 4 and beyond, but that effort was abandoned in favor of CMake.\nNotable projects that use SCons (or used it at one time) include: The Battle for Wesnoth, Battlefield 1942, Doom 3, FCEUX, gem5, gpsd, GtkRadiant, Madagascar, Mixxx, MongoDB, Nullsoft Scriptable Install System, OpenNebula, VMware,, Wolfenstein: Enemy Territory, XORP and MCA2, openpilot and Godot.\n.csig is the SCons Content Signature file format.\n\nFeatures\nMajor features include:\n\nConfiguration files are Python; user-written builds can leverage a general-purpose, cross-platform programming language\nDependency analysis for C, C++ and Fortran\nDependency analysis is extensible through user-defined scanners for other languages or file types; unlike GNU Compiler Collection (GCC) dependency analysis, SCons uses a regular expression scan for included source files\nBuilt-in support for C, C++, D, Java, Fortran, Objective-C, Yacc, Lex, Qt and SWIG, as well as TeX and LaTeX documents\nSupport for other languages via custom builders\nBuilding from central repositories of source code and pre-built targets\nAbility to use Visual Studio, including the generation of .dsp, .dsw, .sln and .vcproj files\nDetection of file content changes using MD5 signatures; optional, configurable ability to use traditional timestamps\nAbility to do parallel builds, maintaining a specified number of jobs running simultaneously regardless of directory hierarchy\nAutoconf-like support for finding #include files, libraries, functions and typedefs\nGlobal view of dependencies, so multiple build passes or reordering targets is not required.\nAbility to share built files in a cache to speed up multiple builds - like ccache but for any type of target file, not just C/C++ compilation\nDesigned from the ground up for cross-platform builds; known to work on POSIX systems (including Linux, AIX and OS/2, *BSD Unices, HP-UX, SGI IRIX, Solaris, illumos), Windows NT, OS X\n\nExamples\nThe following is an SConstruct file that builds a hello world C program using the default platform compiler:\n\nThe following is a SConstruct file for a project that includes two source files and specifies build tool options:\n\nSee also\nBuildout – programming tool aimed to assist with deploying softwarePages displaying wikidata descriptions as a fallback\nqmake – software build tool that generates MakefilesPages displaying wikidata descriptions as a fallback\nQbs (build tool) – cross-platform free and open-source software for managing the build process of softwarePages displaying wikidata descriptions as a fallback\nPremake – Cross-platform build tool for configuring platform-specific builds\nList of build automation software\n\nReferences\nExternal links\nOfficial website\n",
  "categories": [
    "Category:All articles with unsourced statements",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with unsourced statements from March 2014",
    "Category:Build automation",
    "Category:Compiling tools",
    "Category:Free software programmed in Python",
    "Category:Official website different in Wikidata and Wikipedia",
    "Category:Pages displaying wikidata descriptions as a fallback via Module:Annotated link",
    "Category:Software using the MIT license"
  ],
  "archived_date": "20241221_183036",
  "source_url": "https://en.wikipedia.org/wiki/SCons"
}