{
  "title": "Stackless Python",
  "summary": "Stackless Python, or Stackless, is a Python programming language interpreter, so named because it avoids depending on the C call stack for its own stack. In practice, Stackless Python uses the C stack, but the stack is cleared between function calls. The most prominent feature of Stackless is microthreads, which avoid much of the overhead associated with usual operating system threads. In addition to Python features, Stackless also adds support for coroutines, communication channels, and task se",
  "content": "---\ntitle: Stackless Python\nurl: https://en.wikipedia.org/wiki/Stackless_Python\nlanguage: en\ncategories: [\"Category:All articles lacking reliable references\", \"Category:All articles needing additional references\", \"Category:Articles lacking reliable references from December 2017\", \"Category:Articles needing additional references from March 2013\", \"Category:Articles with multiple maintenance issues\", \"Category:Articles with short description\", \"Category:Concurrent computing\", \"Category:Python (programming language) implementations\", \"Category:Short description matches Wikidata\", \"Category:Software using the PSF license\"]\nreferences: 0\nlast_modified: 2024-12-19T13:49:33Z\n---\n\n# Stackless Python\n\n## Summary\n\nStackless Python, or Stackless, is a Python programming language interpreter, so named because it avoids depending on the C call stack for its own stack. In practice, Stackless Python uses the C stack, but the stack is cleared between function calls. The most prominent feature of Stackless is microthreads, which avoid much of the overhead associated with usual operating system threads. In addition to Python features, Stackless also adds support for coroutines, communication channels, and task se\n\n## Full Content\n\nStackless Python, or Stackless, is a Python programming language interpreter, so named because it avoids depending on the C call stack for its own stack. In practice, Stackless Python uses the C stack, but the stack is cleared between function calls. The most prominent feature of Stackless is microthreads, which avoid much of the overhead associated with usual operating system threads. In addition to Python features, Stackless also adds support for coroutines, communication channels, and task serialization.\n\nDesign\nWith Stackless Python, a running program is split into microthreads that are managed by the language interpreter itself, not the operating system kernel—context switching and task scheduling is done purely in the interpreter (these are thus also regarded as a form of green thread). Microthreads manage the execution of different subtasks in a program on the same CPU core. Thus, they are an alternative to event-based asynchronous programming and also avoid the overhead of using separate threads for single-core programs (because no mode switching between user mode and kernel mode needs to be done, so CPU usage can be reduced).\nAlthough microthreads make it easier to deal with running subtasks on a single core, Stackless Python does not remove CPython's global interpreter lock (GIL), nor does it use multiple threads and/or processes. So it allows only cooperative multitasking on a shared CPU and not parallelism (preemption was originally not available but is now in some form). To use multiple CPU cores, one would still need to build an interprocess communication system on top of Stackless Python processes.\nDue to the considerable number of changes in the source, Stackless Python cannot be installed on a preexisting Python installation as an extension or library. It is instead a complete Python distribution in itself. The majority of Stackless's features have also been implemented in PyPy, a self-hosting Python interpreter and JIT compiler.\n\nUse\nAlthough the whole Stackless is a separate distribution, its switching functionality has been successfully packaged as a CPython extension called greenlet. It is used by a number of libraries (e.g. gevent) to provide a green threading solution for CPython. Python since has received a native solution for green threads: await/async.\nStackless is used extensively in the implementation of the Eve Online massively multiplayer online game as well as in IronPort's mail platform.\n\nSee also\nErlang (programming language)\nLimbo (programming language)\nGo (programming language)\nSCOOP (software)\n\nReferences\nExternal links\nOfficial website \nStackless Python Documentation for: 3.7-slp, 3.6-slp, 3.5-slp, 3.4-slp, 2.7-slp\nstackless on GitHub\nMultithreaded Game Scripting with Stackless Python by Harry Kalogirou\nContinuations and Stackless Python by Christian Tismer\n",
  "categories": [
    "Category:All articles lacking reliable references",
    "Category:All articles needing additional references",
    "Category:Articles lacking reliable references from December 2017",
    "Category:Articles needing additional references from March 2013",
    "Category:Articles with multiple maintenance issues",
    "Category:Articles with short description",
    "Category:Concurrent computing",
    "Category:Python (programming language) implementations",
    "Category:Short description matches Wikidata",
    "Category:Software using the PSF license"
  ],
  "archived_date": "20241220_214819",
  "source_url": "https://en.wikipedia.org/wiki/Stackless_Python"
}