{
  "title": "Type introspection",
  "summary": "In computing, type introspection is the ability of a program to examine the type or properties of an object\nat runtime.\nSome programming languages possess this capability.\nIntrospection should not be confused with reflection, which goes a step further and is the ability for a program to manipulate the metadata, properties, and functions of an object at runtime.  Some programming languages also possess that capability  (e.g.,\nJava,\nPython,\nJulia,\nand\nGo).",
  "content": "---\ntitle: Type introspection\nurl: https://en.wikipedia.org/wiki/Type_introspection\nlanguage: en\ncategories: [\"Category:All articles with style issues\", \"Category:All articles with too many examples\", \"Category:Articles with example C++ code\", \"Category:Articles with example Java code\", \"Category:Articles with example Objective-C code\", \"Category:Articles with example PHP code\", \"Category:Articles with example Pascal code\", \"Category:Articles with example Perl code\", \"Category:Articles with example Python (programming language) code\", \"Category:Articles with example Ruby code\", \"Category:Articles with multiple maintenance issues\", \"Category:Articles with too many examples from December 2011\", \"Category:Object-oriented programming\", \"Category:Programming language comparisons\", \"Category:Wikipedia articles with style issues from December 2011\"]\nreferences: 0\nlast_modified: 2024-12-19T23:48:55Z\n---\n\n# Type introspection\n\n## Summary\n\nIn computing, type introspection is the ability of a program to examine the type or properties of an object\nat runtime.\nSome programming languages possess this capability.\nIntrospection should not be confused with reflection, which goes a step further and is the ability for a program to manipulate the metadata, properties, and functions of an object at runtime.  Some programming languages also possess that capability  (e.g.,\nJava,\nPython,\nJulia,\nand\nGo).\n\n## Full Content\n\nIn computing, type introspection is the ability of a program to examine the type or properties of an object\nat runtime.\nSome programming languages possess this capability.\nIntrospection should not be confused with reflection, which goes a step further and is the ability for a program to manipulate the metadata, properties, and functions of an object at runtime.  Some programming languages also possess that capability  (e.g.,\nJava,\nPython,\nJulia,\nand\nGo).\n\nExamples\nObjective-C\nIn Objective-C, for example, both the generic Object and NSObject (in Cocoa/OpenStep) provide the method isMemberOfClass: which returns true if the argument to the method is an instance of the specified class. The method isKindOfClass: analogously returns true if the argument inherits from the specified class.\nFor example, say we have an Apple and an Orange class inheriting from Fruit.\nNow, in the eat method we can write\n\nNow, when eat is called with a generic object (an id), the function will behave correctly depending on the type of the generic object.\n\nC++\nC++ supports type introspection via the run-time type information (RTTI) typeid and dynamic_cast keywords.\nThe dynamic_cast expression can be used to determine whether a particular object is of a particular derived class. For instance:\n\nThe typeid operator retrieves a std::type_info object describing the most derived type of an object:\n\nObject Pascal\nType introspection has been a part of Object Pascal since the original release of Delphi, which uses RTTI heavily for visual form design. In Object Pascal, all classes descend from the base TObject class, which implements basic RTTI functionality.  Every class's name can be referenced in code for RTTI purposes; the class name identifier is implemented as a pointer to the class's metadata, which can be declared and used as a variable of type TClass.\nThe language includes an is operator, to determine if an object is or descends from a given class, an as operator, providing a type-checked typecast, and several TObject methods. Deeper introspection (enumerating fields and methods) is traditionally only supported for objects declared in the $M+ (a pragma) state, typically TPersistent, and only for symbols defined in the published section. Delphi 2010 increased this to nearly all symbols.\n\nJava\nThe simplest example of type introspection in Java is the instanceof operator.  The instanceof operator determines whether a particular object belongs to a particular class (or a subclass of that class, or a class that implements that interface).  For instance:\n\nThe java.lang.Class class is the basis of more advanced introspection.\nFor instance, if it is desirable to determine the actual class of an object (rather than whether it is a member of a particular class), Object.getClass() and Class.getName() can be used:\n\nPHP\nIn PHP introspection can be done using instanceof operator. For instance:\n\nPerl\nIntrospection can be achieved using the ref and isa functions in Perl.\nWe can introspect the following classes and their corresponding instances:\n\nusing:\n\nMeta-Object Protocol\nMuch more powerful introspection in Perl can be achieved using the Moose object system and the Class::MOP meta-object protocol; for example, you can check if a given object does a role X:\n\nThis is how you can list fully qualified names of all of the methods that can be invoked on the object, together with the classes in which they were defined:\n\nPython\nThe most common method of introspection in Python is using the dir function to detail the attributes of an object. For example:\n\nAlso, the built-in functions type and isinstance can be used to determine what an object is while hasattr can determine what an object does. For example:\n\nRuby\nType introspection is a core feature of Ruby. In Ruby, the Object class (ancestor of every class) provides Object#instance_of? and Object#kind_of? methods for checking the instance's class. The latter returns true when the particular instance the message was sent to is an instance of a descendant of the class in question. For example, consider the following example code (you can immediately try this with the Interactive Ruby Shell):\n\nIn the example above, the Class class is used as any other class in Ruby. Two classes are created, A and B, the former is being a superclass of the latter, then one instance of each class is checked. The last expression gives true because A is a superclass of the class of b.\nFurther, you can directly ask for the class of any object, and \"compare\" them (code below assumes having executed the code above):\n\nActionScript\nIn ActionScript (as3), the function flash.utils.getQualifiedClassName can be used to retrieve the class/type name of an arbitrary object.\n\nAlternatively, the operator is can be used to determine if an object is of a specific type:\n\nThis second function can be used to test class inheritance parents as well:\n\nMeta-type introspection\nLike Perl, ActionScript can go further than getting the class name, but all the metadata, functions and other elements that make up an object using the flash.utils.describeType function; this is used when implementing reflection in ActionScript.\n\nSee also\nReification (computer science)\ntypeof\n\nReferences\nExternal links\nIntrospection on Rosetta Code\n",
  "categories": [
    "Category:All articles with style issues",
    "Category:All articles with too many examples",
    "Category:Articles with example C++ code",
    "Category:Articles with example Java code",
    "Category:Articles with example Objective-C code",
    "Category:Articles with example PHP code",
    "Category:Articles with example Pascal code",
    "Category:Articles with example Perl code",
    "Category:Articles with example Python (programming language) code",
    "Category:Articles with example Ruby code",
    "Category:Articles with multiple maintenance issues",
    "Category:Articles with too many examples from December 2011",
    "Category:Object-oriented programming",
    "Category:Programming language comparisons",
    "Category:Wikipedia articles with style issues from December 2011"
  ],
  "archived_date": "20241220_214802",
  "source_url": "https://en.wikipedia.org/wiki/Type_introspection"
}