{
  "title": "Web2py",
  "summary": "Web2py is an open-source web application framework written in the Python programming language. Web2py allows web developers to program dynamic web content using Python. Web2py is designed to help reduce tedious web development tasks, such as developing web forms from scratch, although a web developer may build a form from scratch if required.\nWeb2py was originally designed as a teaching tool with emphasis on ease of use and deployment. Therefore, it does not have any project-level configuration ",
  "content": "---\ntitle: Web2py\nurl: https://en.wikipedia.org/wiki/Web2py\nlanguage: en\ncategories: [\"Category:All articles needing additional references\", \"Category:All articles with self-published sources\", \"Category:Articles needing additional references from November 2013\", \"Category:Articles with self-published sources from April 2024\", \"Category:Articles with short description\", \"Category:Free content management systems\", \"Category:Python (programming language) web frameworks\", \"Category:Short description matches Wikidata\"]\nreferences: 0\nlast_modified: 2024-12-19T14:11:43Z\n---\n\n# Web2py\n\n## Summary\n\nWeb2py is an open-source web application framework written in the Python programming language. Web2py allows web developers to program dynamic web content using Python. Web2py is designed to help reduce tedious web development tasks, such as developing web forms from scratch, although a web developer may build a form from scratch if required.\nWeb2py was originally designed as a teaching tool with emphasis on ease of use and deployment. Therefore, it does not have any project-level configuration \n\n## Full Content\n\nWeb2py is an open-source web application framework written in the Python programming language. Web2py allows web developers to program dynamic web content using Python. Web2py is designed to help reduce tedious web development tasks, such as developing web forms from scratch, although a web developer may build a form from scratch if required.\nWeb2py was originally designed as a teaching tool with emphasis on ease of use and deployment. Therefore, it does not have any project-level configuration files. The design of web2py was inspired by the Ruby on Rails and Django frameworks. Like these frameworks, web2py focuses on rapid development, favors convention over configuration approach and follows a model–view–controller (MVC) architectural pattern.\n\nOverview\nWeb2py is a full-stack framework in that it has built-in components for all major functions, including:\n\nHTTP requests, HTTP responses, cookies, sessions;\nmultiple protocols HTML/XML, REST, ATOM and RSS, RTF and CSV, JSON, JSON-RPC and XML-RPC, AMF-RPC (Flash/Flex), and SOAP;\nCRUD API;\nmultiple authentication mechanisms and role-based access control;\ndatabase abstraction layer (DAL) that dynamically generates SQL and runs on multiple compatible database backends;\nRAM, disk, and memcached-based caching for scalability;\ninternationalization support;\njQuery for Ajax and UI effects;\nautomatic logging of errors with context.\nWeb2py encourages sound software engineering practices such as\n\nthe model–view–controller (MVC) pattern;\nself-submission of web forms;\nserver-side sessions;\nsafe handling of uploaded files.\nWeb2py uses the WSGI protocol, the Python-oriented protocol for communication between web server and web applications. It also provides handlers for CGI and the FastCGI protocols, and it includes the multi-threaded, SSL-enabled Rocket wsgiserver.\n\nDistinctive features\nWeb-based integrated development environment (IDE)\nAll development, debugging, testing, maintenance and remote database administration can (optionally) be performed without third-party tools, via a web interface, itself a web2py application. Internationalization (adding languages and writing translations) can also be performed from this IDE. Each application has an automatically generated database administrative interface, similar to Django. The web IDE also includes web-based testing.\nApplications can also be created from the command line or developed with other IDEs. Further debugging options:\n\nWing IDE allows graphical debugging of web2py applications as you interact with it from your web browser, you can inspect and modify variables, make function calls etc.\nEclipse/PyDev — Eclipse with the Aptana PyDev plugin — supports web2py as well.\nThe extensible pdb debugger is a module of Python's standard library.\nWith the platform-independent open-source Winpdb debugger, one can perform remote debugging over TCP/IP, through encrypted connection.\nThe Hello World program with web2py in its simplest form (simple web page with no template) looks like:\n\nWeb2py includes pure Python-based template language, with no indentation requirements and a server-side Document Object Model (DOM).\nThe template system works without web2py. Joomla 1.x templates can be converted to web2py layouts.\nWeb2py also includes two markup libraries: the markdown2 text-to-HTML filter, which converts Markdown markup to HTML on the fly; and markmin which is inspired by markdown but supports tables, html5 video/audio and oembed protocol.\nA controller without a view automatically uses a generic view that render the variables returned by the controller, enabling the development of an application's business logic before writing HTML. The \"Hello World\" example using a default template:\n\nThe dict() output of an action is automatically rendered in HTML if the page is request with a .html extension, in JSON if the page is requested with a .json extension, in XML if requested with .xml. It supports other protocols including jsonp, rss, ics, google maps, etc. and is extensible.\nHere is a more complex code example which defines a table, and exposes a grid to logged in users:\n\nTicketing system\nEach web2py application comes with a ticketing system:\n\nIf an error occurs, it is logged and a ticket is issued to the user. That allows error tracking.\nErrors and source code are accessible only to the administrator, who can search and retrieve errors by date or client-IP. No error can result in code being exposed to the users.\n\nPortable cron\nCron is a mechanism for creating and running recurrent tasks in background. It looks for an application-specific crontab file which is in standard crontab format. Three modes of operation are available:\n\nSoft cron: cron routines are checked after web page content has been served, does not guarantee execution precision. For unprivileged Apache CGI/WSGI installs.\nHard cron: a cron thread gets started on web2py startup. For Windows and Rocket/standalone web2py installs.\nSystem cron: cron functions get force-called from the command line, usually from the system crontab. For Unix/Linux systems and places where the cron triggers need to be executed even if web2py is not running at the moment; also good for CGI/WSGI installs if you have access to the system crontab.\n\nScheduler\nSince version 2.3 the use of cron is discouraged since web2py comes with a master/worker scheduler. Jobs can be defined in models and are scheduled by creating an entry in the database. Users can start work processes who pickup and execute tasks in background. The schedule is better than cron because it allows to specify more parameters (start time, stop time, number of repetitions, number of trials in case of error) and do a better job at running within constant resource utilization.\n\nBytecode distribution\nWeb2py can compile web applications for distribution in bytecode compiled form, without source code. Unlike frameworks that use specialized template languages for their views, Web2py can also compile the view code into bytecode, since it is pure Python code.\n\nGlobal Environment\nWeb2py is unique in the world of Python web frameworks because models and controllers are executed, not imported. They are not modules. They are executed in a single global environment which is initialized at each HTTP request. This design decision has pros and cons.\nThe major pro is the ease of development, specifically for rapid prototyping. Another pro is that all the objects defined within this environment are cleanly reset at each HTTP request and never shared across requests. This means the developer does not need to worry about changing the state of an object (for example the readable attribute of a database field) or worry about a change leaking to other concurrent requests or other applications. A third advantage is that web2py allows the coexistence of multiple applications under the same instance without conflicts even if they use different versions of the same modules or different modules with the same name.\nThe main disadvantage of the global environment is that model files and controller files are not modules and the order of execution matters (although it can be specified using conditional models). Naming conflict is more likely to occur than in normal Python modules. Some standard Python development tools may not understand objects defined in models and controllers. Moreover, developers must be aware that code in models is executed at every request and this may cause a performance penalty. Nothing in web2py prevents developers from using and importing normal Python modules (model-less approach) and for this purpose web2py provides a thread local object (current) to facilitate access to objects associated to the current request. Yet, in this case, the developer has to be aware of the same pitfalls that other frameworks incur: changing the state of an object defined in a module may affect other concurrent requests.\nAnother con is that, because models and controllers are not class-based, efficient code reuse becomes more difficult, particularly as the inability to inherit from a parent controller (e.g. the ApplicationController in Ruby on Rails) means that common controller functionality must be referenced repeatedly across all controller files.\n\nSupported environments\nOperating systems, Python versions & implementations, virtual machines, hardware\nweb2py runs on Windows, Windows CE phones, Mac, Unix/Linux, Google App Engine, Amazon EC2, and almost any web hosting via Python 2.7/3.5/3.6/pypy.\nThe current binary version of web2py (for Windows or Mac) includes Python 2.7, but the source version can be run on 2.7 and 3.5+. Support for Python 2.6 has been dropped on 2017.\nweb2py since v1.64.0 runs unmodified on Java with Jython 2.5, without any known limitation.\nweb2py code can run with IronPython on .NET. Limitations:\n\nno csv module (so no database I/O);\nno third party database drivers (not even SQLite, so no databases at all);\nno built-in web server (unless you cripple it by removing signals and logging).\nThe web2py binary will run from a USB drive or a portable hard drive without dependencies, like Portable Python.\n\nWeb servers\nWeb2py can service requests via HTTP and HTTPS with its built-in Rocket server, with Apache, Lighttpd, Cherokee, Hiawatha, Nginx and almost any other web server through CGI, FastCGI, WSGI, mod_proxy, and/or mod_python.\n\nIDEs and debuggers\nWhile a number of web2py developers use text editors such as Vim, Emacs or TextMate Web2py also has a built-in web-based IDE. Others prefer more specialized tools providing debugging, refactoring, etc.\n\nAptana Studio with integrated PyDev\nEclipse with PyDev\nEric with built-in debugger.\nWing IDE\nMicrosoft Visual Studio with Python Tools for Visual Studio\nPycharm3 has Web2py framework support\n\nDatabase handling\nThe database abstraction layer (DAL) of web2py dynamically and transparently generates SQL queries and runs on multiple compatible database backend without the need for database-specific SQL commands (though SQL commands can be issued explicitly).\nSQLite is included in Python and is the default web2py database. A connection string change allows connection to Firebird, IBM Db2, Informix, Ingres, Microsoft SQL Server, MySQL, Oracle, PostgreSQL, and Google App Engine (GAE) with some caveats. Specialities:\n\nMultiple database connections.\nAutomatic table creates and alters.\nAutomatic transactions.\nDistributed transactions:\nSince web2py v1.17 with PostgreSQL v8.2 and later, because it provides API for two-phase commits.\nSince web2py v1.70.1 with Firebird and MySQL (experimental).\nGAE is not a relational store, but web2py emulates certain operations.\nThe DAL is fast, at least comparable with SQLAlchemy and Storm.\nWeb2py implements a DAL, not an ORM. An ORM maps database tables into classes representing logical abstractions from the database layer (e.g., a User class or a PurchaseOrder class), and maps records into instances of those classes. The DAL instead maps database tables and records into instances of classes representing sets and records instead of higher-level abstractions. It has very similar syntax to an ORM but it is faster, and can map almost any SQL expressions into DAL expressions. The DAL can be used independently of the rest of web2py.\nHere are some examples of DAL syntax:\n\nThe latest version of the DAL has support for 2D GIS functions with Spatialite and PostGIS. The current API are experimental because of a possible move to 3D APIs.\n\nAutomatic database migrations\nweb2py supports database migrations—change the definition of a table and web2py ALTERs the table accordingly. Migrations are automatic, but can be disabled for any table, and migration is typically disabled when an application is ready for live distribution. Migrations and migration attempts are logged, documenting the changes.\nLimitations:\n\nSQLite cannot alter table and change a column type, but rather simply stores new values according to the new type.\nGAE has no concept of alter-table, so migrations are limited.\n\nLicenses\nWeb2py code is released under GNU Lesser General Public License (LGPL) version 3 as of web2py version 1.91.1.\nWeb2py code before version 1.91.1 was released under GNU GPL v2.0 with commercial exception.\nVarious third-party packages distributed with web2py have their own licenses, generally public domain, MIT or BSD-type licenses. Applications built with web2py are not covered by the LGPL license.\nWeb2py is copyrighted by Massimo DiPierro. The web2py trademark is owned by Massimo DiPierro.\n\nAwards\nIn 2011 InfoWorld ranked web2py highest among the top six Python web frameworks, awarded web2py the Bossie award 2011 for best open source application development software. In 2012 web2py won the InfoWorld Technology of the Year award.\n\nPublications\nweb2py Book\nThe base web2py documentation is The Official web2py Book, by  Massimo DiPierro. The manual is a full web2py application and it's freely available online, in PDF format or printed form.\n\n1st Edition: out of print. Wiley; September 16, 2008; 256 pages; ISBN 978-0-470-43232-7.\n2nd Edition: web2py Manual. Wiley; August 26, 2009; 341 pages; ISBN 978-0-470-59235-9.\n3rd Edition: Lulu; September 25, 2010 357 pages.\n4th Edition: Lulu; December 9, 2011 583 pages.\n5th Edition: PDF Copy; March 3, 2013 614 pages; ISBN 978-0-578-12021-8.\nlatest online sources: on GitHub\n\nOnline documentation\nOnline documentation is linked from the web2py home page, with cookbook, videos, interactive examples, interactive API reference, epydoc s (complete library reference), FAQ, cheat sheet, online tools etc.\n\nCheat sheet for web2py.\nweb2pyslices, recipes posted using the movuca social network in web2py.\nCrash Course in Web2py (5-part series).\nWeb2py slides (old).\n\nVideos\nweb2py Enterprise Web Framework Tutorial.\nweb2py \"Shootout\" video tutorial.\nweb2py on the Google appengine.\nweb2py: Create, edit, and deploy a basic web app.\n\nPrinted\n\"web2py application development cookbook\", Packt, 2012\nWeb programming with web2py; Python Magazine; Marco Tabini & Associates, Inc.; June 2008\n\nBackground\nDevelopers\nThe lead developer of web2py is Massimo DiPierro, an associate professor of Computer Science at DePaul University in Chicago. As of 2011, the web2py homepage lists over 70 \"main contributors\".\n\nDevelopment source code\nThe web2py development source code is available from the main repository:\n\nGit on GitHub: Web2Py\n\nThird-party software included in web2py\nPython-based components:\nRocket, a fast, HTTP/1.1-compliant, multi-threaded, SSL-enabled and streaming-capable WSGI server;\nfcgi.py: a FastCGI/WSGI gateway;\nLogin API for Janrain, Dropbox, Google, LDAP, PAM, X509, CAS, OpenID, OAuth 1&2, Loginza\nsimplejson: a simple, fast, complete, correct and extensible JSON encoder and decoder;\nmarkdown2: a Markdown processor;\nfpdf a library for PDF generation;\nPyRTF: an RTF document generator;\na syntax highlighter;\npysimplesoap for SOAP services;\nPyRSS2Gen: an RSS generator;\nfeedparser: to parse RSS and Atom feeds.\nJavaScript-based components:\njQuery: a lightweight JavaScript library;\nCodeMirror: a free editor for source code;\nC-based components:\nSQLite: a relational database;\nmemcached: a general-purpose distributed memory caching system.\nPayment API for Authorize.Net, Google Wallet, Stripe.com\n\nHistory and naming\nThe source code for the first public version of web2py was released under GNU GPL v2.0 on 2007-09-27 by Massimo DiPierro as the Enterprise Web Framework (EWF). The name was changed twice due to name conflicts: EWF v1.7 was followed by Gluon v1.0, and Gluon v1.15 was followed by web2py v1.16. The license was changed to LGPLv3 as of web2py version 1.91.1 on 2010-12-21.\n\nApplications built on Web2py\nMovuca CMS and Social Network Engine.\nInstant Press Blog platform.\nOurway Social networking site.\nNoobMusic A rock music website.\nLinkFindr Network diagnostic tool.\nStarMaker Develops karaoke-style social music apps.\n\nNotes\nExternal links\n\nOfficial website\n",
  "categories": [
    "Category:All articles needing additional references",
    "Category:All articles with self-published sources",
    "Category:Articles needing additional references from November 2013",
    "Category:Articles with self-published sources from April 2024",
    "Category:Articles with short description",
    "Category:Free content management systems",
    "Category:Python (programming language) web frameworks",
    "Category:Short description matches Wikidata"
  ],
  "archived_date": "20241220_214839",
  "source_url": "https://en.wikipedia.org/wiki/Web2py"
}